{"title": "A Survey of Bugs in AI-Generated Code", "first_label": ["Code", "Bug"], "second_label": [], "data": "R Gao, A Tahir, P Liang, T Susnjak, F Khomh- arXiv preprint arXiv:2512.05239, 2025\nDevelopers are widely using AI code-generation models, aiming to increase \nproductivity and efficiency. However, there are also quality concerns regarding the AI-\ngenerated code. The generated code is produced by models trained on publicly \navailable code, which are known to contain bugs and quality issues. Those issues \ncan cause trust and maintenance challenges during the development process. \nSeveral quality issues associated with AI-generated code have been reported\nCites: Refining chatgpt-generated code: Characterizing and mitigating  \n \nThis message was sent by Google Scholar because you're following new citations to articles written by \nBach Le\n.\nList alerts\nCancel alert", "link": "https://scholar.google.com/scholar_url?url=https://arxiv.org/pdf/2512.05239&hl=en&sa=X&d=12659939482922442082&ei=i3U6aabwDLLrieoPn8iMEA&scisig=ALhkC2QxogbjGFiOFRvWbhINFeYY&oi=scholaralrt&hist=ylyK0_8AAAAJ:4974034551180671527:ALhkC2SEiW6V5LLNyO9vTSEOmBLL&html=&pos=0&folt=cit", "author": ["Bach Le"], "ref": ["1 new citation to articles by Bach Le", "8 new citations to articles by Abhik Roychoudhury", "1 new citation to articles by Thanh Le-Cong", "2 new citations to articles by Xin ZHOU"]}
{"title": "VULPO: Context-Aware Vulnerability Detection via On-Policy LLM Optimization", "first_label": ["Vulnerabilities", "LLM"], "second_label": ["Detection"], "data": "Y Li, F Yu, X Wang- arXiv preprint arXiv:2511.11896, 2025\nThe widespread reliance on open-source software dramatically increases the risk of \nvulnerability exploitation, underscoring the need for effective and scalable \nvulnerability detection (VD). Existing VD techniques, whether traditional machine", "link": "https://scholar.google.com/scholar_url?url=https://arxiv.org/pdf/2511.11896&hl=en&sa=X&d=10211369730271451875&ei=jXU6aaPTD_ql6rQPy6CzuAw&scisig=ALhkC2TG0RGtezWbzYo67gni_dej&oi=scholaralrt&hist=ylyK0_8AAAAJ:17903213248891513419:ALhkC2T269WwPtyd5qvti3WNZV40&html=&pos=0&folt=rel", "author": ["Hong Jin Kang"], "ref": ["Hong Jin Kang - new related research", "Bach Le - new related research"]}
{"title": "SABLM-VD: Vulnerability detection with a semantic-aware binary language model", "first_label": ["Vulnerabilities", "LLM"], "second_label": ["Detection"], "data": "Q Li, T Liu, W Liu, Y Tang, C Liu, W Dong- Information and Software Technology, 2025\nContext: Static detection of binary code vulnerabilities based on deep learning is an \nimportant research field in computer security. Objective: In existing methods, those \nmainly based on code similarity often focus on overall similarity while neglecting", "link": "https://scholar.google.com/scholar_url?url=https://www.sciencedirect.com/science/article/pii/S0950584925002988&hl=en&sa=X&d=8413942622638533513&ei=jXU6aaPTD_ql6rQPy6CzuAw&scisig=ALhkC2QFDE6L-1-sGXrkAhtoU1Y9&oi=scholaralrt&hist=ylyK0_8AAAAJ:17903213248891513419:ALhkC2T269WwPtyd5qvti3WNZV40&html=&pos=1&folt=rel", "author": ["Hong Jin Kang"], "ref": ["Hong Jin Kang - new related research", "Thanh Le-Cong - new related research"]}
{"title": "Attention-Based Code Summarization for Multi-label Vulnerability Detection", "first_label": ["Vulnerabilities", "Code"], "second_label": ["Detection"], "data": "MB Baby, M Atabuzzaman, M Shajalal, G Stevens- International Conference on, 2025\nVulnerabilities in source code can lead to a wide range of issues, such as privacy \nand security breaches, system crashes, data leaks, and unpredictable application \nbehavior. These problems typically arise from improper handling of inputs, memory", "link": "https://scholar.google.com/scholar_url?url=https://link.springer.com/chapter/10.1007/978-981-95-4434-9_20&hl=en&sa=X&d=14439642826913179007&ei=jXU6aaPTD_ql6rQPy6CzuAw&scisig=ALhkC2TJD7aqxLn5eHXESXbFRn8o&oi=scholaralrt&hist=ylyK0_8AAAAJ:17903213248891513419:ALhkC2T269WwPtyd5qvti3WNZV40&html=&pos=2&folt=rel", "author": ["Hong Jin Kang"], "ref": ["Hong Jin Kang - new related research", "Thanh Le-Cong - new related research"]}
{"title": "CIV: Leveraging Causal Subgraphs of Vulnerability for Noise Reduction in Vulnerability Detection", "first_label": ["Vulnerabilities"], "second_label": ["Detection", "Graph"], "data": "Z Gao, L Xiao, X Du, Y Xing- Expert Systems with Applications, 2025\nAccurate vulnerability detection is critical for software security. Although deep \nlearning-based vulnerability detection methods have shown promise in this task, they \ninclude much information unrelated to vulnerability semantics, which we call noise", "link": "https://scholar.google.com/scholar_url?url=https://www.sciencedirect.com/science/article/pii/S0957417425040072&hl=en&sa=X&d=1911796227503386901&ei=jXU6aaPTD_ql6rQPy6CzuAw&scisig=ALhkC2RYTrdtkri1T9-q3e3-4G2W&oi=scholaralrt&hist=ylyK0_8AAAAJ:17903213248891513419:ALhkC2T269WwPtyd5qvti3WNZV40&html=&pos=3&folt=rel", "author": ["Hong Jin Kang"], "ref": ["Hong Jin Kang - new related research", "Thanh Le-Cong - new related research"]}
{"title": "SyzParam: Incorporating Runtime Parameters into Kernel Driver Fuzzing", "first_label": ["Fuzzing"], "second_label": [], "data": "Y Sun, Y Kang, C Wu, K Lu, J Wang, X Li, Y Hu, J Ren- Proceedings of the 2025, 2025\nUnder the monolithic architecture of the Linux kernel, all its components operate \nwithin the same address space. Notably, device drivers constitute over half of the \nkernel codebase yet are particularly prone to bugs. Therefore, exploring", "link": "https://scholar.google.com/scholar_url?url=https://dl.acm.org/doi/pdf/10.1145/3719027.3744838&hl=en&sa=X&d=8581345671286620244&ei=jXU6aaPTD_ql6rQPy6CzuAw&scisig=ALhkC2QmYkfjMt1GZYVw8KVChVuX&oi=scholaralrt&hist=ylyK0_8AAAAJ:17903213248891513419:ALhkC2T269WwPtyd5qvti3WNZV40&html=&pos=4&folt=rel", "author": ["Hong Jin Kang"], "ref": ["Hong Jin Kang - new related research"]}
{"title": "HeteroWaveVD: A Heterogeneous Wavelet-Enhanced Source Code Vulnerability Detection Framework", "first_label": ["Vulnerabilities", "Code"], "second_label": ["Detection"], "data": "Z Li, Y Li, L Yin, J Wang- International Conference on Neural Information, 2025\nDeep learning (DL), with its remarkable capability to automatically extract features \nfrom source code, has emerged as a prominent approach in the field of source code \nvulnerability detection. However, existing methods focus solely on spatial domain", "link": "https://scholar.google.com/scholar_url?url=https://link.springer.com/chapter/10.1007/978-981-95-4109-6_20&hl=en&sa=X&d=10458538465577011179&ei=jXU6aaPTD_ql6rQPy6CzuAw&scisig=ALhkC2Sce6Rg7y5vj-mF3hrwBcTr&oi=scholaralrt&hist=ylyK0_8AAAAJ:17903213248891513419:ALhkC2T269WwPtyd5qvti3WNZV40&html=&pos=5&folt=rel", "author": ["Hong Jin Kang"], "ref": ["Hong Jin Kang - new related research"]}
{"title": "SELink: A semantic-enhanced modular framework for issue-commit link recovery", "first_label": [], "second_label": [], "data": "T Zheng, Y Zhao, J Guo, L Nie, M Jiang, Y Zhou- Information and Software, 2025\nContext: Issue-commit link recovery (ICLR) is a fundamental task in software \ntraceability that aims to reconstruct missing or incomplete links between issue reports \nand code commits. Accurate link recovery supports downstream tasks such as bug", "link": "https://scholar.google.com/scholar_url?url=https://www.sciencedirect.com/science/article/pii/S095058492500312X&hl=en&sa=X&d=4970865220579887836&ei=jXU6aaPTD_ql6rQPy6CzuAw&scisig=ALhkC2Qo_8ww0LppCJ4XysXBLEoZ&oi=scholaralrt&hist=ylyK0_8AAAAJ:17903213248891513419:ALhkC2T269WwPtyd5qvti3WNZV40&html=&pos=6&folt=rel", "author": ["Hong Jin Kang"], "ref": ["Hong Jin Kang - new related research"]}
{"title": "Leveraging Self-Paced Learning for Software Vulnerability Detection", "first_label": ["Vulnerabilities"], "second_label": ["Detection"], "data": "Z Cheng, Y Yang, H Zhang, L Yang, J Hu, J Xu, B Liu- arXiv preprint arXiv, 2025\nSoftware vulnerabilities are major risks to software systems. Recently, researchers \nhave proposed many deep learning approaches to detect software vulnerabilities. \nHowever, their accuracy is limited in practice. One of the main causes is low-quality", "link": "https://scholar.google.com/scholar_url?url=https://arxiv.org/pdf/2511.09212&hl=en&sa=X&d=5804722437182378037&ei=jXU6aaPTD_ql6rQPy6CzuAw&scisig=ALhkC2TqdC9-ll84NKcGcz-v383H&oi=scholaralrt&hist=ylyK0_8AAAAJ:17903213248891513419:ALhkC2T269WwPtyd5qvti3WNZV40&html=&pos=7&folt=rel", "author": ["Hong Jin Kang"], "ref": ["Hong Jin Kang - new related research"]}
{"title": "Towards a Human-in-the-Loop Framework for Reliable Patch Evaluation Using an LLM-as-a-Judge", "first_label": ["LLM"], "second_label": [], "data": "S Shi, R Wei, M Tufano, J Cambronero, R Cheng- arXiv preprint arXiv, 2025\nReliable evaluation is crucial for advancing Automated Program Repair (APR), but \nprevailing benchmarks rely on execution-based evaluation methods (unit test pass@ \nk), which fail to capture true patch validity. Determining validity can require costly", "link": "https://scholar.google.com/scholar_url?url=https://arxiv.org/pdf/2511.10865&hl=en&sa=X&d=8061581052872991843&ei=jXU6aaPTD_ql6rQPy6CzuAw&scisig=ALhkC2SGS-hUNm_axmD03Qqo6q3T&oi=scholaralrt&hist=ylyK0_8AAAAJ:17903213248891513419:ALhkC2T269WwPtyd5qvti3WNZV40&html=&pos=8&folt=rel", "author": ["Hong Jin Kang"], "ref": ["Hong Jin Kang - new related research"]}
{"title": "Enhancing Python Code Maintainability Through Large Language Model-Based Approaches", "first_label": ["LLM", "Code"], "second_label": [], "data": "K Shivashankar, A Martini- International Conference on Product-Focused Software, 2025\nAbstract While Large Language Models (LLMs) increasingly assist in code \ngeneration, concerns persist regarding the maintainability of the code they produce\nan aspect often overshadowed by functional correctness. Overlooking maintainability\n \nThis message was sent by Google Scholar because you're following new articles related to research by \nHong Jin Kang\n.\nList alerts\nCancel alert", "link": "https://scholar.google.com/scholar_url?url=https://link.springer.com/chapter/10.1007/978-3-032-12089-2_9&hl=en&sa=X&d=7804804555056286398&ei=jXU6aaPTD_ql6rQPy6CzuAw&scisig=ALhkC2R1oG9KhoM0jP8EKIA-nrj-&oi=scholaralrt&hist=ylyK0_8AAAAJ:17903213248891513419:ALhkC2T269WwPtyd5qvti3WNZV40&html=&pos=9&folt=rel", "author": ["Hong Jin Kang"], "ref": ["Hong Jin Kang - new related research"]}
{"title": "Applying Generative Artificial Intelligence for Vulnerability Fixing in a Proprietary Software Ecosystem", "first_label": ["Vulnerabilities"], "second_label": [], "data": "LAM Costa, A Fonto, RP Dos Santos, A Serebrenik- Journal of Systems and, 2025\nContext: Large organizations often operate within proprietary software ecosystems \n(PSECO), composed of interdependent software artifacts, multiple actors, and \ncentralized governance. In such environments, addressing security vulnerabilities is \nparticularly challenging due to strict quality standards, regulatory constraints, and the \nrisk of cascading failures. These challenges can compromise delivery schedules, \nincrease operational risk, and force teams to interrupt planned work to address\nCites: Automatic Programming: Large Language Models and Beyond", "link": "https://scholar.google.com/scholar_url?url=https://www.sciencedirect.com/science/article/pii/S0164121225003929&hl=en&sa=X&d=5514791041289778045&ei=i3U6afGhL5iTieoP9sm_0AY&scisig=ALhkC2QjEJr-sYeF7uBkkUJV9S0J&oi=scholaralrt&hist=ylyK0_8AAAAJ:10071049626428824134:ALhkC2SLNtxsIYV7y8T6Ni2J4ruF&html=&pos=0&folt=cit", "author": ["Abhik Roychoudhury"], "ref": ["8 new citations to articles by Abhik Roychoudhury"]}
{"title": "AI-Powered Unit Test Generation via Multi-LLM Chaining: A Case Study With GPT-4o, Gemini, and Claude-3.5", "first_label": ["LLM", "Software Testing"], "second_label": ["Generation"], "data": "C Kumar, US Ponaka, PVLN Naidu, P Bhuvaneswari- IEEE Access, 2025\nSoftware testing is a crucial activity in the software development cycle, as it verifies \ncode correctness, reliability, and maintainabilily. Unit testing involves verifying the \ncorrectness of the individual components of a program. Manually writing these tests \nis resource-intensive and time-consuming. Researchers have proposed various \nautomated test generation methods to overcome this problem. Large Language \nModels have shown great success in automatically generating unit tests recently\nCites: Automatic Programming: Large Language Models and Beyond", "link": "https://scholar.google.com/scholar_url?url=https://ieeexplore.ieee.org/document/11269709/&hl=en&sa=X&d=12530224562241630230&ei=i3U6afGhL5iTieoP9sm_0AY&scisig=ALhkC2TGKzr-S0UWJEcUyWG1ASLi&oi=scholaralrt&hist=ylyK0_8AAAAJ:10071049626428824134:ALhkC2SLNtxsIYV7y8T6Ni2J4ruF&html=&pos=2&folt=cit", "author": ["Abhik Roychoudhury"], "ref": ["8 new citations to articles by Abhik Roychoudhury", "Thanh Le-Cong - new related research"]}
{"title": "Herald of Advancement, Disruption, or Both: A Systematic Literature Review on Student-Facing LLM Tools in Undergraduate Computing Education", "first_label": ["LLM"], "second_label": [], "data": "B Tabarsi, T Yasir, H Reichert, X Tian, S Gadireddy\nThe variety of help that large language models (LLMs) provide has made them \npopular among students across fields. Computing education has been particularly \naffected, as LLMs can handle coding tasks effectively and provide feedback. This has \nraised hopes for supporting students, while creating concerns about learning and \nacademic integrity. Researchers have responded by developing tools that leverage \nLLMs' potential while mitigating risks. Despite growing empirical studies on LLM\nCites: Software Engineering Educational Experience in Building an", "link": "https://scholar.google.com/scholar_url?url=https://www.techrxiv.org/doi/pdf/10.36227/techrxiv.176463808.80840600&hl=en&sa=X&d=13290047663506590954&ei=i3U6afGhL5iTieoP9sm_0AY&scisig=ALhkC2TEXCVf7p9Av2pt-D3rXjaR&oi=scholaralrt&hist=ylyK0_8AAAAJ:10071049626428824134:ALhkC2SLNtxsIYV7y8T6Ni2J4ruF&html=&pos=3&folt=cit", "author": ["Abhik Roychoudhury"], "ref": ["8 new citations to articles by Abhik Roychoudhury"]}
{"title": "BGPFuzz: Automated Configuration Fuzzing of the Border Gateway Protocol", "first_label": ["Fuzzing"], "second_label": [], "data": "C Zhang, A Pasdar, VT Pham- arXiv preprint arXiv:2512.05358, 2025\nTelecommunications networks rely on configurations to define routing behavior, \nespecially in the Border Gateway Protocol (BGP), where misconfigurations can lead \nto severe outages and security breaches, as demonstrated by the 2021 Facebook \noutage. Unlike existing approaches that rely on synthesis or verification, our work \noffers a cost-effective method for identifying misconfigurations resulting from BGP's \ninherent complexity or vendor-specific implementations. We present BGPFuzz, a\nCites: Large language model guided protocol fuzzing", "link": "https://scholar.google.com/scholar_url?url=https://arxiv.org/pdf/2512.05358&hl=en&sa=X&d=8704450551157255430&ei=i3U6afGhL5iTieoP9sm_0AY&scisig=ALhkC2SYICiVr0MoSf6UxUfMLel4&oi=scholaralrt&hist=ylyK0_8AAAAJ:10071049626428824134:ALhkC2SLNtxsIYV7y8T6Ni2J4ruF&html=&pos=4&folt=cit", "author": ["Abhik Roychoudhury"], "ref": ["8 new citations to articles by Abhik Roychoudhury"]}
{"title": "Analyzing the Impact and Perception of Artificial Intelligence in Art and Design since Modern AI Renaissance", "first_label": [], "second_label": [], "data": "F Moriniello - 2025\nThe thesis explores the impact and perception of artificial intelligence (AI) in the \nfields of art and design since the contemporary renaissance of AI (mid-2010s). \nTaking an interdisciplinary approach, the author investigates how AI technologies \nand their public perception are transforming creative production and cultural \ndiscourses. The starting point is the hypothesis that the rise of language and image \nmodels is generating a paradigm shift in artistic creation and design. AI is not\nCites: Automated Repair of Programs from Large Language Models", "link": "https://scholar.google.com/scholar_url?url=https://riunet.upv.es/bitstreams/a4a7368e-d206-4d3b-a586-55484b632f7b/download&hl=en&sa=X&d=1384663505885286801&ei=i3U6afGhL5iTieoP9sm_0AY&scisig=ALhkC2SNu1u0UL7ZXPJc5QaeNr_V&oi=scholaralrt&hist=ylyK0_8AAAAJ:10071049626428824134:ALhkC2SLNtxsIYV7y8T6Ni2J4ruF&html=&pos=5&folt=cit", "author": ["Abhik Roychoudhury"], "ref": ["8 new citations to articles by Abhik Roychoudhury"]}
{"title": "Context-Free Property Oriented Fuzzing", "first_label": ["Fuzzing"], "second_label": [], "data": "J Yao, M Liu, Z Chen, Y Xing, J Luo, Y Luo, G Zhang - 2026\nFuzzing is effective for finding software bugs. However, the bugs specified in context-\nfree properties are difficult for the existing fuzzers. These bugs are triggered when \nthe program execution contains specific sequences of operations, eg, push and pop \noperations on the stack, and locking and unlocking operations on the lock. As far as \nwe know, existing approaches do not support fuzzing for non-regular context-free \nproperties, which are more expressive and can be used to specify bugs in many\nCites: Linear-time Temporal Logic Guided Greybox Fuzzing", "link": "https://scholar.google.com/scholar_url?url=https://zbchen.github.io/files/icse2026.pdf&hl=en&sa=X&d=16681342916118170228&ei=i3U6afGhL5iTieoP9sm_0AY&scisig=ALhkC2T_muvDM9kfINIljMsySUT_&oi=scholaralrt&hist=ylyK0_8AAAAJ:10071049626428824134:ALhkC2SLNtxsIYV7y8T6Ni2J4ruF&html=&pos=6&folt=cit", "author": ["Abhik Roychoudhury"], "ref": ["8 new citations to articles by Abhik Roychoudhury"]}
{"title": "Bootstrapping Fuzzers for Compilers of Low-Resource Language Dialects Using Language Models", "first_label": ["LLM", "Fuzzing"], "second_label": [], "data": "S Vaidya, M Bhme, L D'Antoni- arXiv preprint arXiv:2512.05887, 2025\nModern extensible compiler frameworks-such as MLIR-enable rapid creation of \ndomain-specific language dialects. This flexibility, however, makes correctness \nharder to ensure as the same extensibility that accelerates development also \ncomplicates maintaining the testing infrastructure. Extensible languages require \nautomated test generation that is both dialect-agnostic (works across dialects without \nmanual adaptation) and dialect-effective (targets dialect-specific features to find\nCites: Coverage-based greybox fuzzing as markov chain  \n \nThis message was sent by Google Scholar because you're following new citations to articles written by \nAbhik Roychoudhury\n.\nList alerts\nCancel alert", "link": "https://scholar.google.com/scholar_url?url=https://arxiv.org/pdf/2512.05887&hl=en&sa=X&d=4462874127133540648&ei=i3U6afGhL5iTieoP9sm_0AY&scisig=ALhkC2QrUX2QWbZaardTdZviikC5&oi=scholaralrt&hist=ylyK0_8AAAAJ:10071049626428824134:ALhkC2SLNtxsIYV7y8T6Ni2J4ruF&html=&pos=7&folt=cit", "author": ["Abhik Roychoudhury"], "ref": ["8 new citations to articles by Abhik Roychoudhury", "Thanh Le-Cong - new related research", "David Lo - new related research", "Abhik Roychoudhury - new related research", "Bach Le - new related research", "1 new citation to articles by Hong Jin Kang"]}
{"title": "LoCoBench-Agent: An Interactive Benchmark for LLM Agents in Long-Context Software Engineering", "first_label": ["LLM"], "second_label": ["Agent"], "data": "J Qiu, Z Liu, Z Liu, R Murthy, J Zhang, H Chen, S Wang- arXiv preprint arXiv, 2025\nAs large language models (LLMs) evolve into sophisticated autonomous agents \ncapable of complex software development tasks, evaluating their real-world \ncapabilities becomes critical. While existing benchmarks like LoCoBench~\\cite", "link": "https://scholar.google.com/scholar_url?url=https://arxiv.org/pdf/2511.13998&hl=en&sa=X&d=5068327394060475494&ei=inU6advkJOaQ6rQP07jr0Qc&scisig=ALhkC2RovNoV0ywYVr4A68T8Kt-V&oi=scholaralrt&hist=ylyK0_8AAAAJ:4812769200119993430:ALhkC2RZmRqgZGCFQXCJyP9vthGu&html=&pos=0&folt=rel", "author": ["Thanh Le-Cong"], "ref": ["Thanh Le-Cong - new related research"]}
{"title": "A data-augmented model routing framework for efficient LLM deployment in edgecloud environments: MSM Pozi, Y. Sato", "first_label": ["LLM"], "second_label": [], "data": "MSM Pozi, Y Sato- The Journal of Supercomputing, 2025\nLarge language model (LLM)-based program generation tasks are hindered by high \ncomputational demands. These challenges, along with high deployment costs, often \npose a barrier to practical applications. To address these, we propose a novel data", "link": "https://scholar.google.com/scholar_url?url=https://link.springer.com/article/10.1007/s11227-025-08034-8&hl=en&sa=X&d=3548574653858656275&ei=inU6advkJOaQ6rQP07jr0Qc&scisig=ALhkC2Q4-VJc0taO10AjW_V1NOD2&oi=scholaralrt&hist=ylyK0_8AAAAJ:4812769200119993430:ALhkC2RZmRqgZGCFQXCJyP9vthGu&html=&pos=1&folt=rel", "author": ["Thanh Le-Cong"], "ref": ["Thanh Le-Cong - new related research", "Hong Jin Kang - new related research"]}
{"title": "KTester: Leveraging Domain and Testing Knowledge for More Effective LLM-based Test Generation", "first_label": ["LLM", "Software Testing"], "second_label": ["Generation"], "data": "A Li, M Liu, Z Chen, Z Pei, Z Li, D Dai, Y Wang, Z Zheng- arXiv preprint arXiv, 2025\nAutomated unit test generation using large language models (LLMs) holds great \npromise but often struggles with generating tests that are both correct and \nmaintainable in real-world projects. This paper presents KTester, a novel framework", "link": "https://scholar.google.com/scholar_url?url=https://arxiv.org/pdf/2511.14224&hl=en&sa=X&d=10983934054869938261&ei=inU6advkJOaQ6rQP07jr0Qc&scisig=ALhkC2SnqeAXUhGFyjUYbpo2ILAS&oi=scholaralrt&hist=ylyK0_8AAAAJ:4812769200119993430:ALhkC2RZmRqgZGCFQXCJyP9vthGu&html=&pos=3&folt=rel", "author": ["Thanh Le-Cong"], "ref": ["Thanh Le-Cong - new related research", "Hong Jin Kang - new related research"]}
{"title": "Automated Code Review Assignments: An Alternative Perspective of Code Ownership on GitHub", "first_label": ["Code Review", "Code"], "second_label": [], "data": "JL Lulla, RG Kula, C Treude- arXiv preprint arXiv:2512.05551, 2025\nCode ownership is central to ensuring accountability and maintaining quality in large-\nscale software development. Yet, as external threats such as software supply chain \nattacks on project health and quality assurance increase, mechanisms for assigning", "link": "https://scholar.google.com/scholar_url?url=https://arxiv.org/pdf/2512.05551&hl=en&sa=X&d=2424203832181637890&ei=inU6advkJOaQ6rQP07jr0Qc&scisig=ALhkC2Rob8zeYH2ZySAHMDomExAE&oi=scholaralrt&hist=ylyK0_8AAAAJ:4812769200119993430:ALhkC2RZmRqgZGCFQXCJyP9vthGu&html=&pos=5&folt=rel", "author": ["Thanh Le-Cong"], "ref": ["Thanh Le-Cong - new related research", "David Lo - new related research"]}
{"title": "Go-UT-Bench: A Fine-Tuning Dataset for LLM-Based Unit Test Generation in Go", "first_label": ["LLM", "Software Testing"], "second_label": ["Generation"], "data": "Y Pipalani, H Raj, R Ghosh, V Bhargava, D Dutta- arXiv preprint arXiv:2511.10868, 2025\nTraining data imbalance poses a major challenge for code LLMs. Most available \ndata heavily over represents raw opensource code while underrepresenting broader \nsoftware engineering tasks, especially in low resource languages like Golang. As a", "link": "https://scholar.google.com/scholar_url?url=https://arxiv.org/pdf/2511.10868&hl=en&sa=X&d=16451546716691370203&ei=inU6advkJOaQ6rQP07jr0Qc&scisig=ALhkC2S7c4klrU0tkIMOQ5Ni8xrY&oi=scholaralrt&hist=ylyK0_8AAAAJ:4812769200119993430:ALhkC2RZmRqgZGCFQXCJyP9vthGu&html=&pos=6&folt=rel", "author": ["Thanh Le-Cong"], "ref": ["Thanh Le-Cong - new related research"]}
{"title": "The Cost of AI-Assisted Coding: Energy vs. Accuracy in Language Models", "first_label": ["LLM"], "second_label": [], "data": "N Alizadeh, B Belchev, N Saurabh, P Kelbert - 2025\nGenerative Large Language Models (LLMs) have become widely accessible since \nthe release of ChatGPT in late 2022 [2], and their adoption nearly doubled in under \nsix months [3]. In addition, the majority of developers find code-specific AI models", "link": "https://scholar.google.com/scholar_url?url=https://benevol2025.github.io/pre/paper03.pdf&hl=en&sa=X&d=3874342652444288509&ei=inU6advkJOaQ6rQP07jr0Qc&scisig=ALhkC2Rn562zMHnFoj6JiddHdWsr&oi=scholaralrt&hist=ylyK0_8AAAAJ:4812769200119993430:ALhkC2RZmRqgZGCFQXCJyP9vthGu&html=&pos=8&folt=rel", "author": ["Thanh Le-Cong"], "ref": ["Thanh Le-Cong - new related research", "Abhik Roychoudhury - new related research", "Hong Jin Kang - new related research", "Bach Le - new related research"]}
{"title": "CrossPyEval: Enhancing LLM-based Evaluation of Low-Resource Code via Code Translation", "first_label": ["LLM", "Code"], "second_label": ["Generation"], "data": "W Wu, LI Wu, G Li- The 17th Asian Conference on Machine Learning, 2025\nLarge language models (LLMs) have demonstrated remarkable performance in code \ngeneration and evaluation tasks, particularly for Python, which dominates the pre-\ntraining corpora. However, the evaluation of code in low-resource programming\n \nThis message was sent by Google Scholar because you're following new articles related to research by \nThanh Le-Cong\n.\nList alerts\nCancel alert", "link": "https://scholar.google.com/scholar_url?url=https://openreview.net/pdf%3Fid%3D5qiFpW4lWH&hl=en&sa=X&d=15885618439171632205&ei=inU6advkJOaQ6rQP07jr0Qc&scisig=ALhkC2SIGNUB0bs_75fnhmkDha8R&oi=scholaralrt&hist=ylyK0_8AAAAJ:4812769200119993430:ALhkC2RZmRqgZGCFQXCJyP9vthGu&html=&pos=9&folt=rel", "author": ["Thanh Le-Cong"], "ref": ["Thanh Le-Cong - new related research"]}
{"title": "Natural Language Summarization Enables Multi-Repository Bug Localization by LLMs in Microservice Architectures", "first_label": ["LLM", "Bug"], "second_label": ["Localization"], "data": "AR Oskooei, SS Yukcu, MC Bozoglan, MS Aktas- arXiv preprint arXiv:2512.05908, 2025\nBug localization in multi-repository microservice architectures is challenging due to \nthe semantic gap between natural language bug reports and code, LLM context \nlimitations, and the need to first identify the correct repository. We propose reframing \nthis as a natural language reasoning task by transforming codebases into \nhierarchical NL summaries and performing NL-to-NL search instead of cross-modal \nretrieval. Our approach builds context-aware summaries at file, directory, and\nCites: Bridging Bug Localization and Issue Fixing: A Hierarchical  \n \nThis message was sent by Google Scholar because you're following new citations to articles written by \nXin ZHOU\n.\nList alerts\nCancel alert", "link": "https://scholar.google.com/scholar_url?url=https://arxiv.org/pdf/2512.05908&hl=en&sa=X&d=16109036431100329693&ei=jHU6abGxMP3D6rQPsu6R2AM&scisig=ALhkC2Sv2tfc-bIN1gaOJ3pvDZBU&oi=scholaralrt&hist=ylyK0_8AAAAJ:15035864585353249078:ALhkC2S1ZxbvKZLR2YX67Bvdxjyf&html=&pos=1&folt=cit", "author": ["Xin ZHOU"], "ref": ["2 new citations to articles by Xin ZHOU", "Xin ZHOU - new related research", "David Lo - new related research"]}
{"title": "PrivCode: When Code Generation Meets Differential Privacy", "first_label": ["Code"], "second_label": ["Generation"], "data": "Z Liu, C Gong, TY Zhuo, K Li, W Yu, M Fredrikson- arXiv preprint arXiv, 2025\nLarge language models (LLMs) have presented outstanding performance in code \ngeneration and completion. However, fine-tuning these models on private datasets \ncan raise privacy and proprietary concerns, such as the leakage of sensitive", "link": "https://scholar.google.com/scholar_url?url=https://arxiv.org/pdf/2512.05459&hl=en&sa=X&d=9691996757522526260&ei=jXU6abHJAeCuieoPt7uZuAQ&scisig=ALhkC2Q7rrb3iDyBwTpg9HcWLZgL&oi=scholaralrt&hist=ylyK0_8AAAAJ:16898579961534012346:ALhkC2Q9j5kdmlV_e8u2kLe_NWfw&html=&pos=0&folt=rel", "author": ["Xin ZHOU"], "ref": ["Xin ZHOU - new related research", "David Lo - new related research"]}
{"title": "Assertion-Aware Test Code Summarization with Large Language Models", "first_label": ["LLM", "Code", "Software Testing"], "second_label": [], "data": "A Haque Mollah, A Aljohani, H Do- arXiv e-prints, 2025\nUnit tests often lack concise summaries that convey test intent, especially in auto-\ngenerated or poorly documented codebases. Large Language Models (LLMs) offer a \npromising solution, but their effectiveness depends heavily on how they are", "link": "https://scholar.google.com/scholar_url?url=https://ui.adsabs.harvard.edu/abs/2025arXiv251106227H/abstract&hl=en&sa=X&d=17513451873479255387&ei=jXU6abHJAeCuieoPt7uZuAQ&scisig=ALhkC2TmK5bQuox1KhU82FZHm-qg&oi=scholaralrt&hist=ylyK0_8AAAAJ:16898579961534012346:ALhkC2Q9j5kdmlV_e8u2kLe_NWfw&html=&pos=2&folt=rel", "author": ["Xin ZHOU"], "ref": ["Xin ZHOU - new related research", "David Lo - new related research", "Hong Jin Kang - new related research"]}
{"title": "Investigating Retrieval Augmented Generation for LLM-Based Code Generation", "first_label": ["LLM", "Code"], "second_label": ["Generation"], "data": "P Kivroglou, T Schlippe, S Martin - 2025\nINVESTIGATING RETRIEVAL AUGMENTED GENERATION FOR LLM-BASED CODE \n\r\nGENERATION Page 1 Vienna, Austria November 25, 2025 INVESTIGATING \n\r\nRETRIEVAL AUGMENTED GENERATION FOR LLM-BASED CODE GENERATION", "link": "https://scholar.google.com/scholar_url?url=https://research-karlsruhe.de/pubs/FLLM2025_Kivroglou%2BSchlippe%2BMartin_RAG-LLM-CodeGeneration_slides.pdf&hl=en&sa=X&d=10613850606640757823&ei=jXU6abHJAeCuieoPt7uZuAQ&scisig=ALhkC2SHnfzrA-qjJ07v2H7ExK8d&oi=scholaralrt&hist=ylyK0_8AAAAJ:16898579961534012346:ALhkC2Q9j5kdmlV_e8u2kLe_NWfw&html=&pos=3&folt=rel", "author": ["Xin ZHOU"], "ref": ["Xin ZHOU - new related research", "Abhik Roychoudhury - new related research"]}
{"title": "LLM For Loop Invariant Generation and Fixing: How Far Are We?", "first_label": ["LLM"], "second_label": ["Generation"], "data": "M Rahman Akhond, S Chakraborty, G Uddin- arXiv e-prints, 2025\nA loop invariant is a property of a loop that remains true before and after each \nexecution of the loop. The identification of loop invariants is a critical step to support \nautomated program safety assessment. Recent advancements in Large Language\n \nThis message was sent by Google Scholar because you're following new articles related to research by \nXin ZHOU\n.\nList alerts\nCancel alert", "link": "https://scholar.google.com/scholar_url?url=https://ui.adsabs.harvard.edu/abs/2025arXiv251106552R/abstract&hl=en&sa=X&d=5507453728453334290&ei=jXU6abHJAeCuieoPt7uZuAQ&scisig=ALhkC2SjC23kFojWXX0_llvQ7R8w&oi=scholaralrt&hist=ylyK0_8AAAAJ:16898579961534012346:ALhkC2Q9j5kdmlV_e8u2kLe_NWfw&html=&pos=4&folt=rel", "author": ["Xin ZHOU"], "ref": ["Xin ZHOU - new related research", "David Lo - new related research", "Thanh Le-Cong - new related research"]}
{"title": "An Empirical Study on the Security Vulnerabilities of GPTs", "first_label": ["Vulnerabilities", "LLM"], "second_label": [], "data": "T Wu, W Wu, Z Zheng- arXiv preprint arXiv:2512.00136, 2025\nEquipped with various tools and knowledge, GPTs, one kind of customized AI agents \nbased on OpenAI's large language models, have illustrated great potential in many \nfields, such as writing, research, and programming. Today, the number of GPTs has\n \nThis message was sent by Google Scholar because you're following new articles related to research by \nQuang-Cuong Bui\n.\nList alerts\nCancel alert", "link": "https://scholar.google.com/scholar_url?url=https://arxiv.org/pdf/2512.00136&hl=en&sa=X&d=13668712987477158056&ei=jHU6aaPBAubYieoPyNfA6QY&scisig=ALhkC2SWxFGyYLsV4-w0YxoUAqdn&oi=scholaralrt&hist=ylyK0_8AAAAJ:11088443020050739259:ALhkC2SS1P3l44RDJXsNEdNzDLiT&html=&pos=0&folt=rel", "author": ["Quang-Cuong Bui"], "ref": ["Quang-Cuong Bui - new related research"]}
{"title": "When Forgetting Builds Reliability: LLM Unlearning for Reliable Hardware Code Generation", "first_label": ["LLM", "Code"], "second_label": ["Generation"], "data": "Y Liang, Q Li, S Wang, W Cao- arXiv preprint arXiv:2512.05341, 2025\nLarge Language Models (LLMs) have shown strong potential in accelerating digital \nhardware design through automated code generation. Yet, ensuring their reliability \nremains a critical challenge, as existing LLMs trained on massive heterogeneous", "link": "https://scholar.google.com/scholar_url?url=https://arxiv.org/pdf/2512.05341&hl=en&sa=X&d=17949705039731052055&ei=i3U6abrBHs636rQP1dqb2Aw&scisig=ALhkC2RmS-o1mNXj30lGkTXLTOm2&oi=scholaralrt&hist=ylyK0_8AAAAJ:5865787842749446205:ALhkC2THo_3s8tBI3qmyNrpmj0cv&html=&pos=0&folt=rel", "author": ["David Lo"], "ref": ["David Lo - new related research"]}
{"title": "Engagement in Code Review: Emotional, Behavioral, and Cognitive Dimensions in Peer vs. LLM Interactions", "first_label": ["LLM", "Code Review", "Code"], "second_label": [], "data": "A Alami, N Cassee, TR Silva, E Paja, NA Ernst- arXiv preprint arXiv:2512.05309, 2025\nCode review is a socio-technical practice, yet how software engineers engage in \nLarge Language Model (LLM)-assisted code reviews compared to human peer-led \nreviews is less understood. We report a two-phase qualitative study with 20 software", "link": "https://scholar.google.com/scholar_url?url=https://arxiv.org/pdf/2512.05309&hl=en&sa=X&d=473369942188785420&ei=i3U6abrBHs636rQP1dqb2Aw&scisig=ALhkC2SmS13J2E5MGGhr11_c3Wpo&oi=scholaralrt&hist=ylyK0_8AAAAJ:5865787842749446205:ALhkC2THo_3s8tBI3qmyNrpmj0cv&html=&pos=5&folt=rel", "author": ["David Lo"], "ref": ["David Lo - new related research"]}
{"title": "Beyond Code Pairs: Dialogue-Based Data Generation for LLM Code Translation", "first_label": ["LLM", "Code"], "second_label": ["Generation"], "data": "L Chen, N Xu, W Chen, B Lei, PH Lin, D Zhou- arXiv preprint arXiv, 2025\nLarge language models (LLMs) have shown remarkable capabilities in code \ntranslation, yet their performance deteriorates in low-resource programming domains \nsuch as Fortran and emerging frameworks like CUDA, where high-quality parallel", "link": "https://scholar.google.com/scholar_url?url=https://arxiv.org/pdf/2512.03086&hl=en&sa=X&d=15724167796935183524&ei=i3U6abrBHs636rQP1dqb2Aw&scisig=ALhkC2RGUOYClntRywDgzqfB8TOC&oi=scholaralrt&hist=ylyK0_8AAAAJ:5865787842749446205:ALhkC2THo_3s8tBI3qmyNrpmj0cv&html=&pos=6&folt=rel", "author": ["David Lo"], "ref": ["David Lo - new related research"]}
{"title": "Fuzzing-based mutation testing of C/C++ software in cyber-physical systems", "first_label": ["Fuzzing", "Software Testing"], "second_label": [], "data": "J Lee, F Pastore, L Briand- Empirical Software Engineering, 2026\nMutation testing can help minimize the delivery of faulty software. Therefore, it is a \nrecommended practice for developing embedded software in safety-critical cyber-\nphysical systems (CPS). However, state-of-the-art mutation testing techniques for C", "link": "https://scholar.google.com/scholar_url?url=https://link.springer.com/article/10.1007/s10664-025-10700-7&hl=en&sa=X&d=7060071239748170715&ei=jHU6afifEqG7ieoP4JWf6Ak&scisig=ALhkC2SaUW-d_qCkysa3OAcvJeQD&oi=scholaralrt&hist=ylyK0_8AAAAJ:12723761785867032729:ALhkC2Tff526TIEbfh2mbT-kfB65&html=&pos=0&folt=rel", "author": ["Abhik Roychoudhury"], "ref": ["Abhik Roychoudhury - new related research"]}
{"title": "PathFuzzer: Sensitive Information Flow PathGuided Fuzzing for Intent Vulnerabilities in Android Applications", "first_label": ["Vulnerabilities", "Fuzzing"], "second_label": [], "data": "Z Yuan, Z Yang, S Jin, J Tan, H Zhang- IET Information Security, 2025\nIntent vulnerabilities pose a significant threat as they allow attackers to exploit \nunverified intent messages, leading to sensitive data leaks, privilege escalations, or \nunauthorized actions that compromise user privacy and system security. Fuzzing", "link": "https://scholar.google.com/scholar_url?url=https://ietresearch.onlinelibrary.wiley.com/doi/pdf/10.1049/ise2/5001786&hl=en&sa=X&d=9794508136160545688&ei=jHU6afifEqG7ieoP4JWf6Ak&scisig=ALhkC2SUmeyGaeevWtpfsw3NtztC&oi=scholaralrt&hist=ylyK0_8AAAAJ:12723761785867032729:ALhkC2Tff526TIEbfh2mbT-kfB65&html=&pos=2&folt=rel", "author": ["Abhik Roychoudhury"], "ref": ["Abhik Roychoudhury - new related research"]}
{"title": "GenSIaC: Toward Security-Aware Infrastructure-as-Code Generation with Large Language Models", "first_label": ["LLM", "Code"], "second_label": ["Generation"], "data": "Y Li, M Grella, D Nahmias, G Engelberg, D Klein- arXiv preprint arXiv, 2025\nIn recent years, Infrastructure as Code (IaC) has emerged as a critical approach for \nmanaging and provisioning IT infrastructure through code and automation. IaC \nenables organizations to create scalable and consistent environments, effectively", "link": "https://scholar.google.com/scholar_url?url=https://arxiv.org/pdf/2511.12385&hl=en&sa=X&d=13477230252338426090&ei=jHU6afifEqG7ieoP4JWf6Ak&scisig=ALhkC2Q5yDehZpt9DJhEu3amuVoT&oi=scholaralrt&hist=ylyK0_8AAAAJ:12723761785867032729:ALhkC2Tff526TIEbfh2mbT-kfB65&html=&pos=3&folt=rel", "author": ["Abhik Roychoudhury"], "ref": ["Abhik Roychoudhury - new related research"]}
{"title": "From LLMs to Agents: A Comparative Evaluation of LLMs and LLM-based Agents in Security Patch Detection", "first_label": ["LLM"], "second_label": ["Detection", "Agent"], "data": "J Han, Z Yu, L Bao, J Liu, Y Wan, J Yin, S Deng, S Han- arXiv preprint arXiv, 2025\nThe widespread adoption of open-source software (OSS) has accelerated software \ninnovation but also increased security risks due to the rapid propagation of \nvulnerabilities and silent patch releases. In recent years, large language models", "link": "https://scholar.google.com/scholar_url?url=https://arxiv.org/pdf/2511.08060&hl=en&sa=X&d=6561683054617536100&ei=l-Q4acHhJ7uZ6rQPr6jTsQE&scisig=ALhkC2QsxAjjGN6XCVUDrp7O5Op9&oi=scholaralrt&hist=ylyK0_8AAAAJ:4812769200119993430:ALhkC2RZmRqgZGCFQXCJyP9vthGu&html=&pos=0&folt=rel", "author": ["Thanh Le-Cong"], "ref": ["Thanh Le-Cong - new related research"]}
{"title": "Designing LLM-based Multi-Agent Systems for Software Engineering Tasks: Quality Attributes, Design Patterns and Rationale", "first_label": ["LLM"], "second_label": ["Agent"], "data": "Y Cai, R Li, P Liang, M Shahin, Z Li- arXiv preprint arXiv:2511.08475, 2025\nAs the complexity of Software Engineering (SE) tasks continues to escalate, Multi-\nAgent Systems (MASs) have emerged as a focal point of research and practice due \nto their autonomy and scalability. Furthermore, through leveraging the reasoning and\n \nThis message was sent by Google Scholar because you're following new articles related to research by \nThanh Le-Cong\n.\nList alerts\nCancel alert", "link": "https://scholar.google.com/scholar_url?url=https://arxiv.org/pdf/2511.08475&hl=en&sa=X&d=17534202913011717193&ei=l-Q4acHhJ7uZ6rQPr6jTsQE&scisig=ALhkC2RPPsUuUq525sXHr4cOYmZq&oi=scholaralrt&hist=ylyK0_8AAAAJ:4812769200119993430:ALhkC2RZmRqgZGCFQXCJyP9vthGu&html=&pos=4&folt=rel", "author": ["Thanh Le-Cong"], "ref": ["Thanh Le-Cong - new related research"]}
{"title": "Bounded Exhaustive Random Program Generation for Testing Solidity Compilers", "first_label": ["Software Testing"], "second_label": ["Generation"], "data": "H Ma, AF Donaldson, Q Shen, Y Tian, J Chen - 2026\nBy July 2025, smart contracts collectively manage roughly $120 billion in assets. \nWith Solidity remaining the dominant language for smart contract development, the \ncorrectness of Solidity compilers has become critically important. However, Solidity \ncompilers are prone to bugs, with a recent study revealing that combinations of \nqualifiers in Solidity programs are the primary cause of compiler crashes, accounting \nfor 40.5% of all historical crashes. While random program generators are widely\nCites: Directed greybox fuzzing  \n \nThis message was sent by Google Scholar because you're following new citations to articles written by \nAbhik Roychoudhury\n.\nList alerts\nCancel alert", "link": "https://scholar.google.com/scholar_url?url=https://www.doc.ic.ac.uk/~afd/papers/2026/ICSE.pdf&hl=en&sa=X&d=14559056890643418309&ei=mOQ4acTDD5iTieoP9sm_0AY&scisig=ALhkC2QgpXU66LdlJBKEjqIiXlNl&oi=scholaralrt&hist=ylyK0_8AAAAJ:10071049626428824134:ALhkC2SLNtxsIYV7y8T6Ni2J4ruF&html=&pos=0&folt=cit", "author": ["Abhik Roychoudhury"], "ref": ["1 new citation to articles by Abhik Roychoudhury", "Hong Jin Kang - new related research"]}
{"title": "Output format biases in the evaluation of large language models for code translation", "first_label": ["LLM", "Code"], "second_label": ["Generation"], "data": "M Macedo, Y Tian, FR Cogo, B Adams- Empirical Software Engineering, 2026\nCode translation between programming languages (PLs) is a long-existing and \ncritical task in software engineering, facilitating the modernization of legacy systems, \nensuring cross-platform compatibility, and enhancing software performance. With the", "link": "https://scholar.google.com/scholar_url?url=https://link.springer.com/article/10.1007/s10664-025-10768-1&hl=en&sa=X&d=3225764953280104178&ei=meQ4aajgFqm6ieoPoPyzsQs&scisig=ALhkC2QEw6wnc3eH7Zk6_ibG7GK7&oi=scholaralrt&hist=ylyK0_8AAAAJ:17903213248891513419:ALhkC2T269WwPtyd5qvti3WNZV40&html=&pos=0&folt=rel", "author": ["Hong Jin Kang"], "ref": ["Hong Jin Kang - new related research", "Xin ZHOU - new related research", "David Lo - new related research"]}
{"title": "Empirical Analysis of AI-Assisted Code Generation Tools: Impact on Code Quality, Security and Developer Productivity", "first_label": ["Code"], "second_label": ["Generation"], "data": "MP Sankhe, N Patil, MM Ghorpade, MP Prasad\nAI-assisted code generation tools have been the main cause of the increase in \npractices like code completion, bug fixing, and documentation among developers. \nHowever, the main concern regarding their effects on code quality, security", "link": "https://scholar.google.com/scholar_url?url=https://www.researchgate.net/profile/Purvi-Sankhe-2/publication/397890586_Empirical_Analysis_of_AI-Assisted_Code_Generation_Tools_Impact_on_Code_Quality_Security_and_Developer_Productivity/links/6929476cf4878b75fc7a237e/Empirical-Analysis-of-AI-Assisted-Code-Generation-Tools-Impact-on-Code-Quality-Security-and-Developer-Productivity.pdf&hl=en&sa=X&d=1205231250018136238&ei=meQ4aajgFqm6ieoPoPyzsQs&scisig=ALhkC2Q7tB78_uQFJ7jscZASPnoJ&oi=scholaralrt&hist=ylyK0_8AAAAJ:17903213248891513419:ALhkC2T269WwPtyd5qvti3WNZV40&html=&pos=2&folt=rel", "author": ["Hong Jin Kang"], "ref": ["Hong Jin Kang - new related research"]}
{"title": "Citadel: Context Similarity Based Deep Learning Framework Bug Finding", "first_label": ["Bug"], "second_label": [], "data": "Z XIAOYU, J ZHAI, S MA, S WANG, C SHEN - 2025\nWith the development of Deep Learning (DL) techniques, DL-powered systems are \nplaying an increasingly significant role in software development. For example, \nMicrosoft has developed a new search engine powered by DL techniques to", "link": "https://scholar.google.com/scholar_url?url=https://shiningrain.github.io/papers/Zhang2025TOSEM-1.pdf&hl=en&sa=X&d=17476988302280239495&ei=meQ4aajgFqm6ieoPoPyzsQs&scisig=ALhkC2S1GZlIiWI2SbX3lq_WxO5T&oi=scholaralrt&hist=ylyK0_8AAAAJ:17903213248891513419:ALhkC2T269WwPtyd5qvti3WNZV40&html=&pos=6&folt=rel", "author": ["Hong Jin Kang"], "ref": ["Hong Jin Kang - new related research"]}
{"title": "Minimizing Breaking Changes and Redundancy in Mitigating Technical Lag for Java Projects", "first_label": [], "second_label": [], "data": "R Lu, L Zhang, K Li, M Zhang, Y Chen- arXiv preprint arXiv:2511.06762, 2025\nRe-using open-source software (OSS) can avoid reinventing the wheel, but failing to \nkeep it up-to-date can lead to missing new features and persistent bugs or \nvulnerabilities that have already been resolved. The use of outdated OSS libraries", "link": "https://scholar.google.com/scholar_url?url=https://arxiv.org/pdf/2511.06762&hl=en&sa=X&d=2774391013459012700&ei=meQ4aajgFqm6ieoPoPyzsQs&scisig=ALhkC2TstmE5hon5D-Iqx7GZRLkE&oi=scholaralrt&hist=ylyK0_8AAAAJ:17903213248891513419:ALhkC2T269WwPtyd5qvti3WNZV40&html=&pos=7&folt=rel", "author": ["Hong Jin Kang"], "ref": ["Hong Jin Kang - new related research"]}
{"title": "Quality Assurance in Large Language Models", "first_label": ["LLM"], "second_label": [], "data": "D Song - 2025\nAbstract Large Language Models (LLMs) have demonstrated impressive capabilities \nacross a wide range of tasks in natural language processing (NLP) and software \nengineering (SE). However, their increasing adoption has raised critical concerns", "link": "https://scholar.google.com/scholar_url?url=https://ualberta.scholaris.ca/bitstreams/182b82d1-f9e0-4e10-a493-6beba20a3db2/download&hl=en&sa=X&d=9868273145291117306&ei=meQ4aajgFqm6ieoPoPyzsQs&scisig=ALhkC2RPW6TGX7QUf3cLjujpLt7X&oi=scholaralrt&hist=ylyK0_8AAAAJ:17903213248891513419:ALhkC2T269WwPtyd5qvti3WNZV40&html=&pos=8&folt=rel", "author": ["Hong Jin Kang"], "ref": ["Hong Jin Kang - new related research"]}
{"title": "Enhancing Automated Program Repair via Faulty Token Localization and Quality-Aware Patch Refinement", "first_label": ["APR"], "second_label": ["Repair", "Localization"], "data": "J Kong, X Xie, Y Xiong, Y Wang, J Wang- arXiv preprint arXiv:2511.18001, 2025\nLarge language models (LLMs) have recently demonstrated strong potential for \nautomated program repair (APR). However, existing LLM-based techniques primarily \nrely on coarse-grained external feedback (eg, test results) to guide iterative patch", "link": "https://scholar.google.com/scholar_url?url=https://arxiv.org/pdf/2511.18001&hl=en&sa=X&d=1821269032887983689&ei=mOQ4ae_KIam6ieoPoPyzsQs&scisig=ALhkC2SUI5N-dYf99KYetiGliV05&oi=scholaralrt&hist=ylyK0_8AAAAJ:12723761785867032729:ALhkC2Tff526TIEbfh2mbT-kfB65&html=&pos=0&folt=rel", "author": ["Abhik Roychoudhury"], "ref": ["Abhik Roychoudhury - new related research"]}
{"title": "CodeFlowLM: Incremental Just-In-Time Defect Prediction with Pretrained Language Models and Exploratory Insights into Defect Localization", "first_label": ["LLM", "Code", "Software Defect"], "second_label": ["Localization"], "data": "ML Monteiro, GG Cabral, ALI OLiveira- arXiv preprint arXiv:2512.00231, 2025\nThis work introduces CodeFlowLM, an incremental learning framework for Just-In-\nTime Software Defect Prediction (JIT-SDP) that leverages pre-trained language \nmodels (PLMs). Unlike traditional online learners, CodeFlowLM employs continual\n \nThis message was sent by Google Scholar because you're following new articles related to research by \nAbhik Roychoudhury\n.\nList alerts\nCancel alert", "link": "https://scholar.google.com/scholar_url?url=https://arxiv.org/pdf/2512.00231&hl=en&sa=X&d=6692297105732475716&ei=mOQ4ae_KIam6ieoPoPyzsQs&scisig=ALhkC2QnnWuZy0-wtXF8Yv5prgTA&oi=scholaralrt&hist=ylyK0_8AAAAJ:12723761785867032729:ALhkC2Tff526TIEbfh2mbT-kfB65&html=&pos=1&folt=rel", "author": ["Abhik Roychoudhury"], "ref": ["Abhik Roychoudhury - new related research"]}
{"title": "ChopChop: Semantically Constraining the Code Output of Language Models", "first_label": ["LLM", "Code"], "second_label": [], "data": "S Nagy, T Zhou, N Polikarpova, L D'Antoni- NeurIPS 2025 Fourth Workshop on Deep\nLanguage models (LMs) can generate code, but cannot guarantee its correctness\nproducing outputs that often violate type safety, program invariants, or semantic \nequivalence. Constrained decoding offers a solution by restricting generation to", "link": "https://scholar.google.com/scholar_url?url=https://openreview.net/pdf%3Fid%3DB8UIezv3BS&hl=en&sa=X&d=12773477658182013006&ei=l-Q4abC6O4yO6rQPzMLFgAM&scisig=ALhkC2R93Blr0UGUgh5Vz6UwWAQe&oi=scholaralrt&hist=ylyK0_8AAAAJ:5865787842749446205:ALhkC2THo_3s8tBI3qmyNrpmj0cv&html=&pos=1&folt=rel", "author": ["David Lo"], "ref": ["David Lo - new related research"]}
{"title": "Overflow Code Snippet Evolution on Open-Source Software Security", "first_label": ["Code"], "second_label": [], "data": "A Khanaj, SS Sangewar- ICT for Intelligent Systems: Proceedings of ICTIS 2025, 2025\nThis study investigates the security implications of reusing code snippets of Stack \nOverflow in open-source software projects. We present novel framework that \nproactively identifies and mitigates security risks associated with outdated Stack\n \nThis message was sent by Google Scholar because you're following new articles related to research by \nDavid Lo\n.\nList alerts\nCancel alert", "link": "https://scholar.google.com/scholar_url?url=https://books.google.com/books%3Fhl%3Den%26lr%3Dlang_en%26id%3DnXOaEQAAQBAJ%26oi%3Dfnd%26pg%3DPA60%26ots%3DvDQugCVKu6%26sig%3DLecQBAkDxQjTzkDloJl5whcFfno&hl=en&sa=X&d=11909662852129829882&ei=l-Q4abC6O4yO6rQPzMLFgAM&scisig=ALhkC2QXSx6_1_I1H9k9aFxZl8BN&oi=scholaralrt&hist=ylyK0_8AAAAJ:5865787842749446205:ALhkC2THo_3s8tBI3qmyNrpmj0cv&html=&pos=2&folt=rel", "author": ["David Lo"], "ref": ["David Lo - new related research"]}
