{"title": "Perish or Flourish? A Holistic Evaluation of Large Language Models for Code Generation in Functional Programming", "first_label": ["LLM", "Code"], "second_label": ["Generation"], "data": "NAH Lang, E Lang, T Le-Cong, B Le, QT Huynh- arXiv preprint arXiv:2601.02060, 2026\nFunctional programming provides strong foundations for developing reliable and \nsecure software systems, yet its adoption remains not widespread due to the steep \nlearning curve. Recent advances in Large Language Models (LLMs) for code\n \nThis message was sent by Google Scholar because you're following new articles written by \nBach Le\n.\nList alerts\nCancel alert", "link": "https://scholar.google.com/scholar_url?url=https://arxiv.org/pdf/2601.02060&hl=en&sa=X&d=13705181827760850643&ei=mJ5gaarbJ4aw6rQPkNu46Ao&scisig=ALhkC2RBWrPzBtLtphM3cJrYvgc6&oi=scholaralrt&hist=ylyK0_8AAAAJ:7720112214409400523:ALhkC2RCmCOuOaYw9ahlHDBnveuC&html=&pos=0&folt=art", "author": ["Bach Le"], "ref": ["Bach Le - new articles", "Xin ZHOU - new related research", "David Lo - new related research", "1 new citation to articles by Thanh Le-Cong", "1 new citation to articles by Bach Le", "Hong Jin Kang - new related research", "Thanh Le-Cong - new articles"]}
{"title": "LIA: Supervised Fine-Tuning of Large Language Models for Automatic Issue Assignment", "first_label": ["LLM"], "second_label": [], "data": "A Khosravani, A Hosseinpour, A Akhavan, M Keshani- arXiv preprint arXiv, 2026\nIssue assignment is a critical process in software maintenance, where new issue \nreports are validated and assigned to suitable developers. However, manual issue \nassignment is often inconsistent and error-prone, especially in large open-source \nprojects where thousands of new issues are reported monthly. Existing automated \napproaches have shown promise, but many rely heavily on large volumes of project-\nspecific training data or relational information that is often sparse and noisy, which\nCites: Back to the Basics: Rethinking Issue-Commit Linking with LLM", "link": "https://scholar.google.com/scholar_url?url=https://arxiv.org/pdf/2601.01780&hl=en&sa=X&d=10036084859285164800&ei=l55gaaztLp6u6rQPotyMwAQ&scisig=ALhkC2R5fOOYBWdETJ9yubvsEPK3&oi=scholaralrt&hist=ylyK0_8AAAAJ:4851239734318863641:ALhkC2Tv0L1GNq4Kk4Fq05ZvgtDM&html=&pos=0&folt=cit", "author": ["Hong Jin Kang"], "ref": ["4 new citations to articles by Hong Jin Kang"]}
{"title": "BADS: A backdoor attack against code intent summarization engines", "first_label": ["Code"], "second_label": [], "data": "Y Qu, B Li, S Huang, P Nie, L Li, Y Yao- Information and Software Technology, 2026\nAbstract Context: Code Large Language Models (LLMs) have transformed software \nengineering practices by automating code understanding and documentation \ngeneration. However, relying on third-party training datasets and pre-trained models \nintroduces significant security vulnerabilities. This is particularly critical in code intent \nsummarization, where security implications must be accurately identified and \ncommunicated. Objective: This study investigates backdoor attacks targeting code\nCites: Stealthy backdoor attack for code models", "link": "https://scholar.google.com/scholar_url?url=https://www.sciencedirect.com/science/article/pii/S0950584926000078&hl=en&sa=X&d=13405251806166872779&ei=l55gaaztLp6u6rQPotyMwAQ&scisig=ALhkC2QNxcT1CeHwYEzOtMmOfscE&oi=scholaralrt&hist=ylyK0_8AAAAJ:4851239734318863641:ALhkC2Tv0L1GNq4Kk4Fq05ZvgtDM&html=&pos=1&folt=cit", "author": ["Hong Jin Kang"], "ref": ["4 new citations to articles by Hong Jin Kang"]}
{"title": "Atomizer: An LLM-based Collaborative Multi-Agent Framework for Intent-Driven Commit Untangling", "first_label": ["LLM"], "second_label": ["Agent"], "data": "K Zhu, Z Tian, S Wang, M Leng, X Mao- arXiv preprint arXiv:2601.01233, 2026\nComposite commits, which entangle multiple unrelated concerns, are prevalent in \nsoftware development and significantly hinder program comprehension and \nmaintenance. Existing automated untangling methods, particularly state-of-the-art \ngraph clustering-based approaches, are fundamentally limited by two issues.(1) \nThey over-rely on structural information, failing to grasp the crucial semantic intent \nbehind changes, and (2) they operate as``single-pass''algorithms, lacking a\nCites: CleanVul: Automatic Function-Level Vulnerability Detection in", "link": "https://scholar.google.com/scholar_url?url=https://arxiv.org/pdf/2601.01233&hl=en&sa=X&d=7750398693105071549&ei=l55gaaztLp6u6rQPotyMwAQ&scisig=ALhkC2SQq_T0jhZPja0ITOONEN5X&oi=scholaralrt&hist=ylyK0_8AAAAJ:4851239734318863641:ALhkC2Tv0L1GNq4Kk4Fq05ZvgtDM&html=&pos=2&folt=cit", "author": ["Hong Jin Kang"], "ref": ["4 new citations to articles by Hong Jin Kang", "8 new citations to articles by Abhik Roychoudhury"]}
{"title": "JIT-Coka: An Improved Framework for Just-in-Time Defect Prediction and Localization Using Fused Features of Code Change", "first_label": ["Code", "Code Change", "Software Defect"], "second_label": ["Localization"], "data": "Y Liang, C Wu, W Chen, G Fan, H Yu\nJust-in-Time Defect Prediction and Localization (JIT-DP and DL) play a crucial role in \nsoftware quality assurance by identifying defective code changes and locating faulty \nlines at the time of code submission. While existing methods leverage either \nhandcrafted expert features or semantic features extracted by deep learning models, \nfew explicitly distinguish or effectively fuse these two types of information. In this \npaper, we propose JIT-Coka, an improved framework for JITDP and DL tasks that\nCites: Cc2vec: Distributed representations of code changes  \n \nThis message was sent by Google Scholar because you're following new citations to articles written by \nHong Jin Kang\n.\nList alerts\nCancel alert", "link": "https://scholar.google.com/scholar_url?url=https://hugo-liang.github.io/files/2025-CollaborateCom-JIT-Coka.pdf&hl=en&sa=X&d=10655176229094501216&ei=l55gaaztLp6u6rQPotyMwAQ&scisig=ALhkC2QomhfZwZkhkoFp9YDatd4E&oi=scholaralrt&hist=ylyK0_8AAAAJ:4851239734318863641:ALhkC2Tv0L1GNq4Kk4Fq05ZvgtDM&html=&pos=3&folt=cit", "author": ["Hong Jin Kang"], "ref": ["4 new citations to articles by Hong Jin Kang", "Thanh Le-Cong - new related research", "3 new citations to articles by Xin ZHOU"]}
{"title": "Large Language Models-based Software Test Input Generation", "first_label": ["LLM", "Software Testing"], "second_label": ["Generation"], "data": "SA Akman, B Ertem, C Catal\nTest input generation is a critical aspect of software testing, ensuring the quality and \nreliability of software systems. In recent years, Large Language Models (LLMs) have \ngained significant attention for their potential to automate and enhance this process", "link": "https://scholar.google.com/scholar_url?url=https://ieeexplore.ieee.org/iel8/11270371/11270427/11270460.pdf&hl=en&sa=X&d=4843000784935517525&ei=mp5gaZzNF6C16rQPm4fPgQQ&scisig=ALhkC2TjAii0ZhRijk1NITwmRIHY&oi=scholaralrt&hist=ylyK0_8AAAAJ:16898579961534012346:ALhkC2Q9j5kdmlV_e8u2kLe_NWfw&html=&pos=0&folt=rel", "author": ["Xin ZHOU"], "ref": ["Xin ZHOU - new related research"]}
{"title": "Understanding the Role of Large Language Models in Software Engineering: Evidence from an Industry Survey", "first_label": ["LLM"], "second_label": [], "data": "VM de Brito, K Farias- arXiv preprint arXiv:2512.21347, 2025\nThe rapid advancement of Large Language Models (LLMs) is reshaping software \nengineering by profoundly influencing coding, documentation, and system \nmaintenance practices. As these tools become deeply embedded in developers'", "link": "https://scholar.google.com/scholar_url?url=https://arxiv.org/pdf/2512.21347&hl=en&sa=X&d=5399442109481763722&ei=mp5gaZzNF6C16rQPm4fPgQQ&scisig=ALhkC2TN8pZJJK9Eov4pXheb2Lv5&oi=scholaralrt&hist=ylyK0_8AAAAJ:16898579961534012346:ALhkC2Q9j5kdmlV_e8u2kLe_NWfw&html=&pos=2&folt=rel", "author": ["Xin ZHOU"], "ref": ["Xin ZHOU - new related research"]}
{"title": "SeRe: A Security-Related Code Review Dataset Aligned with Real-World Review Activities", "first_label": ["Code Review", "Code"], "second_label": [], "data": "Z Zhao, Y Jiang, H Liu, K Liu, L Zhang- arXiv preprint arXiv:2601.01042, 2026\nSoftware security vulnerabilities can lead to severe consequences, making early \ndetection essential. Although code review serves as a critical defense mechanism \nagainst security flaws, relevant feedback remains scarce due to limited attention to\n \nThis message was sent by Google Scholar because you're following new articles related to research by \nXin ZHOU\n.\nList alerts\nCancel alert", "link": "https://scholar.google.com/scholar_url?url=https://arxiv.org/pdf/2601.01042&hl=en&sa=X&d=64316290296668210&ei=mp5gaZzNF6C16rQPm4fPgQQ&scisig=ALhkC2SRqTrrewR_AAD6Ph3xU96v&oi=scholaralrt&hist=ylyK0_8AAAAJ:16898579961534012346:ALhkC2Q9j5kdmlV_e8u2kLe_NWfw&html=&pos=3&folt=rel", "author": ["Xin ZHOU"], "ref": ["Xin ZHOU - new related research"]}
{"title": "Reporting LLM Prompting in Automated Software Engineering: A Guideline Based on Current Practices and Expectations", "first_label": ["LLM"], "second_label": [], "data": "A Korn, L Zaruchas, C Arora, A Metzger, S Smolka- arXiv preprint arXiv, 2026\nLarge Language Models, particularly decoder-only generative models such as GPT, \nare increasingly used to automate Software Engineering tasks. These models are \nprimarily guided through natural language prompts, making prompt engineering a", "link": "https://scholar.google.com/scholar_url?url=https://arxiv.org/pdf/2601.01954&hl=en&sa=X&d=4332027767690105897&ei=mJ5gaaDBFr6Z6rQPr-v5iAc&scisig=ALhkC2Q96B8RzACLVplpAQFiLbFd&oi=scholaralrt&hist=ylyK0_8AAAAJ:5865787842749446205:ALhkC2THo_3s8tBI3qmyNrpmj0cv&html=&pos=1&folt=rel", "author": ["David Lo"], "ref": ["David Lo - new related research"]}
{"title": "FlowRepair: Search-based automated program repair of CPS controllers modeled in Simulink-Stateflow", "first_label": ["APR"], "second_label": ["Repair", "Search"], "data": "A Arrieta, P Valle, S Ali- Information and Software Technology, 2026\nContext: Stateflow models are widely used in the industry to model the high-level \ncontrol logic of Cyber-Physical Systems (CPSs) in Simulink. Many approaches exist \nto test Simulink models, but once a fault is detected, the process to repair it remains", "link": "https://scholar.google.com/scholar_url?url=https://www.sciencedirect.com/science/article/pii/S0950584925003490&hl=en&sa=X&d=6466099433251781959&ei=mJ5gaaDBFr6Z6rQPr-v5iAc&scisig=ALhkC2RYOz1ow_8yR9bzp4bvR2EE&oi=scholaralrt&hist=ylyK0_8AAAAJ:5865787842749446205:ALhkC2THo_3s8tBI3qmyNrpmj0cv&html=&pos=2&folt=rel", "author": ["David Lo"], "ref": ["David Lo - new related research", "Bach Le - new related research", "Quang-Cuong Bui - new related research", "8 new citations to articles by Abhik Roychoudhury", "Thanh Le-Cong - new related research"]}
{"title": "A retrieval-augmented LLM framework for severity prediction of bug reports in cloud-based mobile applications", "first_label": ["LLM", "Bug"], "second_label": [], "data": "A Ali, IA Khan, Y Xia, Y Tian, S Sajid, M Alsuhaibani- Journal of Cloud Computing, 2025\nThe effective maintenance of Mobile Applications (MAPPs) relies on the timely and \naccurate triage of bug reports, where severity labels determine the order of issue \nresolution. Manual severity assessment is often labor-intensive, error-prone, and", "link": "https://scholar.google.com/scholar_url?url=https://link.springer.com/article/10.1186/s13677-025-00826-w&hl=en&sa=X&d=11203124132865166572&ei=mJ5gaaDBFr6Z6rQPr-v5iAc&scisig=ALhkC2T3nM3VspIYTMb7UooOvaoj&oi=scholaralrt&hist=ylyK0_8AAAAJ:5865787842749446205:ALhkC2THo_3s8tBI3qmyNrpmj0cv&html=&pos=3&folt=rel", "author": ["David Lo"], "ref": ["David Lo - new related research"]}
{"title": "HackRep: A Large-Scale Dataset of GitHub Hackathon Projects", "first_label": [], "second_label": [], "data": "S Halmans, L Paganini, A Serebrenik, A Nolte- 23rd International Conference on, 2026\nHackathons are time-bound collaborative events that often target software creation. \nAlthough hackathons have been studied in the past, these studies have been limited \nto in-depth studies of few events, limiting understanding of hackathons as a software", "link": "https://scholar.google.com/scholar_url?url=https://research.tue.nl/en/publications/hackrep-a-large-scale-dataset-of-github-hackathon-projects/&hl=en&sa=X&d=7817826126970988817&ei=mJ5gaaDBFr6Z6rQPr-v5iAc&scisig=ALhkC2TSZKf0FrEjU7sS9hfKoOC8&oi=scholaralrt&hist=ylyK0_8AAAAJ:5865787842749446205:ALhkC2THo_3s8tBI3qmyNrpmj0cv&html=&pos=4&folt=rel", "author": ["David Lo"], "ref": ["David Lo - new related research", "Hong Jin Kang - new related research", "Thanh Le-Cong - new related research"]}
{"title": "SWE-Lego: Pushing the Limits of Supervised Fine-tuning for Software Issue Resolving", "first_label": [], "second_label": [], "data": "C Tao, J Chen, Y Jiang, K Kou, S Wang, R Wang, X Li- arXiv preprint arXiv, 2026\nWe present SWE-Lego, a supervised fine-tuning (SFT) recipe designed to achieve \nstate-ofthe-art performance in software engineering (SWE) issue resolving. In \ncontrast to prevalent methods that rely on complex training paradigms (eg, mid\n \nThis message was sent by Google Scholar because you're following new articles related to research by \nDavid Lo\n.\nList alerts\nCancel alert", "link": "https://scholar.google.com/scholar_url?url=https://arxiv.org/pdf/2601.01426&hl=en&sa=X&d=16838656296268274816&ei=mJ5gaaDBFr6Z6rQPr-v5iAc&scisig=ALhkC2TEbUGhbka4UnVTzOKfBRQK&oi=scholaralrt&hist=ylyK0_8AAAAJ:5865787842749446205:ALhkC2THo_3s8tBI3qmyNrpmj0cv&html=&pos=5&folt=rel", "author": ["David Lo"], "ref": ["David Lo - new related research", "8 new citations to articles by Abhik Roychoudhury"]}
{"title": "CuFuzz: Hardening CUDA Programs through Transformation and Fuzzing", "first_label": ["Fuzzing"], "second_label": [], "data": "S Singh, R Han, J Lee, S Na, Y Kim, T Kim, H Kim- arXiv preprint arXiv:2601.01048, 2026\nGPUs have gained significant popularity over the past decade, extending beyond \ntheir original role in graphics rendering. This evolution has brought GPU security and \nreliability to the forefront of concerns. Prior research has shown that CUDA's lack of\n \nThis message was sent by Google Scholar because you're following new articles related to research by \nAbhik Roychoudhury\n.\nList alerts\nCancel alert", "link": "https://scholar.google.com/scholar_url?url=https://arxiv.org/pdf/2601.01048&hl=en&sa=X&d=3158675805652795982&ei=mZ5gaduPKqyK6rQPgZOO6A8&scisig=ALhkC2T1F5rQqzfDtuI-wrGyrBVS&oi=scholaralrt&hist=ylyK0_8AAAAJ:12723761785867032729:ALhkC2Tff526TIEbfh2mbT-kfB65&html=&pos=0&folt=rel", "author": ["Abhik Roychoudhury"], "ref": ["Abhik Roychoudhury - new related research"]}
{"title": "Abductive Vibe Coding", "first_label": [], "second_label": [], "data": "L Murphy, AA Babikian, M Chechik- arXiv preprint arXiv:2601.01199, 2026\nWhen software artifacts are generated by AI models (\" vibe coding\"), human \nengineers assume responsibility for validating them. Ideally, this validation would be \ndone through the creation of a formal proof of correctness. However, this is infeasible \nfor many real-world vibe coding scenarios, especially when requirements for the AI-\ngenerated artifacts resist formalization. This extended abstract describes ongoing \nwork towards the extraction of analyzable, semi-formal rationales for the adequacy of\nCites: Automatic Programming: Large Language Models and Beyond", "link": "https://scholar.google.com/scholar_url?url=https://arxiv.org/pdf/2601.01199&hl=en&sa=X&d=7156034474657411713&ei=mJ5gaaLSOe-GieoPo9DluQE&scisig=AHkA5jQ6JEqJ4wo_cnsy-nq4zsYo&oi=scholaralrt&hist=ylyK0_8AAAAJ:10071049626428824134:AHkA5jQRfWoRNvJIMJ7ZeL1tZJbF&html=&pos=1&folt=cit", "author": ["Abhik Roychoudhury"], "ref": ["8 new citations to articles by Abhik Roychoudhury"]}
{"title": "The State of Open Science in Software Engineering Research: A Case Study of ICSE Artifacts", "first_label": [], "second_label": ["Search"], "data": "A Muttakin, S Mondal, C Roy- arXiv preprint arXiv:2601.02066, 2026\nReplication packages are crucial for enabling transparency, validation, and reuse in \nsoftware engineering (SE) research. While artifact sharing is now a standard practice \nand even expected at premier SE venues such as ICSE, the practical usability of \nthese replication packages remains underexplored. In particular, there is a marked \nlack of studies that comprehensively examine the executability and reproducibility of \nreplication packages in SE research. In this paper, we aim to fill this gap by\nCites: Linear-time Temporal Logic Guided Greybox Fuzzing", "link": "https://scholar.google.com/scholar_url?url=https://arxiv.org/pdf/2601.02066&hl=en&sa=X&d=13233464081127060972&ei=mJ5gaaLSOe-GieoPo9DluQE&scisig=AHkA5jTT8eS7q5iFnyfxkO8EYuHT&oi=scholaralrt&hist=ylyK0_8AAAAJ:10071049626428824134:AHkA5jQRfWoRNvJIMJ7ZeL1tZJbF&html=&pos=4&folt=cit", "author": ["Abhik Roychoudhury"], "ref": ["8 new citations to articles by Abhik Roychoudhury"]}
{"title": "System-Level Evaluation of Advanced Rowhammer Attacks on Deployed Mitigations", "first_label": [], "second_label": [], "data": "P Jattke - 2025\nThe security of today's computing systems is multifaceted, involving software, \nhardware, and human factors. Hardware security has long been overlooked, but \nmodern attacks like Meltdown, Spectre, and Rowhammer are a serious concern due \nto their practical exploitability and difficulty in mitigating devices in the wild. \nRowhammer is particularly insidious as it exploits a fundamental physical property of \nDRAM technology, making its root cause hard to fix. With DDR4 DRAM, vendors\nCites: Directed greybox fuzzing", "link": "https://scholar.google.com/scholar_url?url=https://www.research-collection.ethz.ch/bitstreams/58323ac3-a7f2-467e-a87d-f3cb57cddfca/download&hl=en&sa=X&d=15470930138155053175&ei=mJ5gaaLSOe-GieoPo9DluQE&scisig=AHkA5jTsGEgfaPj-szqQpFYpoYmy&oi=scholaralrt&hist=ylyK0_8AAAAJ:10071049626428824134:AHkA5jQRfWoRNvJIMJ7ZeL1tZJbF&html=&pos=5&folt=cit", "author": ["Abhik Roychoudhury"], "ref": ["8 new citations to articles by Abhik Roychoudhury"]}
{"title": "A Systematic Method for Evaluating the Generalizability of Mobile-Specific Research: Green Computing as a Case Study", "first_label": [], "second_label": ["Search"], "data": "R Nunkesser - 2026\nAbstract Mobile Software Engineering has emerged as a distinct subfield, raising \nquestions about the transferability of its research findings to general Software \nEngineering. This paper addresses the challenge of evaluating the generalizability of \nmobile-specific research, using Green Computing as a representative case. We \npropose a systematic method that combines a mapping study to identify potentially \noverlooked mobile-specific papers with a focused literature review to assess their\nCites: Future of mobile software for smartphones and drones: Energy and", "link": "https://scholar.google.com/scholar_url?url=https://www.preprints.org/frontend/manuscript/d3020780ef54cfb1e2dc05677143659d/download_pub&hl=en&sa=X&d=11039756096803551459&ei=mJ5gaaLSOe-GieoPo9DluQE&scisig=AHkA5jRaMrON_qCcyNKGx_7kzbZY&oi=scholaralrt&hist=ylyK0_8AAAAJ:10071049626428824134:AHkA5jQRfWoRNvJIMJ7ZeL1tZJbF&html=&pos=6&folt=cit", "author": ["Abhik Roychoudhury"], "ref": ["8 new citations to articles by Abhik Roychoudhury"]}
{"title": "A Generalized Fuzzing Framework for Unknown Network Protocols", "first_label": ["Fuzzing"], "second_label": [], "data": "F Sun, B Zhang, T Yu, Z Chen, S Wang- Advances in Intelligent Information Hiding and\nNetwork protocols define the data communication paradigm for entities during \ninteractions and serve as the cornerstone of today's Internet architecture. However, \nimplementations often require compromises in performance, latency, portability, etc. \nthat can introduce security risks. In order to uncover vulnerabilities of the server, \nnetwork fuzz testing is in general use, which entails continuously generating diverse \ndata messages and simulating communications with the entities under test. Current\nCites: AFLNet: a greybox fuzzer for network protocols  \n \nThis message was sent by Google Scholar because you're following new citations to articles written by \nAbhik Roychoudhury\n.\nList alerts\nCancel alert", "link": "https://scholar.google.com/scholar_url?url=https://link.springer.com/content/pdf/10.1007/978-981-96-6859-5.pdf%23page%3D94&hl=en&sa=X&d=9766994425723638243&ei=mJ5gaaLSOe-GieoPo9DluQE&scisig=AHkA5jTQ28gt4d0szxxpYz1NJsU3&oi=scholaralrt&hist=ylyK0_8AAAAJ:10071049626428824134:AHkA5jQRfWoRNvJIMJ7ZeL1tZJbF&html=&pos=7&folt=cit", "author": ["Abhik Roychoudhury"], "ref": ["8 new citations to articles by Abhik Roychoudhury"]}
{"title": "Android malware detection by using graph optimization of static features based on pre-trained language models", "first_label": ["LLM"], "second_label": ["Detection", "Graph"], "data": "NH Khoa, DM Trung, DT Dat, PT Duy, VH Pham- Information and Software, 2026\nAbstract Context: The Android platform is the dominant mobile operating system, \nmaking it a prime target for malware attacks. The increasing complexity of Android \nmalware necessitates advanced detection methods that integrate modern machine", "link": "https://scholar.google.com/scholar_url?url=https://www.sciencedirect.com/science/article/pii/S0950584926000017&hl=en&sa=X&d=13701477671695544106&ei=mp5gaeGEJZ6u6rQPotyMwAQ&scisig=ALhkC2RrAOChKRTLl1-jDu47R0Tu&oi=scholaralrt&hist=ylyK0_8AAAAJ:17903213248891513419:ALhkC2T269WwPtyd5qvti3WNZV40&html=&pos=0&folt=rel", "author": ["Hong Jin Kang"], "ref": ["Hong Jin Kang - new related research", "3 new citations to articles by Xin ZHOU"]}
{"title": "Correctness isnt Efficiency: Runtime Memory Divergence in LLM-Generated Code", "first_label": ["LLM", "Code"], "second_label": [], "data": "P Rajput, Y Song, AA Bonkoungou, IE Olatunji- arXiv preprint arXiv, 2026\nLarge language models (LLMs) can generate programs that pass unit tests, but \npassing tests does not guarantee reliable runtime behavior. We find that different \ncorrect solutions to the same task can show very different memory and performance", "link": "https://scholar.google.com/scholar_url?url=https://arxiv.org/pdf/2601.01215&hl=en&sa=X&d=14765159648781658182&ei=mp5gaeGEJZ6u6rQPotyMwAQ&scisig=ALhkC2SQxXX_ke4wY2UUgLm3XP4N&oi=scholaralrt&hist=ylyK0_8AAAAJ:17903213248891513419:ALhkC2T269WwPtyd5qvti3WNZV40&html=&pos=1&folt=rel", "author": ["Hong Jin Kang"], "ref": ["Hong Jin Kang - new related research"]}
{"title": "Context-Adaptive Requirements Defect Prediction through Human-LLM Collaboration", "first_label": ["LLM", "Software Defect"], "second_label": [], "data": "M Unterbusch, A Vogelsang- arXiv preprint arXiv:2601.01952, 2026\nAutomated requirements assessment traditionally relies on universal patterns as \nproxies for defectiveness, implemented through rule-based heuristics or machine \nlearning classifiers trained on large annotated datasets. However, what constitutes a\"\n \nThis message was sent by Google Scholar because you're following new articles related to research by \nHong Jin Kang\n.\nList alerts\nCancel alert", "link": "https://scholar.google.com/scholar_url?url=https://arxiv.org/pdf/2601.01952&hl=en&sa=X&d=9069224348137736576&ei=mp5gaeGEJZ6u6rQPotyMwAQ&scisig=ALhkC2TqjsaquT-nbu5Q1qBc1eG6&oi=scholaralrt&hist=ylyK0_8AAAAJ:17903213248891513419:ALhkC2T269WwPtyd5qvti3WNZV40&html=&pos=4&folt=rel", "author": ["Hong Jin Kang"], "ref": ["Hong Jin Kang - new related research"]}
{"title": "RovoDev Code Reviewer: A Large-Scale Online Evaluation of LLM-based Code Review Automation at Atlassian", "first_label": ["LLM", "Code Review", "Code"], "second_label": [], "data": "K Tantithamthavorn, Y Zou, A Wong, M Gupta, Z Wang- arXiv preprint arXiv, 2026\nLarge Language Models (LLMs)-powered code review automation has the potential \nto transform code review workflows. Despite the advances of LLM-powered code \nreview comment generation approaches, several practical challenges remain for", "link": "https://scholar.google.com/scholar_url?url=https://arxiv.org/pdf/2601.01129&hl=en&sa=X&d=1196576013822634621&ei=l55gaa2vG-6TieoPutPYsQg&scisig=AHkA5jRJ5-wBng48n3z0rj_Q7P1G&oi=scholaralrt&hist=ylyK0_8AAAAJ:4812769200119993430:AHkA5jS71y5YH911v9BWg5_Xgovk&html=&pos=2&folt=rel", "author": ["Thanh Le-Cong"], "ref": ["Thanh Le-Cong - new related research"]}
{"title": "Large Language Models for Code: A Focused Survey of Ten Recent Studies on Methods, Evaluation, and Robustness", "first_label": ["LLM", "Code"], "second_label": [], "data": "J Sen - 2025\nLarge language models (LLMs) have transformed automated code generation by \nextending capabilities beyond simple completion to include optimization, debugging, \nand review tasks. This work examines advancements in parameter-efficient fine-\ntuning (PEFT) techniques such as LoRA, IA3, Prefix tuning, Prompt tuning, and \nQLoRA, which enable adaptation of large pre-trained models with reduced \ncomputational demands. Employment of specialized benchmarks highlights the\nCites: Exploring Parameter-Efficient Fine-Tuning Techniques for Code", "link": "https://scholar.google.com/scholar_url?url=https://www.doria.fi/bitstream/handle/10024/193777/sen_jishnu.pdf%3Fsequence%3D2&hl=en&sa=X&d=9262974948421489755&ei=mp5gaejgCYaw6rQPkNu46Ao&scisig=ALhkC2T5iSJuB25Q7AoIhqJJcoOP&oi=scholaralrt&hist=ylyK0_8AAAAJ:15035864585353249078:ALhkC2S1ZxbvKZLR2YX67Bvdxjyf&html=&pos=1&folt=cit", "author": ["Xin ZHOU"], "ref": ["3 new citations to articles by Xin ZHOU"]}
{"title": "CSVD-AES: Cross-project software vulnerability detection based on active learning with metric fusion", "first_label": ["Vulnerabilities"], "second_label": ["Detection"], "data": "Z Yuan, X Chen, J Zhang, W Zeng- Information and Software Technology, 2026\nAbstract Context: Previous studies on Cross-Project Software Vulnerability Detection \n(CSVD) have shown that leveraging a small number of labeled modules from the \ntarget project can enhance the performance of CSVD. However, how to", "link": "https://scholar.google.com/scholar_url?url=https://www.sciencedirect.com/science/article/pii/S0950584926000042&hl=en&sa=X&d=3705117794521407400&ei=30Ffac-RLMelieoP1s_TgA8&scisig=ALhkC2Tvt3O36yu7kOa2Obfj8P9S&oi=scholaralrt&hist=ylyK0_8AAAAJ:11088443020050739259:ALhkC2SS1P3l44RDJXsNEdNzDLiT&html=&pos=0&folt=rel", "author": ["Quang-Cuong Bui"], "ref": ["Quang-Cuong Bui - new related research", "2 new citations to articles by Hong Jin Kang", "Xin ZHOU - new related research", "Hong Jin Kang - new related research"]}
{"title": "STELLAR: A Search-Based Testing Framework for Large Language Model Applications", "first_label": ["LLM", "Software Testing"], "second_label": ["Search"], "data": "L Sorokin, I Vasilev, KE Friedl, A Stocco- arXiv preprint arXiv:2601.00497, 2026\nLarge Language Model (LLM)-based applications are increasingly deployed across \nvarious domains, including customer service, education, and mobility. However, \nthese systems are prone to inaccurate, fictitious, or harmful responses, and their vast\n \nThis message was sent by Google Scholar because you're following new articles related to research by \nQuang-Cuong Bui\n.\nList alerts\nCancel alert", "link": "https://scholar.google.com/scholar_url?url=https://arxiv.org/pdf/2601.00497&hl=en&sa=X&d=18223111490822681150&ei=30Ffac-RLMelieoP1s_TgA8&scisig=ALhkC2Q-RwzdrApKxX9X-HFWrHW3&oi=scholaralrt&hist=ylyK0_8AAAAJ:11088443020050739259:ALhkC2SS1P3l44RDJXsNEdNzDLiT&html=&pos=1&folt=rel", "author": ["Quang-Cuong Bui"], "ref": ["Quang-Cuong Bui - new related research"]}
{"title": "Source code vulnerability detection based on deep learning: a review", "first_label": ["Vulnerabilities", "Code"], "second_label": ["Detection"], "data": "H Su, Z Xu, Y Zhang, Q Tan- Cybersecurity, 2026\nSource code vulnerability detection is a crucial aspect of software security \ndevelopment, and the current use of Large Language Models (LLMs) accelerates not \nonly software development but also the generation and propagation of code \nvulnerabilities. Traditional code vulnerability detection techniques have limited \ndetection efficiency and accuracy. Deep learning techniques have recently gained \ndistinct advantages in multidimensional feature extraction and large-scale data\nCites: Assessing generalizability of codebert  \n \nThis message was sent by Google Scholar because you're following new citations to articles written by \nXin ZHOU\n.\nList alerts\nCancel alert", "link": "https://scholar.google.com/scholar_url?url=https://link.springer.com/article/10.1186/s42400-025-00518-7&hl=en&sa=X&d=3272529401758972701&ei=4EFfadiwGcm4ieoP4sbVuAg&scisig=ALhkC2TjSovjFsiBKuBgFvlDC3XJ&oi=scholaralrt&hist=ylyK0_8AAAAJ:15035864585353249078:ALhkC2S1ZxbvKZLR2YX67Bvdxjyf&html=&pos=0&folt=cit", "author": ["Xin ZHOU"], "ref": ["1 new citation to articles by Xin ZHOU"]}
{"title": "Towards Path-Aware Coverage-Guided Fuzzing", "first_label": ["Fuzzing"], "second_label": [], "data": "G Priamo, DC D'Elia, M Payer, L Querzoni\nAutomated fuzz testing is now standard practice, yet key blind spots persist. \nCoverage-guided fuzzers typically rely on edge coverage as a lightweight proxy for \nprogram behavior. However, this metric captures path variations only weakly: it\n \nThis message was sent by Google Scholar because you're following new articles related to research by \nAbhik Roychoudhury\n.\nList alerts\nCancel alert", "link": "https://scholar.google.com/scholar_url?url=http://www.diag.uniroma1.it/~delia/papers/cgo26-blfuzz.pdf&hl=en&sa=X&d=17736116867827979674&ei=30FfaeHLOuqsieoPjYOSgAM&scisig=ALhkC2SntRQs13INsGhz3d7ziOr8&oi=scholaralrt&hist=ylyK0_8AAAAJ:12723761785867032729:ALhkC2Tff526TIEbfh2mbT-kfB65&html=&pos=0&folt=rel", "author": ["Abhik Roychoudhury"], "ref": ["Abhik Roychoudhury - new related research"]}
{"title": "Cracking IoT Security: Can LLMs Outsmart Static Analysis Tools?", "first_label": ["LLM", "Static Analysis"], "second_label": [], "data": "J Quantrill, N Khajehnouri, Z Guo, MH Alalfi- arXiv preprint arXiv:2601.00559, 2026\nSmart home IoT platforms such as openHAB rely on Trigger Action Condition (TAC) \nrules to automate device behavior, but the interplay among these rules can give rise \nto interaction threats, unintended or unsafe behaviors emerging from implicit \ndependencies, conflicting triggers, or overlapping conditions. Identifying these \nthreats requires semantic understanding and structural reasoning that traditionally \ndepend on symbolic, constraint-driven static analysis. This work presents the first\nCites: Iotbox: Sandbox mining to prevent interaction threats in iot systems  \n \nThis message was sent by Google Scholar because you're following new citations to articles written by \nHong Jin Kang\n.\nList alerts\nCancel alert", "link": "https://scholar.google.com/scholar_url?url=https://arxiv.org/pdf/2601.00559&hl=en&sa=X&d=2241689172288092007&ei=3kFfafDtKsm4ieoP4sbVuAg&scisig=ALhkC2TsBtRinD6DOwzVELfTAE9V&oi=scholaralrt&hist=ylyK0_8AAAAJ:4851239734318863641:ALhkC2Tv0L1GNq4Kk4Fq05ZvgtDM&html=&pos=1&folt=cit", "author": ["Hong Jin Kang"], "ref": ["2 new citations to articles by Hong Jin Kang", "1 new citation to articles by Bach Le", "1 new citation to articles by Thanh Le-Cong"]}
{"title": "Automating fuzz driver generation for deep learning libraries with large language models", "first_label": ["LLM", "Fuzzing"], "second_label": ["Generation"], "data": "T Zheng, F Meng, P Yi, Y Wu- Cybersecurity, 2026\nThe widespread adoption of deep learning (DL) libraries has raised concerns about \ntheir reliability and security. While prior works leveraged large language models \n(LLMs) to generate test programs for DL library APIs, the hardcoded program", "link": "https://scholar.google.com/scholar_url?url=https://link.springer.com/article/10.1186/s42400-025-00532-9&hl=en&sa=X&d=9592968335886159691&ei=4EFfacDAJtrJieoPiYyysAk&scisig=ALhkC2R_TIIIXB9-Mb9F98OrhNZw&oi=scholaralrt&hist=ylyK0_8AAAAJ:16898579961534012346:ALhkC2Q9j5kdmlV_e8u2kLe_NWfw&html=&pos=1&folt=rel", "author": ["Xin ZHOU"], "ref": ["Xin ZHOU - new related research", "David Lo - new related research", "Hong Jin Kang - new related research"]}
{"title": "In Line with Context: Repository-Level Code Generation via Context Inlining", "first_label": ["Code", "Repository-Level"], "second_label": ["Generation"], "data": "C Hu, W Zeng, Y Shi, B Shen, X Gu- arXiv preprint arXiv:2601.00376, 2026\nRepository-level code generation has attracted growing attention in recent years. \nUnlike function-level code generation, it requires the model to understand the entire \nrepository, reasoning over complex dependencies across functions, classes, and", "link": "https://scholar.google.com/scholar_url?url=https://arxiv.org/pdf/2601.00376&hl=en&sa=X&d=836834401518142748&ei=4EFfacDAJtrJieoPiYyysAk&scisig=ALhkC2Sh9YlJkTjAcstIMlYdujPo&oi=scholaralrt&hist=ylyK0_8AAAAJ:16898579961534012346:ALhkC2Q9j5kdmlV_e8u2kLe_NWfw&html=&pos=2&folt=rel", "author": ["Xin ZHOU"], "ref": ["Xin ZHOU - new related research", "David Lo - new related research", "Hong Jin Kang - new related research"]}
{"title": "Improving LLM-Assisted Secure Code Generation through Retrieval-Augmented-Generation and Multi-Tool Feedback", "first_label": ["LLM", "Code"], "second_label": ["Generation"], "data": "V Sriram, S Pandita, A Lakshmanan, A Shamraj- arXiv preprint arXiv, 2026\nLarge Language Models (LLMs) can generate code but often introduce security \nvulnerabilities, logical inconsistencies, and compilation errors. Prior work \ndemonstrates that LLMs benefit substantially from structured feedback, static", "link": "https://scholar.google.com/scholar_url?url=https://arxiv.org/pdf/2601.00509&hl=en&sa=X&d=14598986926423864537&ei=4EFfacDAJtrJieoPiYyysAk&scisig=ALhkC2QwAX5ILa-Ox7ZVwU82Mgx0&oi=scholaralrt&hist=ylyK0_8AAAAJ:16898579961534012346:ALhkC2Q9j5kdmlV_e8u2kLe_NWfw&html=&pos=3&folt=rel", "author": ["Xin ZHOU"], "ref": ["Xin ZHOU - new related research"]}
{"title": "Catching common vulnerabilities with code language models", "first_label": ["Vulnerabilities", "LLM", "Code"], "second_label": ["Detection"], "data": "S Al Atiiq, C Gehrmann, K Khalil, K Dahln- 2025 IEEE Secure Development, 2025\nCode Language Model (code-LM)-based vulnerability detection for C/C++ faces a \nsubstantial challenge. Previous research has shown that even though it is better than \nany prior machine learning approach, it still struggles to generalize well, as shown by\n \nThis message was sent by Google Scholar because you're following new articles related to research by \nXin ZHOU\n.\nList alerts\nCancel alert", "link": "https://scholar.google.com/scholar_url?url=https://lup.lub.lu.se/record/4a13fc00-b39b-4ac7-8940-4fa571d55e8d&hl=en&sa=X&d=189082203538347483&ei=4EFfacDAJtrJieoPiYyysAk&scisig=ALhkC2SU0YaKyLoFQquj7BYIIm-s&oi=scholaralrt&hist=ylyK0_8AAAAJ:16898579961534012346:ALhkC2Q9j5kdmlV_e8u2kLe_NWfw&html=&pos=4&folt=rel", "author": ["Xin ZHOU"], "ref": ["Xin ZHOU - new related research"]}
{"title": "Protean: A Programmable Spectre Defense", "first_label": [], "second_label": [], "data": "N Mosier, H Nemati, JC Mitchell, C Trippel\nWe present the PROTEAN Spectre defensethe first to be altogether \ncomprehensive, covering all side-channels and speculation; programmer-\ntransparent, requiring no source modifications; and programmable, tailoring its \nhardware protections to software's security needs. Several Spectre defenses offer the \nfirst two features, but protect a hardware-defined subset of architectural state from \ntransiently leaking. Meanwhile, many Spectrevulnerable programs process secrets in\nCites: oo7: Low-overhead defense against spectre attacks via program", "link": "https://scholar.google.com/scholar_url?url=https://www-cs.stanford.edu/people/trippel/pubs/mosier_HPCA26.pdf&hl=en&sa=X&d=14616010382144008554&ei=30FfaaS2He-GieoPo9DluQE&scisig=ALhkC2RCI4qp6hdiZwt856eiUgZI&oi=scholaralrt&hist=ylyK0_8AAAAJ:10071049626428824134:ALhkC2SLNtxsIYV7y8T6Ni2J4ruF&html=&pos=0&folt=cit", "author": ["Abhik Roychoudhury"], "ref": ["4 new citations to articles by Abhik Roychoudhury"]}
{"title": "Refining Code Coverage to Better Reflect Fuzzing Performance", "first_label": ["Fuzzing", "Code"], "second_label": [], "data": "S Lipp - 2025\nFuzzing is a testing technique that executes the software with malformed inputs to \nuncover vulnerabilities. Traditional metrics like code coverage treat all code as \nequally important and can, therefore, lead to inaccurate fuzzing assessments. This \nthesis introduces a novel vulnerability-oriented metric that focuses on the covered, \npotentially vulnerable code to better reflect the efficiency and effectiveness of fuzzing. \nbersetzte Kurzfassung: Fuzzing ist eine Testtechnik, bei der die Software mit\nCites: Smart greybox fuzzing", "link": "https://scholar.google.com/scholar_url?url=https://mediatum.ub.tum.de/doc/1774977/document.pdf&hl=en&sa=X&d=6180329695018348447&ei=30FfaaS2He-GieoPo9DluQE&scisig=ALhkC2SGZOa9HynMWf5HTB31ecTV&oi=scholaralrt&hist=ylyK0_8AAAAJ:10071049626428824134:ALhkC2SLNtxsIYV7y8T6Ni2J4ruF&html=&pos=1&folt=cit", "author": ["Abhik Roychoudhury"], "ref": ["4 new citations to articles by Abhik Roychoudhury"]}
{"title": "Fuzzing Guided by Bayesian Program Analysis", "first_label": ["Fuzzing"], "second_label": [], "data": "Y ZHANG, XIN ZHANG - 2026\nAuthors' Contact Information: Yifan Zhang, Key Laboratory of High Con\" dence \nSoftware Technologies (Peking University), Ministry of Education; School of \nComputer Science, Peking University, Beijing, China, yfzhang23@ stu. pku. edu. cn; \nXin Zhang, Key Laboratory of High Con\" dence Software Technologies (Peking \nUniversity), Ministry of Education; School of Computer Science, Peking University, \nBeijing, China, xin@ pku. edu. cn.\nCites: Directed greybox fuzzing", "link": "https://scholar.google.com/scholar_url?url=https://jjleo.github.io/files/popl2026.pdf&hl=en&sa=X&d=12043673721423011910&ei=30FfaaS2He-GieoPo9DluQE&scisig=ALhkC2RkH7tZ3S5RMGVBBBfweQxS&oi=scholaralrt&hist=ylyK0_8AAAAJ:10071049626428824134:ALhkC2SLNtxsIYV7y8T6Ni2J4ruF&html=&pos=2&folt=cit", "author": ["Abhik Roychoudhury"], "ref": ["4 new citations to articles by Abhik Roychoudhury"]}
{"title": "Leveraging Abstract Syntax Trees To Generate Instructive Hints In Programming", "first_label": [], "second_label": [], "data": "M Levin, H Kandjimi, A Safla- ICT Education\nIntroductory programming education is constantly challenged with how to provide \neffective, personalized guidance to struggling novices. AST-based hints generation \nemerges as a potential solution, marrying abstract syntax tree analysis with \ngenerative AI to offer tailored, instructive feedback for Python learners. Existing hint \ngeneration systems like ITAP and GPT4Hints-GPT3. 5Val have approached hint \ngeneration through path construction and generative models, respectively. Both\nCites: A feasibility study of using automated program repair for  \n \nThis message was sent by Google Scholar because you're following new citations to articles written by \nAbhik Roychoudhury\n.\nList alerts\nCancel alert", "link": "https://scholar.google.com/scholar_url?url=https://link.springer.com/content/pdf/10.1007/978-3-032-12457-9.pdf%23page%3D44&hl=en&sa=X&d=18231020807051559687&ei=30FfaaS2He-GieoPo9DluQE&scisig=ALhkC2SbAPXc3j9oPlR3Ht9ZLHzG&oi=scholaralrt&hist=ylyK0_8AAAAJ:10071049626428824134:ALhkC2SLNtxsIYV7y8T6Ni2J4ruF&html=&pos=3&folt=cit", "author": ["Abhik Roychoudhury"], "ref": ["4 new citations to articles by Abhik Roychoudhury"]}
{"title": "VulnLLM-R: Specialized Reasoning LLM with Agent Scaffold for Vulnerability Detection", "first_label": ["Vulnerabilities", "LLM"], "second_label": ["Detection", "Agent", "Reasoning"], "data": "Y Nie, H Li, C Guo, R Jiang, Z Wang, B Li, D Song- arXiv preprint arXiv, 2025\nWe propose VulnLLM-R, the~\\emph {first specialized reasoning LLM} for \nvulnerability detection. Our key insight is that LLMs can reason about program states \nand analyze the potential vulnerabilities, rather than simple pattern matching. This\n \nThis message was sent by Google Scholar because you're following new articles related to research by \nBach Le\n.\nList alerts\nCancel alert", "link": "https://scholar.google.com/scholar_url?url=https://arxiv.org/pdf/2512.07533&hl=en&sa=X&d=14822866035105946059&ei=3kFfadzmGb6Z6rQPr-v5iAc&scisig=ALhkC2SrItwEGbUy2HNxI0DJG3ud&oi=scholaralrt&hist=ylyK0_8AAAAJ:4328508672846969495:ALhkC2QkVwCdvNzUylYiTyCmheSL&html=&pos=0&folt=rel", "author": ["Bach Le"], "ref": ["Bach Le - new related research"]}
{"title": "Security in the Age of AI Teammates: An Empirical Study of Agentic Pull Requests on GitHub", "first_label": [], "second_label": ["Agent"], "data": "ML Siddiq, X Zhao, VC Lopes, B Casey, J Santos- arXiv preprint arXiv:2601.00477, 2026\nAutonomous coding agents are increasingly deployed as AI teammates in modern \nsoftware engineering, independently authoring pull requests (PRs) that modify \nproduction code at scale. This study aims to systematically characterize how", "link": "https://scholar.google.com/scholar_url?url=https://arxiv.org/pdf/2601.00477&hl=en&sa=X&d=14917883189846212310&ei=30FfaZ36DZ6u6rQPotyMwAQ&scisig=ALhkC2Q7SyN8jfOw31IOSFm8hnOX&oi=scholaralrt&hist=ylyK0_8AAAAJ:5865787842749446205:ALhkC2THo_3s8tBI3qmyNrpmj0cv&html=&pos=1&folt=rel", "author": ["David Lo"], "ref": ["David Lo - new related research"]}
