{"title": "Methods and Techniques of Agentic Software Engineering: A Systematic Literature Review", "first_label": [], "second_label": ["Agent"], "data": "N Otoum, N Elkhalili- IEEE Access, 2026\nThe development of agentic software engineering (ASE) is shifting the software \ndevelopment process, specifically by adopting autonomous agents into the \nfundamental software development process, where autonomous agents using large \nlanguage models (LLMs) and artificial intelligence (AI) make decisions, write code, \nand collaborate across the entire software development lifecycle. The systematic \nreview is a summary of literature on the agentic software engineering methodologies\nCites: Large language model for vulnerability detection and repair", "link": "https://scholar.google.com/scholar_url?url=https://ieeexplore.ieee.org/iel8/6287639/11323511/11343819.pdf&hl=en&sa=X&d=12073211064173990736&ei=OJZ2aZvXK9aOieoPnNOJuQQ&scisig=AHkA5jTNyVjJAGvl9NRpjadlf6Sh&oi=scholaralrt&hist=ylyK0_8AAAAJ:15035864585353249078:AHkA5jQsJ3NDDWezXcIZ7k5eS-ud&html=&pos=0&folt=cit", "author": ["Xin ZHOU"], "ref": ["7 new citations to articles by Xin ZHOU"]}
{"title": "Integration of Large Language Models (LLMs) and Static Analysis for Improving the Efficacy of Security Vulnerability Detection in Source Code", "first_label": ["Vulnerabilities", "LLM", "Code", "Static Analysis"], "second_label": ["Detection"], "data": "JAS Ciavatta, JRB Higuera, JB Higuera, JAS Montalvo- Computers, Materials and, 2026\nAs artificial Intelligence (AI) continues to expand exponentially, particularly with the \nemergence of generative pre-trained transformers (GPT) based on a transformer's \narchitecture, which has revolutionized data processing and enabled significant \nimprovements in various applications. This document seeks to investigate the \nsecurity vulnerabilities detection in the source code using a range of large language \nmodels (LLM). Our primary objective is to evaluate the effectiveness of Static\nCites: Large language model for vulnerability detection and repair", "link": "https://scholar.google.com/scholar_url?url=https://www.sciencedirect.com/org/science/article/pii/S1546221826000603&hl=en&sa=X&d=1702570943888436159&ei=OJZ2aZvXK9aOieoPnNOJuQQ&scisig=AHkA5jQaFDJdOIPwrP3yejLvdKj5&oi=scholaralrt&hist=ylyK0_8AAAAJ:15035864585353249078:AHkA5jQsJ3NDDWezXcIZ7k5eS-ud&html=&pos=1&folt=cit", "author": ["Xin ZHOU"], "ref": ["7 new citations to articles by Xin ZHOU", "David Lo - new related research", "Hong Jin Kang - new related research", "Quang-Cuong Bui - new related research"]}
{"title": "Benchmarking AI Models in Software Engineering: A Review, Search Tool, and Unified Approach for Elevating Benchmark Quality", "first_label": [], "second_label": ["Search"], "data": "R Koohestani, P de Bekker, B Ko, M Izadi- IEEE Transactions on Software, 2025\nBenchmarks are essential for unified evaluation and reproducibility. The rapid rise of \nArtificial Intelligence for Software Engineering (AI4SE) has produced numerous \nbenchmarks for tasks such as code generation and bug repair. However, this \nproliferation has led to major challenges:(1) fragmented knowledge across tasks,(2) \ndifficulty in selecting contextually relevant benchmarks,(3) lack of standardization in \nbenchmark creation, and (4) flaws that limit utility. Addressing these requires a dual\nCites: Codeultrafeedback: An llm-as-a-judge dataset for aligning large", "link": "https://scholar.google.com/scholar_url?url=https://ieeexplore.ieee.org/abstract/document/11301810/&hl=en&sa=X&d=16799920069451729186&ei=OJZ2aZvXK9aOieoPnNOJuQQ&scisig=AHkA5jQBs3p_De6u40I5h2GisPAs&oi=scholaralrt&hist=ylyK0_8AAAAJ:15035864585353249078:AHkA5jQsJ3NDDWezXcIZ7k5eS-ud&html=&pos=2&folt=cit", "author": ["Xin ZHOU"], "ref": ["7 new citations to articles by Xin ZHOU", "2 new citations to articles by Quang-Cuong Bui", "5 new citations to articles by Hong Jin Kang"]}
{"title": "LibPass: An Entropy-Guided Black-Box Adversarial Attack Against Third-Party Library Detection Tools in the Wild", "first_label": [], "second_label": ["Detection"], "data": "B Zhou, J Wu, X Ling, J Zhang, T Luo- IEEE Transactions on Dependable and Secure, 2025\nTo mitigate the security and compliance risks posed by Android third-party libraries \n(TPLs), researchers have proposed many automated detection tools aimed at \naccurately identifying TPLs within Android applications (apps). The detection results \nserve as the foundation for practical downstream tasks such as software bill of \nmaterials (SBOM) generation, n-day vulnerability identification, compliance auditing, \nand software supply chain risk tracing, among others. However, despite the high\nCites: Large language model for vulnerability detection: Emerging results", "link": "https://scholar.google.com/scholar_url?url=https://ieeexplore.ieee.org/abstract/document/11275815/&hl=en&sa=X&d=8460076113319438116&ei=OJZ2aZvXK9aOieoPnNOJuQQ&scisig=AHkA5jTftKHRmcWkaLTEnCM7NK1p&oi=scholaralrt&hist=ylyK0_8AAAAJ:15035864585353249078:AHkA5jQsJ3NDDWezXcIZ7k5eS-ud&html=&pos=3&folt=cit", "author": ["Xin ZHOU"], "ref": ["7 new citations to articles by Xin ZHOU"]}
{"title": "An Empirical Study of Parameter-Efficient Fine-Tuning in Code Change Learning and Beyond", "first_label": ["Code", "Code Change"], "second_label": [], "data": "S Liu, J Keung, Z Jin, Z Yang, F Liu, H Zhang- IEEE Transactions on Software, 2025\nCompared to Full-Model Fine-Tuning (FMFT), Parameter-Efficient Fine-Tuning \n(PEFT) has demonstrated superior efficacy and efficiency in several code \nunderstanding tasks, owing to PEFT's ability to alleviate the catastrophic forgetting \nissue of Pre-trained Language Models (PLMs) by updating only a small number of \nparameters. However, existing studies primarily involve static code comprehension, \naligning with the pre-training paradigm of recent PLMs and facilitating knowledge\nCites: Exploring Parameter-Efficient Fine-Tuning Techniques for Code", "link": "https://scholar.google.com/scholar_url?url=https://ieeexplore.ieee.org/abstract/document/11270016/&hl=en&sa=X&d=6580036264312955090&ei=OJZ2aZvXK9aOieoPnNOJuQQ&scisig=AHkA5jRzfDaGDjfsJIecgNFMlZVD&oi=scholaralrt&hist=ylyK0_8AAAAJ:15035864585353249078:AHkA5jQsJ3NDDWezXcIZ7k5eS-ud&html=&pos=4&folt=cit", "author": ["Xin ZHOU"], "ref": ["7 new citations to articles by Xin ZHOU", "5 new citations to articles by Hong Jin Kang"]}
{"title": "HANAMI: Hardware-assisted Fuzzing for Microcontroller Firmware with Neural Network Assistance", "first_label": ["Fuzzing"], "second_label": [], "data": "Y Li, Y Liu, A Dai, H Li, Y Shen, Y Zhou- IEEE Internet of Things Journal, 2025\nFuzzing for the microcontroller unit (MCU) firmware presents unique challenges \ncompared to conventional program code fuzzing due to hardware limitations and \nrestricted runtime visibility. While firmware emulation and hardware-assisted \nmethods mitigate execution environment challenges for embedded fuzzing tools, the \nefficiency of fuzzing MCU firmware, especially peripheral driver code, is still limited \nby sparse code coverage and insufficient path exploration. To overcome these\nCites: Curiosity-driven testing for sequential decision-making process", "link": "https://scholar.google.com/scholar_url?url=https://ieeexplore.ieee.org/abstract/document/11271437/&hl=en&sa=X&d=13286684627243607548&ei=OJZ2aZvXK9aOieoPnNOJuQQ&scisig=AHkA5jRdrj-vVC40ECR0ugF_D560&oi=scholaralrt&hist=ylyK0_8AAAAJ:15035864585353249078:AHkA5jQsJ3NDDWezXcIZ7k5eS-ud&html=&pos=5&folt=cit", "author": ["Xin ZHOU"], "ref": ["7 new citations to articles by Xin ZHOU", "10 new citations to articles by Abhik Roychoudhury"]}
{"title": "Knowledge distillation-driven commit-aware multimodal learning for software vulnerability detection", "first_label": ["Vulnerabilities"], "second_label": ["Detection"], "data": "R Mahouachi- Automated Software Engineering, 2026\nSoftware vulnerabilities are a major concern in cybersecurity, as even small flaws \ncan expose systems to serious risks. Most automated detection methods focus on a \nsingle sourceusually codelimiting their ability to capture the diverse ways \nvulnerabilities can appear and leaving complementary information underused. To \naddress this limitation, this work investigates how heterogeneous modalities \ncontribute to vulnerability detection and proposes a multimodal deep learning\nCites: Large language model for vulnerability detection: Emerging results  \n \nThis message was sent by Google Scholar because you're following new citations to articles written by \nXin ZHOU\n.\nList alerts\nCancel alert", "link": "https://scholar.google.com/scholar_url?url=https://link.springer.com/article/10.1007/s10515-026-00595-z&hl=en&sa=X&d=15646205250339731931&ei=OJZ2aZvXK9aOieoPnNOJuQQ&scisig=AHkA5jREo-OYt7ogNQ-lN_zB8Z-i&oi=scholaralrt&hist=ylyK0_8AAAAJ:15035864585353249078:AHkA5jQsJ3NDDWezXcIZ7k5eS-ud&html=&pos=6&folt=cit", "author": ["Xin ZHOU"], "ref": ["7 new citations to articles by Xin ZHOU", "Hong Jin Kang - new related research", "Quang-Cuong Bui - new related research"]}
{"title": "A comparative analysis of CodeBERT and CodeLlama models: Architecture, functionality and application in software coding tasks", "first_label": ["LLM", "Code"], "second_label": [], "data": "O Deineha, O Arshava, I Zhovtonizhko- homepage: https://bulletin-chstu. com. ua/en, 2025\nThe relevance of the research was conditioned by the need to compare the large \nlanguage models CodeBERT and CodeLlama, which were actively used for \nautomating code generation and analysis with the aim of improving the efficiency \nand quality of software. The aim of the study was a comprehensive juxtaposition of \nthe architectural and functional characteristics of the selected language models \nCodeBERT and CodeLlama. Interpretative, comparative, systemic and structural\nCites: When Fine-Tuning LLMs Meets Data Privacy: An Empirical Study", "link": "https://scholar.google.com/scholar_url?url=https://www.researchgate.net/profile/Olena-Arshava/publication/399882931_A_comparative_analysis_of_CodeBERT_and_CodeLlama_models_Architecture_functionality_and_application_in_software_coding_tasks/links/696e4f2e21a46d6f702389a5/A-comparative-analysis-of-CodeBERT-and-CodeLlama-models-Architecture-functionality-and-application-in-software-coding-tasks.pdf&hl=en&sa=X&d=11773969144472515116&ei=NpZ2aa6CN_DB6rQPsMjv6As&scisig=AHkA5jRYkanASWN9VejA7PMU8Nnl&oi=scholaralrt&hist=ylyK0_8AAAAJ:4974034551180671527:AHkA5jSJKysCIe7aKJHkjio0etwZ&html=&pos=0&folt=cit", "author": ["Bach Le"], "ref": ["4 new citations to articles by Bach Le", "5 new citations to articles by Hong Jin Kang"]}
{"title": "Evaluating Large Language Models for Line-Level Vulnerability Localization", "first_label": ["Vulnerabilities", "LLM"], "second_label": ["Localization"], "data": "J Zhang, C Wang, A Li, W Sun, C Zhang, W Ma, Y Liu- IEEE Transactions on, 2025\nRecently, Automated Vulnerability Localization (AVL) has attracted growing attention, \naiming to facilitate diagnosis by pinpointing the specific lines of code responsible for \nvulnerabilities. Large Language Models (LLMs) have shown potential in various \ndomains, yet their effectiveness in line-level vulnerability localization remains \nunderexplored. In this work, we present the first comprehensive empirical evaluation \nof LLMs for AVL. Our study examines 19 leading LLMs suitable for code analysis\nCites: Smart contract development: Challenges and opportunities", "link": "https://scholar.google.com/scholar_url?url=https://ieeexplore.ieee.org/abstract/document/11318142/&hl=en&sa=X&d=5253556010021438658&ei=NpZ2aa6CN_DB6rQPsMjv6As&scisig=AHkA5jT971lTQQwYnbJwN8erjC8U&oi=scholaralrt&hist=ylyK0_8AAAAJ:4974034551180671527:AHkA5jSJKysCIe7aKJHkjio0etwZ&html=&pos=1&folt=cit", "author": ["Bach Le"], "ref": ["4 new citations to articles by Bach Le", "10 new citations to articles by Abhik Roychoudhury", "David Lo - new related research", "1 new citation to articles by Shengyi Pan", "Xin ZHOU - new related research", "Thanh Le-Cong - new related research", "Hong Jin Kang - new related research", "Quang-Cuong Bui - new related research"]}
{"title": "AdRS-MPIQ: Secure routing and trust management in wireless sensor networks", "first_label": [], "second_label": [], "data": "M Agarwal, A Shukla, VK Deolia- Information Security Journal: A Global Perspective, 2026\nSecure data sharing and trust management remain a significant challenge in the \nwireless sensor network because the heterogeneous nature of these networks \ncreates challenges associated with network lifetime, energy efficiency, and security. \nHowever, while the incorporation of blockchain technology for enabling secure data \nsharing offers robust performance, it is still prone to certain limitations, such as \nperformance degradation, limited scalability, and key size dependencies. Thus, to\nCites: Smart contract development: Challenges and opportunities", "link": "https://scholar.google.com/scholar_url?url=https://www.tandfonline.com/doi/abs/10.1080/19393555.2026.2617432&hl=en&sa=X&d=10425089244037853857&ei=NpZ2aa6CN_DB6rQPsMjv6As&scisig=AHkA5jSFXsdUB9sjwyK_4MlyXybp&oi=scholaralrt&hist=ylyK0_8AAAAJ:4974034551180671527:AHkA5jSJKysCIe7aKJHkjio0etwZ&html=&pos=2&folt=cit", "author": ["Bach Le"], "ref": ["4 new citations to articles by Bach Le"]}
{"title": "Integrating Attention Mechanism with Code Structural Affinity and Execution Context Correlation for Automated Bug Repair", "first_label": ["Code", "Bug"], "second_label": ["Repair"], "data": "J Ji, G Yang- Computers, Materials and Continua, 2026\nAutomated Program Repair (APR) techniques have shown significant potential in \nmitigating the cost and complexity associated with debugging by automatically \ngenerating corrective patches for software defects. Despite considerable progress in \nAPR methodologies, existing approaches frequently lack contextual awareness of \nruntime behaviors and structural intricacies inherent in buggy source code. In this \npaper, we propose a novel APR approach that integrates attention mechanisms\nCites: History driven program repair  \n \nThis message was sent by Google Scholar because you're following new citations to articles written by \nBach Le\n.\nList alerts\nCancel alert", "link": "https://scholar.google.com/scholar_url?url=https://www.sciencedirect.com/org/science/article/pii/S1546221826000949&hl=en&sa=X&d=8389963293695928641&ei=NpZ2aa6CN_DB6rQPsMjv6As&scisig=AHkA5jQFm7KEgP1IGLDXktyMDEVn&oi=scholaralrt&hist=ylyK0_8AAAAJ:4974034551180671527:AHkA5jSJKysCIe7aKJHkjio0etwZ&html=&pos=3&folt=cit", "author": ["Bach Le"], "ref": ["4 new citations to articles by Bach Le", "Thanh Le-Cong - new related research"]}
{"title": "Automated Analysis of Security Policy Violations in Helm Charts", "first_label": [], "second_label": [], "data": "F Minna, A Blaise, K Tuma, F Massacci- IEEE Transactions on Dependable and, 2025\nThe advent of Infrastructure-as-Code (IaC) and cloud platforms has transformed \napplications into ephemeral deployments of configuration files, where containers live \nfor only a few minutes. Several industry-level static analyzers are available to check \nsecurity misconfigurations before deployment, but the experimental evidence that we \nreport in this paper is that they provide different and possibly inconsistent results. We \ndeveloped an automated pipeline to evaluate and compare static analyzers for Helm\nCites: Maestro: A platform for benchmarking automatic program repair  \n \nThis message was sent by Google Scholar because you're following new citations to articles written by \nQuang-Cuong Bui\n.\nList alerts\nCancel alert", "link": "https://scholar.google.com/scholar_url?url=https://ieeexplore.ieee.org/iel8/8858/4358699/11223885.pdf&hl=en&sa=X&d=9180125745316626427&ei=N5Z2aZTLCNrJieoP06bqgAE&scisig=AHkA5jRYA7nUKuRoEsKLYlHN3Q4D&oi=scholaralrt&hist=ylyK0_8AAAAJ:5615766320347152220:AHkA5jRm2wEFxT9YlsyU6Bth2iiM&html=&pos=1&folt=cit", "author": ["Quang-Cuong Bui"], "ref": ["2 new citations to articles by Quang-Cuong Bui"]}
{"title": "DroneTest-Copilot: AGI-Powered Automated Detection and Repair of Flaws in Drone Autotest Suites", "first_label": ["Software Testing"], "second_label": ["Detection", "Repair"], "data": "Z Liang, L Hu, Q Fan, B Yuan, Q Zhang, D Zou, H Jin- IEEE Transactions on Network, 2026\nIn the landscape of the low-altitude economy, ensuring the reliability of drone flight \ncontrol software is of utmost importance. ArduPilot's autotest is an automated testing \nframework integrated into its continuous integration (CI) pipeline, which is crucial for \nvalidating autopilot functionality. However, numerous logic defects exist in its test \ncases, where the intended workflow doesn't match the code implementation. This \npaper presents DroneTest-Copilot (DTC), a novel framework that leverages large\nCites: Automated Repair of Programs from Large Language Models", "link": "https://scholar.google.com/scholar_url?url=https://ieeexplore.ieee.org/iel8/6488902/6930788/11348971.pdf&hl=en&sa=X&d=17865192652164761529&ei=N5Z2aYeHNKC16rQPqaeYsAc&scisig=AHkA5jQzjqJ0atBqrJLzwYVimV4L&oi=scholaralrt&hist=ylyK0_8AAAAJ:10071049626428824134:AHkA5jQRfWoRNvJIMJ7ZeL1tZJbF&html=&pos=1&folt=cit", "author": ["Abhik Roychoudhury"], "ref": ["10 new citations to articles by Abhik Roychoudhury"]}
{"title": "A Novel Seed Scheduling Scheme Using Thompson Sampling for Coverage-guided Greybox Fuzzing", "first_label": ["Fuzzing"], "second_label": [], "data": "W Zhang, J Chen, S Cai, K Wang, Y Liu, H Ding- Journal of Systems and Software, 2026\nAbstract Coverage-guided Greybox Fuzzing (CGF) aims to maximize code area \nexploration within limited time, achieving higher code coverage. Current methods \ngenerally estimate seed potential through attributes like execution speed and size, \nbut often ignore the distribution of explored program space and seed category \npotential in detecting new coverage, resulting in unbalanced code area exploration \nand limited detection of complex code. This paper proposes TMS-Fuzz, a new\nCites: Directed greybox fuzzing", "link": "https://scholar.google.com/scholar_url?url=https://www.sciencedirect.com/science/article/pii/S0164121226000282&hl=en&sa=X&d=3848108523093918317&ei=N5Z2aYeHNKC16rQPqaeYsAc&scisig=AHkA5jRG6Mg3dxk0ESf1Zlk_IJA3&oi=scholaralrt&hist=ylyK0_8AAAAJ:10071049626428824134:AHkA5jQRfWoRNvJIMJ7ZeL1tZJbF&html=&pos=3&folt=cit", "author": ["Abhik Roychoudhury"], "ref": ["10 new citations to articles by Abhik Roychoudhury", "Hong Jin Kang - new related research"]}
{"title": "Your Copied Data is Under Monitoring: A Study of Clipboard Usage in Android Applications", "first_label": [], "second_label": [], "data": "Y Chen, J Wang, R Tang, C Zuo, L Xue, W Xu, X Luo- IEEE Transactions on, 2025\nClipboard usage is prevalent in mobile applications nowadays. However, insufficient \naccess control on the clipboard in mobile operating systems exposes its contained \ndata to high risks where one application can read the data, store it locally, or even \nsend it to remote servers. Unfortunately, the literature only has ad-hoc studies in this \nrespect and lacks a comprehensive and systematic study of the entire mobile \napplication ecosystem. Therefore, this paper proposes an automated tool\nCites: Energypatch: Repairing resource leaks to improve energy", "link": "https://scholar.google.com/scholar_url?url=https://ieeexplore.ieee.org/abstract/document/11316827/&hl=en&sa=X&d=10507928327190823554&ei=N5Z2aYeHNKC16rQPqaeYsAc&scisig=AHkA5jRBglX1IaGa9z74gUpQ2bHm&oi=scholaralrt&hist=ylyK0_8AAAAJ:10071049626428824134:AHkA5jQRfWoRNvJIMJ7ZeL1tZJbF&html=&pos=4&folt=cit", "author": ["Abhik Roychoudhury"], "ref": ["10 new citations to articles by Abhik Roychoudhury"]}
{"title": "MPS-Fuzz: An Enhanced Fine-Grained Fuzzing Based on Units with Multiple Inputs and Outputs", "first_label": ["Fuzzing"], "second_label": [], "data": "X Fan, Y Fang, P Jia, H Li, X Peng, Y Xu, Q Wang- IEEE Transactions on, 2025\nEdge coverage-guided fuzzing has demonstrated remarkable achievements in \nvulnerability discovery. Some studies with fine-grained coverage metrics have been \nproposed to enhance the vulnerability mining capabilities of fuzzing by capturing \nmore program paths. However, this refinement often results in a significant increase \nin seeds, which are highly homogeneous and may limit vulnerability detection. \nAdditionally, finer granularity requires more bitmap hits, increasing the risk of hash\nCites: AFLNet: a greybox fuzzer for network protocols", "link": "https://scholar.google.com/scholar_url?url=https://ieeexplore.ieee.org/abstract/document/11299535/&hl=en&sa=X&d=11284907207980871326&ei=N5Z2aYeHNKC16rQPqaeYsAc&scisig=AHkA5jStTP5tjd6vEeRyk7F3CBmC&oi=scholaralrt&hist=ylyK0_8AAAAJ:10071049626428824134:AHkA5jQRfWoRNvJIMJ7ZeL1tZJbF&html=&pos=5&folt=cit", "author": ["Abhik Roychoudhury"], "ref": ["10 new citations to articles by Abhik Roychoudhury"]}
{"title": "The Impact of Prompt Language and Representation on LLM Reasoning: A Multilingual Empirical Study", "first_label": ["LLM"], "second_label": ["Reasoning"], "data": "L Ji, L Yao, W Xu, J Min, L Yuan- IEEE Access, 2025\nLarge language models (LLMs) have emerged as promising tools for automated \nvulnerability detection (VD), yet their effectiveness is strongly shaped by prompt \ndesign and input representation. Existing studies largely focus on detection \naccuracy, leaving open how factors such as prompt language, structural form, and \ncode representation influence performance. We conduct a systematic empirical study \non these dimensions by building a curated dataset from patched NVD vulnerabilities\nCites: Coverage-based greybox fuzzing as markov chain", "link": "https://scholar.google.com/scholar_url?url=https://ieeexplore.ieee.org/iel8/6287639/11323511/11318327.pdf&hl=en&sa=X&d=17502776829870271227&ei=N5Z2aYeHNKC16rQPqaeYsAc&scisig=AHkA5jQno2rdzJUUwZlzd4QkuUcI&oi=scholaralrt&hist=ylyK0_8AAAAJ:10071049626428824134:AHkA5jQRfWoRNvJIMJ7ZeL1tZJbF&html=&pos=6&folt=cit", "author": ["Abhik Roychoudhury"], "ref": ["10 new citations to articles by Abhik Roychoudhury"]}
{"title": "Large Language Models for Software Fault Localization: a Survey", "first_label": ["LLM", "Fault Localization"], "second_label": ["Localization"], "data": "X Chang, D Li, WE Wong- 2025 12th International Conference on Dependable, 2025\nThis survey reviews 36 peer-reviewed studies (2021-2025) on Large Language \nModel (LLM)-based Fault Localization (FL) across encoder-only, encoder-decoder, \nand decoder-only paradigms. We propose a taxonomy of LLMFL methods, analyze \nintegration strategies, and benchmark against Spectrum-Based Fault Localization \n(SBFL), MutationBased Fault Localization (MBFL), and learning-driven baselines on \nDefects4J, ConDefects, and Codeflaws. Our analysis indicates that encoder-only\nCites: Re-factoring based Program Repair applied to Programming", "link": "https://scholar.google.com/scholar_url?url=https://ieeexplore.ieee.org/abstract/document/11320383/&hl=en&sa=X&d=7260749433122604474&ei=N5Z2aYeHNKC16rQPqaeYsAc&scisig=AHkA5jQ3rucLnVmfANW6gH3Rpqol&oi=scholaralrt&hist=ylyK0_8AAAAJ:10071049626428824134:AHkA5jQRfWoRNvJIMJ7ZeL1tZJbF&html=&pos=7&folt=cit", "author": ["Abhik Roychoudhury"], "ref": ["10 new citations to articles by Abhik Roychoudhury", "5 new citations to articles by Hong Jin Kang"]}
{"title": "Manimatic: An AI-Powered Framework for Automated Physics Animation Generation using Deep Learning and Programmatic Visualization", "first_label": [], "second_label": ["Generation"], "data": "D Gnanakumar, H Kumar- 2025 4th International Conference on Automation, 2025\nThis paper presents Manimatic, an AI-powered framework that automates physics \nanimation generation by converting natural language descriptions into executable \nManim code and rendered visualizations. The system leverages domain-specific fine-\ntuning of transformer-based code generation models on a curated dataset of 1,050 \nphysics-specific prompt-code pairs spanning mechanics, waves, optics, and \nelectromagnetism. We employ a fine-tuned CodeGen-350M-mono model achieving\nCites: Automated Program Repair", "link": "https://scholar.google.com/scholar_url?url=https://ieeexplore.ieee.org/abstract/document/11324363/&hl=en&sa=X&d=4857910979600459327&ei=N5Z2aYeHNKC16rQPqaeYsAc&scisig=AHkA5jRpVpWRG9MkRAl-dzqKINeQ&oi=scholaralrt&hist=ylyK0_8AAAAJ:10071049626428824134:AHkA5jQRfWoRNvJIMJ7ZeL1tZJbF&html=&pos=8&folt=cit", "author": ["Abhik Roychoudhury"], "ref": ["10 new citations to articles by Abhik Roychoudhury"]}
{"title": "TransFER: A Novel Transformer-Based Facial Expression Recognizer Fusing RetNet and Feature Channel Information", "first_label": [], "second_label": [], "data": "Y Xiang- 2025 7th International Conference on Frontier, 2025\nFacial recognition technology has made significant progress in fields such as \nsecurity authentication and human-computer interaction, becoming one of the hot \nspots of modern computer vision. However, due to the limitation of input image \nquality, performances of traditional methods drop in low-resolution (LR) scenarios \nwhere faces and sizes are inconsistent. This issue remains challenging in practical \napplications. Most existing algorithms adopt the single-channel center strategy\nCites: Fuzz Testing based Data Augmentation to Improve Robustness of  \n \nThis message was sent by Google Scholar because you're following new citations to articles written by \nAbhik Roychoudhury\n.\nList alerts\nCancel alert", "link": "https://scholar.google.com/scholar_url?url=https://ieeexplore.ieee.org/abstract/document/11324667/&hl=en&sa=X&d=17626196116575306838&ei=N5Z2aYeHNKC16rQPqaeYsAc&scisig=AHkA5jQNjxerVyo1R1jbgs4TzzPh&oi=scholaralrt&hist=ylyK0_8AAAAJ:10071049626428824134:AHkA5jQRfWoRNvJIMJ7ZeL1tZJbF&html=&pos=9&folt=cit", "author": ["Abhik Roychoudhury"], "ref": ["10 new citations to articles by Abhik Roychoudhury"]}
{"title": "AgentRepair: Multi-Agent, AST-Anchored, Retrieval-Augmented Program Repair for Cold-Start Environments", "first_label": ["APR"], "second_label": ["Repair", "Agent"], "data": "H Lee, G Yang- 2025 12th International Conference on Dependable, 2025\nLarge Language Models (LLMs) have recently emerged as a promising tool for \nAutomatic Program Repair (APR), but they remain challenged by new projects \nwithout past bug-fix history. Because current models primarily attend to surface-level \ncode tokens, they often miss defects that manifest at deeper structural levels, which \nleads to incorrect or hallucinated patches and limits their practical applicability. To \nresolve this, we need a better method that uses solid proof to guide the LLM. For this\nCites: Bugsinpy: a database of existing bugs in python programs to", "link": "https://scholar.google.com/scholar_url?url=https://ieeexplore.ieee.org/abstract/document/11320358/&hl=en&sa=X&d=4017581079993354075&ei=NpZ2aYeOJsyQieoPxcX9yAo&scisig=AHkA5jT7ICDMH5FEXqZP4X5Fv_iX&oi=scholaralrt&hist=ylyK0_8AAAAJ:4851239734318863641:AHkA5jRxGJtM2gcBbnf89hFHeGJv&html=&pos=3&folt=cit", "author": ["Hong Jin Kang"], "ref": ["5 new citations to articles by Hong Jin Kang"]}
{"title": "M2G-Eval: Enhancing and Evaluating Multi-granularity Multilingual Code Generation", "first_label": ["Code"], "second_label": ["Generation"], "data": "F Xu, W Zhang, J Yang, G Chen, A Liu, Z Li, X Liu- arXiv preprint arXiv, 2025\nThe rapid advancement of code large language models (LLMs) has sparked \nsignificant research interest in systematically evaluating their code generation \ncapabilities, yet existing benchmarks predominantly assess models at a single", "link": "https://scholar.google.com/scholar_url?url=https://arxiv.org/pdf/2512.22628&hl=en&sa=X&d=5115797948410074072&ei=N5Z2af_EF5i8ieoPv_jKaQ&scisig=AHkA5jRhCH4REaHFCbS5-8KhUzBW&oi=scholaralrt&hist=ylyK0_8AAAAJ:5865787842749446205:AHkA5jRdC8MKBKkDX_XYP68jZAAq&html=&pos=2&folt=rel", "author": ["David Lo"], "ref": ["David Lo - new related research"]}
{"title": "Ache-Fuzz: Constraint-Aware Fuzzing for Vulnerability Discovery in Distributed Deep Learning Frameworks", "first_label": ["Vulnerabilities", "Fuzzing"], "second_label": [], "data": "Z Zhang, S Luo, L Liu, L Pan- Journal of Systems and Software, 2026\nEnsuring the reliability and security of deep learning (DL) libraries is essential for the \nrobustness of modern AI systems and large-scale intelligent computing \ninfrastructures. However, the complexity of API semantics and the diversity of\n \nThis message was sent by Google Scholar because you're following new articles related to research by \nDavid Lo\n.\nList alerts\nCancel alert", "link": "https://scholar.google.com/scholar_url?url=https://www.sciencedirect.com/science/article/pii/S0164121226000300&hl=en&sa=X&d=16517808850605079424&ei=N5Z2af_EF5i8ieoPv_jKaQ&scisig=AHkA5jT62ZHdKreWrpg7Ii8kSul7&oi=scholaralrt&hist=ylyK0_8AAAAJ:5865787842749446205:AHkA5jRdC8MKBKkDX_XYP68jZAAq&html=&pos=3&folt=rel", "author": ["David Lo"], "ref": ["David Lo - new related research", "Hong Jin Kang - new related research", "Abhik Roychoudhury - new related research"]}
{"title": "Rethinking the capability of fine-tuned language models for automated vulnerability repair", "first_label": ["Vulnerabilities", "LLM"], "second_label": ["Repair"], "data": "W Han, Y Kwak, M Yu, K Kim, Y Lee, H Moon, Y Paek- arXiv preprint arXiv, 2025\nLearning-based automated vulnerability repair (AVR) techniques that utilize fine-\ntuned language models have shown promise in generating vulnerability patches. \nHowever, questions remain about their ability to repair unseen vulnerabilities. Our", "link": "https://scholar.google.com/scholar_url?url=https://arxiv.org/pdf/2512.22633&hl=en&sa=X&d=8766402419509359319&ei=NpZ2aZO5BNaOieoPnNOJuQQ&scisig=AHkA5jQvXRXXYSZuEk5XdUKH22kV&oi=scholaralrt&hist=ylyK0_8AAAAJ:4328508672846969495:AHkA5jSuCQsu1z5iWz_gbATz5xCY&html=&pos=0&folt=rel", "author": ["Bach Le"], "ref": ["Bach Le - new related research"]}
{"title": "LLM-Based Repair of C++ Implicit Data Loss Compiler Warnings: An Industrial Case Study", "first_label": ["LLM"], "second_label": ["Repair"], "data": "C You, HD Choi, J Hong- arXiv preprint arXiv:2601.14936, 2026\nThis paper presents a method to automatically fix implicit data loss warnings in large \nC++ projects using Large Language Models (LLMs). Our approach uses the \nLanguage Server Protocol (LSP) to gather context, Tree-sitter to extract relevant\n \nThis message was sent by Google Scholar because you're following new articles related to research by \nBach Le\n.\nList alerts\nCancel alert", "link": "https://scholar.google.com/scholar_url?url=https://arxiv.org/pdf/2601.14936&hl=en&sa=X&d=5455946562152744833&ei=NpZ2aZO5BNaOieoPnNOJuQQ&scisig=AHkA5jSHGm4NfHUzdtOnWkd86BMt&oi=scholaralrt&hist=ylyK0_8AAAAJ:4328508672846969495:AHkA5jSuCQsu1z5iWz_gbATz5xCY&html=&pos=1&folt=rel", "author": ["Bach Le"], "ref": ["Bach Le - new related research", "Thanh Le-Cong - new related research", "Hong Jin Kang - new related research"]}
{"title": "Enhancing Parameter-Efficient Code Representations with Retrieval and Structural Priors", "first_label": ["Code"], "second_label": [], "data": "S Zheng, Y Li, X Ma- Applied Sciences, 2026\nHigh-quality code representations are fundamental to code intelligence. Achieving \nsuch representations with parameter-efficient fine-tuning (PEFT) remains a key \nchallenge. While code pre-trained models (CodePTMs) offer a robust foundation for\n \nThis message was sent by Google Scholar because you're following new articles related to research by \nXin ZHOU\n.\nList alerts\nCancel alert", "link": "https://scholar.google.com/scholar_url?url=https://www.mdpi.com/2076-3417/16/2/1106&hl=en&sa=X&d=13536924551305988793&ei=OJZ2aeSIONaOieoPnNOJuQQ&scisig=AHkA5jT5rNYn8BxHK_onO-Hc3IHM&oi=scholaralrt&hist=ylyK0_8AAAAJ:16898579961534012346:AHkA5jSEB1eKt2tiwZ0Di_PsePOh&html=&pos=1&folt=rel", "author": ["Xin ZHOU"], "ref": ["Xin ZHOU - new related research"]}
{"title": "A novel method for vulnerability detection based on fusion and hyperbolic neural network graphs", "first_label": ["Vulnerabilities"], "second_label": ["Detection", "Graph"], "data": "X Li, A Bhattacharjya, Q Li, MC Zhou, R Wisniewski- IEEE Transactions on, 2026\nDetecting vulnerabilities in source code is essential for maintaining cybersecurity in \ndigital space. Recent research has highlighted the strong representational \ncapabilities of Graph Neural Networks (GNNs) in modeling the structural features of\n \nThis message was sent by Google Scholar because you're following new articles related to research by \nThanh Le-Cong\n.\nList alerts\nCancel alert", "link": "https://scholar.google.com/scholar_url?url=https://ieeexplore.ieee.org/abstract/document/11359578/&hl=en&sa=X&d=1765881927313816104&ei=NpZ2aYXiFfStieoP-8T7kA0&scisig=AHkA5jSRjZMLG4Coh_QwlG0w4bgj&oi=scholaralrt&hist=ylyK0_8AAAAJ:4812769200119993430:AHkA5jS71y5YH911v9BWg5_Xgovk&html=&pos=3&folt=rel", "author": ["Thanh Le-Cong"], "ref": ["Thanh Le-Cong - new related research", "Hong Jin Kang - new related research", "Quang-Cuong Bui - new related research"]}
{"title": "Typestate-based Fault Localization of API Usage Violations in a Deep Learning Program", "first_label": ["Fault Localization"], "second_label": ["Localization"], "data": "F Batole, R Manke, R Dyer, TN Nguyen, H Rajan- IEEE Transactions on Software, 2026\nDeep Learning (DL) applications have become essential in numerous domains, yet \nthey remain plagued by subtle bugs that cause 66% of crashes in production \nsystems. These failures primarily stem from API usage violations in complex", "link": "https://scholar.google.com/scholar_url?url=https://ieeexplore.ieee.org/abstract/document/11359604/&hl=en&sa=X&d=3552810498236019335&ei=OZZ2adSlB9rJieoP06bqgAE&scisig=AHkA5jRqIUWPEdJgprR2PdVn9TL5&oi=scholaralrt&hist=ylyK0_8AAAAJ:17903213248891513419:AHkA5jQzY4yxbL7oubxUcSYtq2gm&html=&pos=5&folt=rel", "author": ["Hong Jin Kang"], "ref": ["Hong Jin Kang - new related research"]}
{"title": "LLM-in-Sandbox Elicits General Agentic Intelligence", "first_label": ["LLM"], "second_label": ["Agent"], "data": "D Cheng, S Huang, Y Gu, H Song, G Chen, L Dong- arXiv preprint arXiv, 2026\nWe introduce LLM-in-Sandbox, enabling LLMs to explore within a code sandbox (ie, \na virtual computer), to elicit general intelligence in non-code domains. We first \ndemonstrate that strong LLMs, without additional training, exhibit generalization", "link": "https://scholar.google.com/scholar_url?url=https://arxiv.org/pdf/2601.16206&hl=en&sa=X&d=12928722802559785051&ei=OJZ2adH-EdaOieoPnNOJuQQ&scisig=AHkA5jQA0ZvB5PHK-ITwMCPP7-h1&oi=scholaralrt&hist=ylyK0_8AAAAJ:12723761785867032729:AHkA5jSbMrs1rwdzDT4Fnpwpokkm&html=&pos=0&folt=rel", "author": ["Abhik Roychoudhury"], "ref": ["Abhik Roychoudhury - new related research"]}
{"title": "IoTtracer: greybox fuzzing for Linux-based IoT devices with low-cost coverage tracing", "first_label": ["Fuzzing"], "second_label": [], "data": "C Wang, J Peng, H Qiu, J Zhu- The Computer Journal, 2026\nFuzzing, especially coverage-guided greybox (CG) fuzzing, has been demonstrated \nto be effective in discovering software security vulnerabilities. Code coverage \nachieved through instrumentation plays a vital role in this. However, closed-source", "link": "https://scholar.google.com/scholar_url?url=https://academic.oup.com/comjnl/advance-article/doi/10.1093/comjnl/bxaf147/8437980&hl=en&sa=X&d=18033898972224357377&ei=OJZ2adH-EdaOieoPnNOJuQQ&scisig=AHkA5jSHUcW085SWo3hPtjuzc4kk&oi=scholaralrt&hist=ylyK0_8AAAAJ:12723761785867032729:AHkA5jSbMrs1rwdzDT4Fnpwpokkm&html=&pos=1&folt=rel", "author": ["Abhik Roychoudhury"], "ref": ["Abhik Roychoudhury - new related research"]}
{"title": "Mutants Will Tell: Statistical Mutation-based Multiple Fault Localization for Deep Learning Programs", "first_label": ["Fault Localization"], "second_label": ["Localization"], "data": "H Xie, Z Deng, Y Lei, M Li, M Yan, D Lo- IEEE Transactions on Software Engineering, 2026\nAs deep learning (DL) systems are increasingly deployed in safety-critical domains, \neg, intelligent planning and autonomous driving, localizing faults that occur in such \nsystems becomes indispensable. Inevitably, DL systems also suffer from faults like\n \nThis message was sent by Google Scholar because you're following new articles related to research by \nAbhik Roychoudhury\n.\nList alerts\nCancel alert", "link": "https://scholar.google.com/scholar_url?url=https://ieeexplore.ieee.org/abstract/document/11359137/&hl=en&sa=X&d=2063265024169399023&ei=OJZ2adH-EdaOieoPnNOJuQQ&scisig=AHkA5jT2TwJQyPtv5FBUZHvuzpQe&oi=scholaralrt&hist=ylyK0_8AAAAJ:12723761785867032729:AHkA5jSbMrs1rwdzDT4Fnpwpokkm&html=&pos=3&folt=rel", "author": ["Abhik Roychoudhury"], "ref": ["Abhik Roychoudhury - new related research", "Quang-Cuong Bui - new related research"]}
{"title": "Understanding Docker Refactorings: Expanded Taxonomy, Operational Trade-offs, and Role-Aware Recommendations", "first_label": [], "second_label": [], "data": "E Ksontini, T Ferreira, R Khalsi, W Kessentini- IEEE Transactions on Software, 2025\nDocker-based software containerization has recently emerged as the de facto \nstandard for delivering reusable software artifacts. With a plethora of publicly \navailable Docker images, developers can easily build and deploy their applications", "link": "https://scholar.google.com/scholar_url?url=https://ieeexplore.ieee.org/abstract/document/11318134/&hl=en&sa=X&d=6087250125679730610&ei=OJZ2aeLbBKbD6rQP1_TouQg&scisig=AHkA5jTSIOl9P1m2M2-l1FyHshW4&oi=scholaralrt&hist=ylyK0_8AAAAJ:11088443020050739259:AHkA5jSeuOKYynFrWQlTIputHXvo&html=&pos=0&folt=rel", "author": ["Quang-Cuong Bui"], "ref": ["Quang-Cuong Bui - new related research"]}
{"title": "LLM", "first_label": ["LLM"], "second_label": [], "data": "- , 2025\nLLM      ,      \n           \n.           \n        , RAG  RACG  \n            \n    .       \nCites: Stealthy backdoor attack for code models  \n \nThis message was sent by Google Scholar because you're following new citations to articles written by \nHong Jin Kang\n.\nList alerts\nCancel alert", "link": "https://scholar.google.com/scholar_url?url=https://www.dbpia.co.kr/Journal/articleDetail%3FnodeId%3DNODE12547753&hl=en&sa=X&d=4299955371938901272&ei=ukR1afzqKPStieoP-8T7kA0&scisig=AHkA5jQJ48VU-ol22PJXcyHnn0We&oi=scholaralrt&hist=ylyK0_8AAAAJ:4851239734318863641:AHkA5jRxGJtM2gcBbnf89hFHeGJv&html=&pos=0&folt=cit", "author": ["Hong Jin Kang"], "ref": ["1 new citation to articles by Hong Jin Kang"]}
{"title": "VulnResolver: A Hybrid Agent Framework for LLM-Based Automated Vulnerability Issue Resolution", "first_label": ["Vulnerabilities", "LLM"], "second_label": ["Agent"], "data": "M Zhang, X Wang, J Zhang, X Meng, J Zhang, C Hu- arXiv preprint arXiv:2601.13933, 2026\nAs software systems grow in complexity, security vulnerabilities have become \nincreasingly prevalent, posing serious risks and economic costs. Although \nautomated detection tools such as fuzzers have advanced considerably, effective", "link": "https://scholar.google.com/scholar_url?url=https://arxiv.org/pdf/2601.13933&hl=en&sa=X&d=8029152925504295835&ei=u0R1ae63DNDQ6rQPx77Y4A8&scisig=AHkA5jQmsTzVGlQkTvR3J_8xTI44&oi=scholaralrt&hist=ylyK0_8AAAAJ:5865787842749446205:AHkA5jRdC8MKBKkDX_XYP68jZAAq&html=&pos=0&folt=rel", "author": ["David Lo"], "ref": ["David Lo - new related research", "8 new citations to articles by Xin ZHOU", "Bach Le - new related research", "Quang-Cuong Bui - new related research", "6 new citations to articles by Abhik Roychoudhury", "Thanh Le-Cong - new related research"]}
{"title": "Making large language models reliable data science programming copilots for biomedical research", "first_label": ["LLM"], "second_label": ["Search"], "data": "Z Wang, B Danek, Z Yang, Z Chen, J Sun- Nature Biomedical Engineering, 2026\nLarge language models (LLMs) can generate impressive data visualizations from \nsimple requests, yet their accuracy remains underexplored. Here we present a \nbenchmark of 293 coding tasks derived from 39 studies across 7 biomedical", "link": "https://scholar.google.com/scholar_url?url=https://www.nature.com/articles/s41551-025-01587-2&hl=en&sa=X&d=16238829585703993285&ei=u0R1ae63DNDQ6rQPx77Y4A8&scisig=AHkA5jSZFXQaE3_HXe-kYdhNiRRa&oi=scholaralrt&hist=ylyK0_8AAAAJ:5865787842749446205:AHkA5jRdC8MKBKkDX_XYP68jZAAq&html=&pos=1&folt=rel", "author": ["David Lo"], "ref": ["David Lo - new related research"]}
{"title": "Guidelines to Prompt Large Language Models for Code Generation: An Empirical Characterization", "first_label": ["LLM", "Code"], "second_label": ["Generation"], "data": "A Midolo, A Giagnorio, F Zampetti, R Tufano, G Bavota- arXiv preprint arXiv, 2026\nLarge Language Models (LLMs) are nowadays extensively used for various types of \nsoftware engineering tasks, primarily code generation. Previous research has shown \nhow suitable prompt engineering could help developers in improving their code", "link": "https://scholar.google.com/scholar_url?url=https://arxiv.org/pdf/2601.13118&hl=en&sa=X&d=3872723702867573145&ei=u0R1ae63DNDQ6rQPx77Y4A8&scisig=AHkA5jTVeNrtrIVS16PbNjmm8A_n&oi=scholaralrt&hist=ylyK0_8AAAAJ:5865787842749446205:AHkA5jRdC8MKBKkDX_XYP68jZAAq&html=&pos=2&folt=rel", "author": ["David Lo"], "ref": ["David Lo - new related research", "Hong Jin Kang - new related research", "8 new citations to articles by Xin ZHOU", "Xin ZHOU - new related research", "Thanh Le-Cong - new related research"]}
{"title": "Parameter-Efficient Multi-Task Fine-Tuning in Code-Related Tasks", "first_label": ["Code"], "second_label": [], "data": "MZ Haque, S Afrin, A Mastropaolo- arXiv preprint arXiv:2601.15094, 2026\nLarge Language Models (LLMs) have proven highly effective in automating software \nengineering tasks, bridging natural language and code semantics to achieve notable \nresults in code generation and summarization. However, their scale incurs", "link": "https://scholar.google.com/scholar_url?url=https://arxiv.org/pdf/2601.15094&hl=en&sa=X&d=8593991838871028005&ei=u0R1ae63DNDQ6rQPx77Y4A8&scisig=AHkA5jQpbz7hVbq2Ge1aNRMeVipU&oi=scholaralrt&hist=ylyK0_8AAAAJ:5865787842749446205:AHkA5jRdC8MKBKkDX_XYP68jZAAq&html=&pos=3&folt=rel", "author": ["David Lo"], "ref": ["David Lo - new related research", "3 new citations to articles by Thanh Le-Cong", "8 new citations to articles by Xin ZHOU", "Thanh Le-Cong - new related research", "9 new citations to articles by Bach Le"]}
{"title": "SWE-Tester: Training Open-Source LLMs for Issue Reproduction in Real-World Repositories", "first_label": ["LLM", "Software Testing"], "second_label": [], "data": "AB Soni, R Ghosh, V Bhargava, V Chen, D Dutta- arXiv preprint arXiv:2601.13713, 2026\nSoftware testing is crucial for ensuring the correctness and reliability of software \nsystems. Automated generation of issue reproduction tests from natural language \nissue descriptions enhances developer productivity by simplifying root cause", "link": "https://scholar.google.com/scholar_url?url=https://arxiv.org/pdf/2601.13713&hl=en&sa=X&d=16701972582029412551&ei=u0R1ae63DNDQ6rQPx77Y4A8&scisig=AHkA5jTREHP0q-iNPQsClRspJUBY&oi=scholaralrt&hist=ylyK0_8AAAAJ:5865787842749446205:AHkA5jRdC8MKBKkDX_XYP68jZAAq&html=&pos=4&folt=rel", "author": ["David Lo"], "ref": ["David Lo - new related research", "Abhik Roychoudhury - new related research"]}
{"title": "Environment-Aware Code Generation: How far are We?", "first_label": ["Code"], "second_label": ["Generation"], "data": "T Wu, R Chen, W Du, S Ma, G Qi, Z Xing, S Khadivi- arXiv preprint arXiv, 2026\nRecent progress in large language models (LLMs) has improved code generation, \nbut most evaluations still test isolated, small-scale code (eg, a single function) under \ndefault or unspecified software environments. As a result, it is unclear whether LLMs", "link": "https://scholar.google.com/scholar_url?url=https://arxiv.org/pdf/2601.12262&hl=en&sa=X&d=14077883927763081949&ei=u0R1ae63DNDQ6rQPx77Y4A8&scisig=AHkA5jS0xonGnPZlI6cupetPI-LQ&oi=scholaralrt&hist=ylyK0_8AAAAJ:5865787842749446205:AHkA5jRdC8MKBKkDX_XYP68jZAAq&html=&pos=5&folt=rel", "author": ["David Lo"], "ref": ["David Lo - new related research", "Xin ZHOU - new related research"]}
{"title": "A Benchmark for Language Models in Real-World System Building", "first_label": ["LLM"], "second_label": [], "data": "W Jin, C Zhao, Z Huang, C Zhang, Q Lin, C Bansal- arXiv preprint arXiv, 2026\nDuring migration across instruction set architectures (ISAs), software package build \nrepair is a critical task for ensuring the reliability of software deployment and the \nstability of modern operating systems. While Large Language Models (LLMs) have", "link": "https://scholar.google.com/scholar_url?url=https://arxiv.org/pdf/2601.12927&hl=en&sa=X&d=10037879495575465280&ei=u0R1ae63DNDQ6rQPx77Y4A8&scisig=AHkA5jQeIubnmhcW3KaIM8xxFj4x&oi=scholaralrt&hist=ylyK0_8AAAAJ:5865787842749446205:AHkA5jRdC8MKBKkDX_XYP68jZAAq&html=&pos=6&folt=rel", "author": ["David Lo"], "ref": ["David Lo - new related research", "Hong Jin Kang - new related research", "Bach Le - new related research", "Xin ZHOU - new related research", "Thanh Le-Cong - new related research"]}
{"title": "From LLMs to Agents in Programming: The Impact of Providing an LLM with a Compiler", "first_label": ["LLM"], "second_label": ["Agent"], "data": "V Kjellberg, M Staron, F Fotrousi- arXiv preprint arXiv:2601.12146, 2026\nLarge Language Models have demonstrated a remarkable capability in natural \nlanguage and program generation and software development. However, the source \ncode generated by the LLMs does not always meet quality requirements and may fail", "link": "https://scholar.google.com/scholar_url?url=https://arxiv.org/pdf/2601.12146&hl=en&sa=X&d=11329828215171022159&ei=u0R1ae63DNDQ6rQPx77Y4A8&scisig=AHkA5jQUd6mj6Dh0AMGpbha_Vfxk&oi=scholaralrt&hist=ylyK0_8AAAAJ:5865787842749446205:AHkA5jRdC8MKBKkDX_XYP68jZAAq&html=&pos=7&folt=rel", "author": ["David Lo"], "ref": ["David Lo - new related research", "Hong Jin Kang - new related research", "Xin ZHOU - new related research", "Thanh Le-Cong - new related research"]}
{"title": "Understanding Usefulness in Developer Explanations on Stack Overflow", "first_label": [], "second_label": [], "data": "M Obaidi, K Qengaj, H Deters, J Droste, M Herrmann- arXiv preprint arXiv, 2026\nExplanations are essential in software engineering (SE) and requirements \ncommunication, helping stakeholders clarify ambiguities, justify design choices, and \nbuild shared understanding. Online Q&A forums such as Stack Overflow provide", "link": "https://scholar.google.com/scholar_url?url=https://arxiv.org/pdf/2601.14865&hl=en&sa=X&d=14551907177606904736&ei=u0R1ae63DNDQ6rQPx77Y4A8&scisig=AHkA5jSYYKgY_25jIQAy-anWmd4y&oi=scholaralrt&hist=ylyK0_8AAAAJ:5865787842749446205:AHkA5jRdC8MKBKkDX_XYP68jZAAq&html=&pos=8&folt=rel", "author": ["David Lo"], "ref": ["David Lo - new related research"]}
{"title": "Where Do AI Coding Agents Fail? An Empirical Study of Failed Agentic Pull Requests in GitHub", "first_label": [], "second_label": ["Agent"], "data": "R Ehsani, S Pathak, S Rawal, AA Mujahid, MM Imran- arXiv preprint arXiv, 2026\nAI coding agents are now submitting pull requests (PRs) to software projects, acting \nnot just as assistants but as autonomous contributors. As these agentic contributions \nare rapidly increasing across real repositories, little is known about how they behave\n \nThis message was sent by Google Scholar because you're following new articles related to research by \nDavid Lo\n.\nList alerts\nCancel alert", "link": "https://scholar.google.com/scholar_url?url=https://arxiv.org/pdf/2601.15195&hl=en&sa=X&d=3409390082403867972&ei=u0R1ae63DNDQ6rQPx77Y4A8&scisig=AHkA5jTbkh5ql0tTRKOUzSaHFpnc&oi=scholaralrt&hist=ylyK0_8AAAAJ:5865787842749446205:AHkA5jRdC8MKBKkDX_XYP68jZAAq&html=&pos=9&folt=rel", "author": ["David Lo"], "ref": ["David Lo - new related research"]}
{"title": "Synthesizing inline security monitors for ICS using Generative AI and FormalBench", "first_label": [], "second_label": [], "data": "GE Raptis, MT Khan, C Koulamas, D Serpanos- 202551st Annual Conference of the, 2025\nIndustrial Control Systems (ICS) increasingly face cybersecurity threats due to their \ndistributed architecture and critical role in infrastructure operations. We adopt inline \nsecurity monitoring as a practical run-time verification strategy to address these risks. \nHowever, authoring formal specifications remains time-consuming and error-prone, \nrequiring deep domain expertise. In this paper, we explore how large language \nmodels (LLMs) can support the synthesis of inline security monitors by generating\nCites: Can LLMs Reason About Program Semantics? A Comprehensive", "link": "https://scholar.google.com/scholar_url?url=https://ieeexplore.ieee.org/abstract/document/11221437/&hl=en&sa=X&d=4986496400592953618&ei=uUR1aYvbHuu7ieoPncyzoAs&scisig=AHkA5jSv0VI5Sd1XOOFeAkHXYqAO&oi=scholaralrt&hist=ylyK0_8AAAAJ:1164437029242115036:AHkA5jSL8vAdmWJSszVpmQWryrel&html=&pos=0&folt=cit", "author": ["Thanh Le-Cong"], "ref": ["3 new citations to articles by Thanh Le-Cong", "9 new citations to articles by Bach Le"]}
{"title": "Catching common vulnerabilities with code language models", "first_label": ["Vulnerabilities", "LLM", "Code"], "second_label": ["Detection"], "data": "S Al Atiiq, C Gehrmann, K Khalil, K Dahln- 2025 IEEE Secure Development, 2025\nCode Language Model (code-LM)-based vulnerability detection for C/C++ faces a \nsubstantial challenge. Previous research has shown that even though it is better than \nany prior machine learning approach, it still struggles to generalize well, as shown by \nthe low F1 score. Prior works treated the problem as a binary classification: either \nvulnerable or non-vulnerable. Looking deeper at the various vulnerability types, we \nsee that this oversimplifies the problem, as different vulnerabilities have different\nCites: Comparison of static application security testing tools and large", "link": "https://scholar.google.com/scholar_url?url=https://lup.lub.lu.se/record/4a13fc00-b39b-4ac7-8940-4fa571d55e8d&hl=en&sa=X&d=189082203538347483&ei=uUR1aYvbHuu7ieoPncyzoAs&scisig=AHkA5jTjPUaX2L9iudiwes9cnfeR&oi=scholaralrt&hist=ylyK0_8AAAAJ:1164437029242115036:AHkA5jSL8vAdmWJSszVpmQWryrel&html=&pos=1&folt=cit", "author": ["Thanh Le-Cong"], "ref": ["3 new citations to articles by Thanh Le-Cong", "8 new citations to articles by Xin ZHOU", "9 new citations to articles by Bach Le"]}
{"title": "Discovering 100+ Compiler Defects in 72 Hours via LLM-Driven Semantic Logic Recomposition", "first_label": ["LLM", "Software Defect"], "second_label": [], "data": "X He, Y Chen, H Wu, J Zhang, Z Wang, L Chen, J Peng- arXiv preprint arXiv, 2026\nCompilers constitute the foundational root-of-trust in software supply chains; \nhowever, their immense complexity inevitably conceals critical defects. Recent \nresearch has attempted to leverage historical bugs to design new mutation operators", "link": "https://scholar.google.com/scholar_url?url=https://arxiv.org/pdf/2601.12360&hl=en&sa=X&d=13422472677440949050&ei=vER1aaeDMNaOieoPnNOJuQQ&scisig=AHkA5jTh54bePNoEQti1t4QZbrVO&oi=scholaralrt&hist=ylyK0_8AAAAJ:17903213248891513419:AHkA5jQzY4yxbL7oubxUcSYtq2gm&html=&pos=0&folt=rel", "author": ["Hong Jin Kang"], "ref": ["Hong Jin Kang - new related research", "Thanh Le-Cong - new related research"]}
{"title": "Pushing the Limit of Language-Agnostic Program Reduction", "first_label": [], "second_label": [], "data": "Z Xu - 2026\nProgram reduction is a widely used technique for testing and debugging language \nprocessors. Given a program that triggers a bug in a language processor, program \nreduction searches for a canonical and minimal program that triggers the same bug", "link": "https://scholar.google.com/scholar_url?url=https://uwspace.uwaterloo.ca/bitstreams/3df05513-7b38-4bd2-b5e3-2e806b340279/download&hl=en&sa=X&d=9967974503509070340&ei=vER1aaeDMNaOieoPnNOJuQQ&scisig=AHkA5jQjOARKpYMrHE-pvAMTG7Hl&oi=scholaralrt&hist=ylyK0_8AAAAJ:17903213248891513419:AHkA5jQzY4yxbL7oubxUcSYtq2gm&html=&pos=4&folt=rel", "author": ["Hong Jin Kang"], "ref": ["Hong Jin Kang - new related research"]}
{"title": "Promises and Perils of LLM-and Agent-Generated Code", "first_label": ["LLM", "Code"], "second_label": ["Agent"], "data": "PT Devanbu- Computer, 2025\nThis article draws attention to the fact that, traditionally, software maintenance costs \nhave strongly dominated initial development costs, and calls for more in-depth, \nfocused, specialized studies of the actual impacts of large language model-and", "link": "https://scholar.google.com/scholar_url?url=https://ieeexplore.ieee.org/iel8/2/11320986/11321004.pdf&hl=en&sa=X&d=6472013210972044478&ei=vER1aaeDMNaOieoPnNOJuQQ&scisig=AHkA5jQ1KIijEq81L6zemz59db_g&oi=scholaralrt&hist=ylyK0_8AAAAJ:17903213248891513419:AHkA5jQzY4yxbL7oubxUcSYtq2gm&html=&pos=5&folt=rel", "author": ["Hong Jin Kang"], "ref": ["Hong Jin Kang - new related research", "Xin ZHOU - new related research", "Thanh Le-Cong - new related research"]}
{"title": "Testing Deep Learning Libraries via Neurosymbolic Constraint Learning", "first_label": ["Software Testing"], "second_label": [], "data": "MMA Naziri, S Kim, FA Qin, S Dutta, M d'Amorim - 2026\nDeep Learning (DL) libraries (eg, Pytorch) are popular in the development of AI \napplications. These libraries are complex and contain bugs. Researchers have \nproposed various bug-finding techniques for such libraries. Yet, there is much room\n \nThis message was sent by Google Scholar because you're following new articles related to research by \nHong Jin Kang\n.\nList alerts\nCancel alert", "link": "https://scholar.google.com/scholar_url?url=https://damorim.github.io/publications/Naziri_ETAL_ICSE26_1.pdf&hl=en&sa=X&d=10511060854486095385&ei=vER1aaeDMNaOieoPnNOJuQQ&scisig=AHkA5jRb7VVlSpSUk6qQ3KXbx_Rz&oi=scholaralrt&hist=ylyK0_8AAAAJ:17903213248891513419:AHkA5jQzY4yxbL7oubxUcSYtq2gm&html=&pos=6&folt=rel", "author": ["Hong Jin Kang"], "ref": ["Hong Jin Kang - new related research"]}
{"title": "Variability-Aware Fuzzing", "first_label": ["Fuzzing"], "second_label": [], "data": "MT Ahmed, A Dev, S Wei - 2026\nVariability-Aware Fuzzing Page 1 Variability-Aware Fuzzing Meah Tahmeed Ahmed \n\r\nmeah.ahmed@utdallas.edu Computer Science Department The University of Texas at \n\r\nDallas Richardson, USA Arnab Dev arnab.dev@utdallas.edu Computer Science", "link": "https://scholar.google.com/scholar_url?url=https://chaoticcross12.github.io/papers/Variability-Aware%2520Fuzzing.pdf&hl=en&sa=X&d=11468496584384211109&ei=u0R1aaHRN6Oi6rQPoMCXoAE&scisig=AHkA5jQ6epf2pmzVo0_-BtSQWZSQ&oi=scholaralrt&hist=ylyK0_8AAAAJ:12723761785867032729:AHkA5jSbMrs1rwdzDT4Fnpwpokkm&html=&pos=1&folt=rel", "author": ["Abhik Roychoudhury"], "ref": ["Abhik Roychoudhury - new related research"]}
{"title": "SimFuzz: Similarity-guided Block-level Mutation for RISC-V Processor Fuzzing", "first_label": ["Fuzzing"], "second_label": [], "data": "H Lyu, J Wu, X Ling, Y Zhong, Z Li, T Luo- arXiv preprint arXiv:2601.11838, 2026\nThe Instruction Set Architecture (ISA) defines processor operations and serves as the \ninterface between hardware and software. As an open ISA, RISC-V lowers the \nbarriers to processor design and encourages widespread adoption, but also exposes", "link": "https://scholar.google.com/scholar_url?url=https://arxiv.org/pdf/2601.11838&hl=en&sa=X&d=5393634437643820099&ei=u0R1aaHRN6Oi6rQPoMCXoAE&scisig=AHkA5jRe52tve3frf6oxpgWxclTh&oi=scholaralrt&hist=ylyK0_8AAAAJ:12723761785867032729:AHkA5jSbMrs1rwdzDT4Fnpwpokkm&html=&pos=2&folt=rel", "author": ["Abhik Roychoudhury"], "ref": ["Abhik Roychoudhury - new related research"]}
{"title": "Android malware detection by using graph optimization of static features based on pre-trained language models", "first_label": ["LLM"], "second_label": ["Detection", "Graph"], "data": "NH Khoa, DM Trung, DT Dat, PT Duy, VH Pham- Information and Software, 2026\nAbstract Context: The Android platform is the dominant mobile operating system, \nmaking it a prime target for malware attacks. The increasing complexity of Android \nmalware necessitates advanced detection methods that integrate modern machine\n \nThis message was sent by Google Scholar because you're following new articles related to research by \nAbhik Roychoudhury\n.\nList alerts\nCancel alert", "link": "https://scholar.google.com/scholar_url?url=https://www.sciencedirect.com/science/article/pii/S0950584926000017&hl=en&sa=X&d=13701477671695544106&ei=u0R1aaHRN6Oi6rQPoMCXoAE&scisig=AHkA5jSwEl7Xu0SsnRRL1n0cn1kU&oi=scholaralrt&hist=ylyK0_8AAAAJ:12723761785867032729:AHkA5jSbMrs1rwdzDT4Fnpwpokkm&html=&pos=3&folt=rel", "author": ["Abhik Roychoudhury"], "ref": ["Abhik Roychoudhury - new related research"]}
{"title": "Advances and Frontiers of LLM-based Issue Resolution in Software Engineering: A Comprehensive Survey", "first_label": ["LLM"], "second_label": [], "data": "C Li, L Guo, Y Wang, D Guo, W Tao, Z Shan, M Liu- arXiv preprint arXiv, 2026\nIssue resolution, a complex Software Engineering (SWE) task integral to real-world \ndevelopment, has emerged as a compelling challenge for artificial intelligence. The \nestablishment of benchmarks like SWE-bench revealed this task as profoundly \ndifficult for large language models, thereby significantly accelerating the evolution of \nautonomous coding agents. This paper presents a systematic survey of this \nemerging domain. We begin by examining data construction pipelines, covering\nCites: Bridging Bug Localization and Issue Fixing: A Hierarchical", "link": "https://scholar.google.com/scholar_url?url=https://arxiv.org/pdf/2601.11655&hl=en&sa=X&d=3179145801309078351&ei=vER1ac-HFt_YieoP1b6liQE&scisig=AHkA5jQCnDLpwKm9zc72_J6Wegk0&oi=scholaralrt&hist=ylyK0_8AAAAJ:15035864585353249078:AHkA5jQsJ3NDDWezXcIZ7k5eS-ud&html=&pos=0&folt=cit", "author": ["Xin ZHOU"], "ref": ["8 new citations to articles by Xin ZHOU", "6 new citations to articles by Abhik Roychoudhury", "9 new citations to articles by Bach Le"]}
{"title": "CMind: An AI Agent for Localizing C Memory Bugs", "first_label": ["Bug"], "second_label": ["Agent"], "data": "CY Su, C McMillan- arXiv preprint arXiv:2601.14434, 2026\nThis demonstration paper presents CMind, an artificial intelligence agent for \nlocalizing C memory bugs. The novel aspect to CMind is that it follows steps that we \nobserved human programmers perform during empirical study of those programmers \nfinding memory bugs in C programs. The input to the tool is a C program's source \ncode and a bug report describing the problem. The output is the tool's hypothesis \nabout the reason for the bug and its location. CMind reads the bug report to find\nCites: Bridging Bug Localization and Issue Fixing: A Hierarchical", "link": "https://scholar.google.com/scholar_url?url=https://arxiv.org/pdf/2601.14434&hl=en&sa=X&d=3751881626722955768&ei=vER1ac-HFt_YieoP1b6liQE&scisig=AHkA5jQ23k1qAWNQImRAk-3g-p80&oi=scholaralrt&hist=ylyK0_8AAAAJ:15035864585353249078:AHkA5jQsJ3NDDWezXcIZ7k5eS-ud&html=&pos=1&folt=cit", "author": ["Xin ZHOU"], "ref": ["8 new citations to articles by Xin ZHOU", "9 new citations to articles by Bach Le"]}
{"title": "Shield Broken: Black-Box Adversarial Attacks on LLM-Based Vulnerability Detectors", "first_label": ["Vulnerabilities", "LLM"], "second_label": ["Detection"], "data": "Y Jiang, S Huang, C Treude, X Su, T Wang- IEEE Transactions on Software, 2025\nVulnerability detection is critical for ensuring software security. Although deep \nlearning (DL) methods, particularly those employing large language models (LLMs), \nhave shown strong performance in automating vulnerability identification, they \nremain susceptible to adversarial examples, which are carefully crafted inputs with \nsubtle perturbations designed to evade detection. Existing adversarial attack \nmethods often require access to model architectures or confidence scores, making\nCites: Large language model for vulnerability detection: Emerging results", "link": "https://scholar.google.com/scholar_url?url=https://ieeexplore.ieee.org/iel8/32/11346545/11271845.pdf&hl=en&sa=X&d=12888382173374325332&ei=vER1ac-HFt_YieoP1b6liQE&scisig=AHkA5jRH4jX0cpSrPBRU2VepGR3D&oi=scholaralrt&hist=ylyK0_8AAAAJ:15035864585353249078:AHkA5jQsJ3NDDWezXcIZ7k5eS-ud&html=&pos=2&folt=cit", "author": ["Xin ZHOU"], "ref": ["8 new citations to articles by Xin ZHOU", "9 new citations to articles by Bach Le"]}
{"title": "Impact of identifier normalization on vulnerability detection techniques", "first_label": ["Vulnerabilities"], "second_label": ["Detection"], "data": "T Hinrichs, T Diercks, R Scandariato- IEEE International Conference on Software, 2025\nThis study examines the impact of identifier normalization on software vulnerability \ndetection using three approaches: static application security testing (SAST), \nspecialized machine learning (ML) models, and Large Language Models (LLM). \nUsing the BigVul dataset of vulnerabilities in C/C++ projects, the research evaluates \nthe performance of these methods under normalized (generalized \nvariables/functions names) and their original conditions. SAST tools such as\nCites: Large language model for vulnerability detection: Emerging results  \n \nThis message was sent by Google Scholar because you're following new citations to articles written by \nXin ZHOU\n.\nList alerts\nCancel alert", "link": "https://scholar.google.com/scholar_url?url=https://tore.tuhh.de/entities/publication/190027eb-ee13-4d39-927f-192d3854a968&hl=en&sa=X&d=14035095563255972296&ei=vER1ac-HFt_YieoP1b6liQE&scisig=AHkA5jQK1VlfpkfvPkWnO4Q7piin&oi=scholaralrt&hist=ylyK0_8AAAAJ:15035864585353249078:AHkA5jQsJ3NDDWezXcIZ7k5eS-ud&html=&pos=7&folt=cit", "author": ["Xin ZHOU"], "ref": ["8 new citations to articles by Xin ZHOU"]}
{"title": "When Agents Fail: A Comprehensive Study of Bugs in LLM Agents with Automated Labeling", "first_label": ["LLM", "Bug"], "second_label": ["Agent"], "data": "N Islam, RS Ayon, DG Thomas, S Ahmed, M Wardat- arXiv preprint arXiv:2601.15232, 2026\nLarge Language Models (LLMs) have revolutionized intelligent application \ndevelopment. While standalone LLMs cannot perform any actions, LLM agents \naddress the limitation by integrating tools. However, debugging LLM agents is", "link": "https://scholar.google.com/scholar_url?url=https://arxiv.org/pdf/2601.15232&hl=en&sa=X&d=3478988133296608347&ei=ukR1ae2-Bsm4ieoPof3esQc&scisig=AHkA5jTiTWCRX7eNkrmmPIiRnSYO&oi=scholaralrt&hist=ylyK0_8AAAAJ:4328508672846969495:AHkA5jSuCQsu1z5iWz_gbATz5xCY&html=&pos=0&folt=rel", "author": ["Bach Le"], "ref": ["Bach Le - new related research", "6 new citations to articles by Abhik Roychoudhury", "Thanh Le-Cong - new related research"]}
{"title": "DevBench: A Realistic, Developer-Informed Benchmark for Code Generation Models", "first_label": ["Code"], "second_label": ["Generation"], "data": "PA Golnari, A Kumarappan, W Wen, X Liu, G Ryan- arXiv preprint arXiv, 2026\nDevBench is a telemetry-driven benchmark designed to evaluate Large Language \nModels (LLMs) on realistic code completion tasks. It includes 1,800 evaluation \ninstances across six programming languages and six task categories derived from", "link": "https://scholar.google.com/scholar_url?url=https://arxiv.org/pdf/2601.11895&hl=en&sa=X&d=2182361394437075397&ei=vER1ad6KI6C16rQPqaeYsAc&scisig=AHkA5jTru1Nc7WLtdLbIPUa31I-3&oi=scholaralrt&hist=ylyK0_8AAAAJ:16898579961534012346:AHkA5jSEB1eKt2tiwZ0Di_PsePOh&html=&pos=0&folt=rel", "author": ["Xin ZHOU"], "ref": ["Xin ZHOU - new related research"]}
{"title": "SpecMap: Hierarchical LLM Agent for Datasheet-to-Code Traceability Link Recovery in Systems Engineering", "first_label": ["LLM", "Code"], "second_label": ["Agent"], "data": "V Nipane, P Agrawal, A Singh- arXiv preprint arXiv:2601.11688, 2026\nEstablishing precise traceability between embedded systems datasheets and their \ncorresponding code implementations remains a fundamental challenge in systems \nengineering, particularly for low-level software where manual mapping between", "link": "https://scholar.google.com/scholar_url?url=https://arxiv.org/pdf/2601.11688&hl=en&sa=X&d=261369976705707757&ei=vER1ad6KI6C16rQPqaeYsAc&scisig=AHkA5jR-aNRytQwJSoDesdmFXwDJ&oi=scholaralrt&hist=ylyK0_8AAAAJ:16898579961534012346:AHkA5jSEB1eKt2tiwZ0Di_PsePOh&html=&pos=1&folt=rel", "author": ["Xin ZHOU"], "ref": ["Xin ZHOU - new related research"]}
{"title": "RepoGenesis: Benchmarking End-to-End Microservice Generation from Readme to Repository", "first_label": [], "second_label": ["Generation"], "data": "Z Peng, X Yin, P Zhao, F Yang, L Wang, R Jia, X Chen- arXiv preprint arXiv, 2026\nLarge language models and agents have achieved remarkable progress in code \ngeneration. However, existing benchmarks focus on isolated function/class-level \ngeneration (eg, ClassEval) or modifications to existing codebases (eg, SWE-Bench)", "link": "https://scholar.google.com/scholar_url?url=https://arxiv.org/pdf/2601.13943&hl=en&sa=X&d=2672777917138111134&ei=vER1ad6KI6C16rQPqaeYsAc&scisig=AHkA5jQOcyxQ0fZkKv89XRIX6f2d&oi=scholaralrt&hist=ylyK0_8AAAAJ:16898579961534012346:AHkA5jSEB1eKt2tiwZ0Di_PsePOh&html=&pos=2&folt=rel", "author": ["Xin ZHOU"], "ref": ["Xin ZHOU - new related research"]}
{"title": "HELIOS: Hierarchical Graph Abstraction for Structure-Aware LLM Decompilation", "first_label": ["LLM"], "second_label": ["Graph"], "data": "YG Achamyeleh, H Thomare, MAA Faruque- arXiv preprint arXiv:2601.14598, 2026\nLarge language models (LLMs) have recently been applied to binary decompilation, \nyet they still treat code as plain text and ignore the graphs that govern program \ncontrol flow. This limitation often yields syntactically fragile and logically inconsistent", "link": "https://scholar.google.com/scholar_url?url=https://arxiv.org/pdf/2601.14598&hl=en&sa=X&d=745765233789919454&ei=vER1ad6KI6C16rQPqaeYsAc&scisig=AHkA5jSiN-ErTyCBvDo_GjelNk_z&oi=scholaralrt&hist=ylyK0_8AAAAJ:16898579961534012346:AHkA5jSEB1eKt2tiwZ0Di_PsePOh&html=&pos=7&folt=rel", "author": ["Xin ZHOU"], "ref": ["Xin ZHOU - new related research"]}
{"title": "KOCO-BENCH: Can Large Language Models Leverage Domain Knowledge in Software Development?", "first_label": ["LLM"], "second_label": [], "data": "X Jiang, J Qian, X Shi, C Li, H Zhu, Z Wang, J Zhang- arXiv preprint arXiv, 2026\nLarge language models (LLMs) excel at general programming but struggle with \ndomain-specific software development, necessitating domain specialization methods \nfor LLMs to learn and utilize domain knowledge and data. However, existing domain\n \nThis message was sent by Google Scholar because you're following new articles related to research by \nXin ZHOU\n.\nList alerts\nCancel alert", "link": "https://scholar.google.com/scholar_url?url=https://arxiv.org/pdf/2601.13240&hl=en&sa=X&d=17439798551294395680&ei=vER1ad6KI6C16rQPqaeYsAc&scisig=AHkA5jTcbLk0pk14iuSNpR5_jbro&oi=scholaralrt&hist=ylyK0_8AAAAJ:16898579961534012346:AHkA5jSEB1eKt2tiwZ0Di_PsePOh&html=&pos=9&folt=rel", "author": ["Xin ZHOU"], "ref": ["Xin ZHOU - new related research"]}
{"title": "Docker does not Guarantee Reproducibility", "first_label": [], "second_label": [], "data": "J Malka, S Zacchiroli, T Zimmermann- arXiv preprint arXiv:2601.12811, 2026\nThe reproducibility of software environments is a critical concern in modern software \nengineering, with ramifications ranging from the effectiveness of collaboration \nworkflows to software supply chain security and scientific reproducibility", "link": "https://scholar.google.com/scholar_url?url=https://arxiv.org/pdf/2601.12811&hl=en&sa=X&d=6178893173224128909&ei=u0R1ab6lKcyQieoPxcX9yAo&scisig=AHkA5jT7Vgw6xydom5qERh7bP_9U&oi=scholaralrt&hist=ylyK0_8AAAAJ:11088443020050739259:AHkA5jSeuOKYynFrWQlTIputHXvo&html=&pos=1&folt=rel", "author": ["Quang-Cuong Bui"], "ref": ["Quang-Cuong Bui - new related research"]}
{"title": "Improving Smart Contract Vulnerability Detection with Correlation-Driven Semi-Supervised Learning", "first_label": ["Vulnerabilities", "Smart Contracts"], "second_label": ["Detection"], "data": "Y Chen, Z Sun, G Wang, D Hao- IEEE Transactions on Software Engineering, 2025\nDeep neural networks (DNNs) are one of the most effective methods available for \ndetecting smart contract vulner-abilities (SCVs). The performance of current DNN \napproaches relies heavily on a large number of training samples and labels. The", "link": "https://scholar.google.com/scholar_url?url=https://ieeexplore.ieee.org/abstract/document/11318074/&hl=en&sa=X&d=17723241473705166118&ei=u0R1ab6lKcyQieoPxcX9yAo&scisig=AHkA5jQUeHJiwd0OMpXqKVvVIqWk&oi=scholaralrt&hist=ylyK0_8AAAAJ:11088443020050739259:AHkA5jSeuOKYynFrWQlTIputHXvo&html=&pos=2&folt=rel", "author": ["Quang-Cuong Bui"], "ref": ["Quang-Cuong Bui - new related research"]}
{"title": "SAGA: Detecting Security Vulnerabilities Using Static Aspect Analysis", "first_label": ["Vulnerabilities"], "second_label": ["Detection"], "data": "Y Marquer, D Bianculli, LC Briand- arXiv preprint arXiv:2601.15154, 2026\nPython is one of the most popular programming languages; as such, projects written \nin Python involve an increasing number of diverse security vulnerabilities. However, \nexisting state-of-the-art analysis tools for Python only support a few vulnerability\n \nThis message was sent by Google Scholar because you're following new articles related to research by \nQuang-Cuong Bui\n.\nList alerts\nCancel alert", "link": "https://scholar.google.com/scholar_url?url=https://arxiv.org/pdf/2601.15154&hl=en&sa=X&d=12592293229971472295&ei=u0R1ab6lKcyQieoPxcX9yAo&scisig=AHkA5jRxQEZiFD35h3y-qj6MCiBP&oi=scholaralrt&hist=ylyK0_8AAAAJ:11088443020050739259:AHkA5jSeuOKYynFrWQlTIputHXvo&html=&pos=3&folt=rel", "author": ["Quang-Cuong Bui"], "ref": ["Quang-Cuong Bui - new related research"]}
{"title": "Improved Bug Localization with AI Agents Leveraging Hypothesis and Dynamic Cognition", "first_label": ["Bug"], "second_label": ["Agent", "Localization"], "data": "AM Samir, MM Rahman- arXiv preprint arXiv:2601.12522, 2026\nSoftware bugs cost technology providers (eg, AT&T) billions annually and cause \ndevelopers to spend roughly 50% of their time on bug resolution. Traditional \nmethods for bug localization often analyze the suspiciousness of code components \n(eg, methods, documents) in isolation, overlooking their connections with other \ncomponents in the codebase. Recent advances in Large Language Models (LLMs) \nand agentic AI techniques have shown strong potential for code understanding, but\nCites: AutoCodeRover: Autonomous program improvement", "link": "https://scholar.google.com/scholar_url?url=https://arxiv.org/pdf/2601.12522&hl=en&sa=X&d=17409506946595842194&ei=u0R1ac_LGsm4ieoPof3esQc&scisig=AHkA5jQzXy0afnY9iIiDFYIpYxMk&oi=scholaralrt&hist=ylyK0_8AAAAJ:10071049626428824134:AHkA5jQRfWoRNvJIMJ7ZeL1tZJbF&html=&pos=3&folt=cit", "author": ["Abhik Roychoudhury"], "ref": ["6 new citations to articles by Abhik Roychoudhury"]}
{"title": "Leveraging Mutation Analysis for LLM-based Repair of Quantum Programs", "first_label": ["LLM"], "second_label": ["Repair"], "data": "C Yoshida, Y Ishimoto, O Nourry, M Kondo- arXiv preprint arXiv, 2026\nIn recent years, Automated Program Repair (APR) techniques specifically designed \nfor quantum programs have been proposed. However, existing approaches often \nsuffer from low repair success rates or poor understandability of the generated \npatches. In this study, we construct a framework in which a large language model \n(LLM) generates code repairs along with a natural language explanation of the \napplied repairs. To investigate how the contextual information included in prompts\nCites: Automated Program Repair", "link": "https://scholar.google.com/scholar_url?url=https://arxiv.org/pdf/2601.12273&hl=en&sa=X&d=4300373795538029495&ei=u0R1ac_LGsm4ieoPof3esQc&scisig=AHkA5jRyo-obnAm-zUNeyoCXpS8r&oi=scholaralrt&hist=ylyK0_8AAAAJ:10071049626428824134:AHkA5jQRfWoRNvJIMJ7ZeL1tZJbF&html=&pos=4&folt=cit", "author": ["Abhik Roychoudhury"], "ref": ["6 new citations to articles by Abhik Roychoudhury"]}
{"title": "Path Reduction and Coverage Complexity for Fuzzing", "first_label": ["Fuzzing"], "second_label": [], "data": "Z Wang - 2026\nCoverage-guided fuzzing is one of the most effective approaches to automated \nsoftware testing, yet its performance depends critically on the coverage metric that \nguides input generation. It is widely assumed that finer metricsespecially path \ncoverage, which cap-tures complete control-flow informationshould lead to more \neffective fuzzing. However, practical realizations of path coverage have been limited \nto restricted forms due to path explosion. In this work, we introduce a path reduction\nCites: Directed greybox fuzzing  \n \nThis message was sent by Google Scholar because you're following new citations to articles written by \nAbhik Roychoudhury\n.\nList alerts\nCancel alert", "link": "https://scholar.google.com/scholar_url?url=https://uwspace.uwaterloo.ca/bitstreams/4298df08-089c-4c02-8032-9f98b1aee9db/download&hl=en&sa=X&d=10783329599307012971&ei=u0R1ac_LGsm4ieoPof3esQc&scisig=AHkA5jTWdfQHiexTWmKWzMHwLYdX&oi=scholaralrt&hist=ylyK0_8AAAAJ:10071049626428824134:AHkA5jQRfWoRNvJIMJ7ZeL1tZJbF&html=&pos=5&folt=cit", "author": ["Abhik Roychoudhury"], "ref": ["6 new citations to articles by Abhik Roychoudhury"]}
{"title": "A Blockchain-Oriented Software Engineering Architecture for Carbon Credit Certification Systems", "first_label": ["Blockchain"], "second_label": [], "data": "M Vaccargiu, A Ullah, P Gallo- arXiv preprint arXiv:2601.13772, 2026\nCarbon credit systems have emerged as a policy tool to incentivize emission \nreductions and support the transition to clean energy. Reliable carbon-credit \ncertification depends on mechanisms that connect actual, measured renewable-\nenergy production to verifiable emission-reduction records. Although blockchain and \nIoT technologies have been applied to emission monitoring and trading, existing \nwork offers limited support for certification processes, particularly for small and\nCites: Smart contract development: Challenges and opportunities", "link": "https://scholar.google.com/scholar_url?url=https://arxiv.org/pdf/2601.13772&hl=en&sa=X&d=17711383058108179338&ei=ukR1aYSBOfStieoP-8T7kA0&scisig=AHkA5jS4bVW96Rv80W7OAMBbtFBI&oi=scholaralrt&hist=ylyK0_8AAAAJ:4974034551180671527:AHkA5jSJKysCIe7aKJHkjio0etwZ&html=&pos=6&folt=cit", "author": ["Bach Le"], "ref": ["9 new citations to articles by Bach Le"]}
{"title": "Recommended Steps for Developing Optimized and Secure Smart Contracts", "first_label": ["Smart Contracts"], "second_label": [], "data": "M taka, S Risti, M Stefanovi, D Nikoli, D Stefanovi- 2025 33rd, 2025\nBlockchain technology and smart contracts are central to decentralized applications. \nOperating on blockchain introduces challenges in design, development, and \nexecution costs. On Ethereum, gas fees make optimization essential. This paper \nanalyzes common mistakes affecting gas consumption and outlines strategies to \nimprove efficiency. Using literature review and error systematization, key issues are \nidentified and practical steps proposed. These recommendations, grounded in\nCites: Smart contract development: Challenges and opportunities", "link": "https://scholar.google.com/scholar_url?url=https://ieeexplore.ieee.org/iel8/11314150/11314152/11314357.pdf&hl=en&sa=X&d=5525758029805672278&ei=ukR1aYSBOfStieoP-8T7kA0&scisig=AHkA5jSxSwx6yPvI0TLxr0SSvNE5&oi=scholaralrt&hist=ylyK0_8AAAAJ:4974034551180671527:AHkA5jSJKysCIe7aKJHkjio0etwZ&html=&pos=7&folt=cit", "author": ["Bach Le"], "ref": ["9 new citations to articles by Bach Le"]}
{"title": "Performance Analysis of Blockchain with Rollups", "first_label": ["Blockchain"], "second_label": [], "data": "Y Funahashi, T Phung-Duc- 2025 30th Asia-Pacific Conference on, 2025\nRecently, an increasing number of users are engag-ing in cryptocurrency \ntransactions, a trend expected to continue. Consequently, major blockchain \nplatforms, such as Bitcoin and Ethereum face scalability issues when the number of \ntransactions exceeds the system's processing capacity. While rollupsLayer 2 \nsolutionsoffer a promising approach to address this problem, their modeling and \nperformance evaluation remain insufficiently explored. In this study, we propose a\nCites: Smart contract development: Challenges and opportunities  \n \nThis message was sent by Google Scholar because you're following new citations to articles written by \nBach Le\n.\nList alerts\nCancel alert", "link": "https://scholar.google.com/scholar_url?url=https://ieeexplore.ieee.org/iel8/11278899/11279723/11279853.pdf&hl=en&sa=X&d=12466861069808622273&ei=ukR1aYSBOfStieoP-8T7kA0&scisig=AHkA5jRC2n9qSGBUpkqqUCe5BHTc&oi=scholaralrt&hist=ylyK0_8AAAAJ:4974034551180671527:AHkA5jSJKysCIe7aKJHkjio0etwZ&html=&pos=8&folt=cit", "author": ["Bach Le"], "ref": ["9 new citations to articles by Bach Le"]}
