{"title": "Fixing on the Fly", "first_label": [], "second_label": [], "data": "A erna\nI chose to pursue this Master's degree at TU Delft because it had been part of my \nplan since I left Moldova to study in the Netherlands, at a time when I had a limited \nunderstanding of computer science as a discipline. Even then, I believed that \nlearning to code would allow me to build concrete solutions to real problems. \nHowever, after completing my Bachelor's and starting the Master's program, I started \nto question whether advancing further in theory alone would truly help me achieve\nCites: A survey of LLM-based automated program repair: Taxonomies", "link": "https://scholar.google.com/scholar_url?url=https://repository.tudelft.nl/file/File_98c0f468-4160-4590-b2bf-18f26b90ceb0&hl=en&sa=X&d=6284233035956195589&ei=eN2UabqaLoS4ieoPory9wAQ&scisig=AFtJQizg25ebC_R6MBCOjmhV6Eyb&oi=scholaralrt&hist=ylyK0_8AAAAJ:4974034551180671527:AFtJQixSV7r1rt4PSjnxKJ5_Ev3p&html=&pos=0&folt=cit", "author": ["Bach Le"], "ref": ["6 new citations to articles by Bach Le"]}
{"title": "ComPass: Contrastive Learning for Automated Patch Correctness Assessment in Program Repair", "first_label": ["APR"], "second_label": ["Repair"], "data": "Q Zhang, Y Shang, H Hu, C Fang, Z Chen, L Xiao- arXiv preprint arXiv:2602.07561, 2026\nAutomated program repair (APR) attempts to reduce manual debugging efforts and \nplays a vital role in software maintenance. Despite remarkable progress, APR is still \nlimited in generating overfitting patches, ie, patches passing available test suites but \nincorrect. This issue, known as patch overfitting, has become a key concern in the \nAPR community, with numerous approaches proposed to address it. Very recent \nwork proposes a pre-trained language model (PLM)-based automated patch\nCites: Leveraging large language model for automatic patch correctness", "link": "https://scholar.google.com/scholar_url?url=https://arxiv.org/pdf/2602.07561&hl=en&sa=X&d=10281561863713651378&ei=eN2UabqaLoS4ieoPory9wAQ&scisig=AFtJQixPL0gtok2ZFmLdaDXrUaiR&oi=scholaralrt&hist=ylyK0_8AAAAJ:4974034551180671527:AFtJQixSV7r1rt4PSjnxKJ5_Ev3p&html=&pos=1&folt=cit", "author": ["Bach Le"], "ref": ["6 new citations to articles by Bach Le", "5 new citations to articles by Xin ZHOU", "3 new citations to articles by Thanh Le-Cong", "Quang-Cuong Bui - new related research", "David Lo - new related research"]}
{"title": "VulReaD: Knowledge-Graph-guided Software Vulnerability Reasoning and Detection", "first_label": ["Vulnerabilities"], "second_label": ["Detection", "Reasoning", "Graph"], "data": "S Mukhtar, Y Yao, Z Sun, M Mustafa, YS Ong, Y Sun- arXiv preprint arXiv:2602.10787, 2026\nSoftware vulnerability detection (SVD) is a critical challenge in modern systems. \nLarge language models (LLMs) offer natural-language explanations alongside \npredictions, but most work focuses on binary evaluation, and explanations often lack \nsemantic consistency with Common Weakness Enumeration (CWE) categories. We \npropose VulReaD, a knowledge-graph-guided approach for vulnerability reasoning \nand detection that moves beyond binary classification toward CWE-level reasoning\nCites: Thanh Le-Cong, Ting Zhang, Ivana Clairine Irsan, Joshua", "link": "https://scholar.google.com/scholar_url?url=https://arxiv.org/pdf/2602.10787&hl=en&sa=X&d=12724462479024050526&ei=eN2UabqaLoS4ieoPory9wAQ&scisig=AFtJQiwvkuWrbUBoteOrtFRAzb_u&oi=scholaralrt&hist=ylyK0_8AAAAJ:4974034551180671527:AFtJQixSV7r1rt4PSjnxKJ5_Ev3p&html=&pos=2&folt=cit", "author": ["Bach Le"], "ref": ["6 new citations to articles by Bach Le", "3 new citations to articles by Thanh Le-Cong", "Quang-Cuong Bui - new related research"]}
{"title": "Investigating How Prompt Language Choice Affects the Security of ChatGPT-Generated Code", "first_label": ["LLM", "Code"], "second_label": [], "data": "Y Guo, R Ma, X Cui, H Yang, JY Jiang- Artificial Intelligence and Human-Computer, 2026\nWith the widespread application of generative large language models (such as \nChatGPT) in code generation, the security of their output code has attracted \nincreasing attention. However, the impact of suggest language on the security of \ngenerated code has not been fully studied. This paper compares and analyses the \nPython and Java codes generated by ChatGPT under English and Chinese prompts, \nand systematically evaluates its security differences. Experiments show that the code\nCites: Refining chatgpt-generated code: Characterizing and mitigating", "link": "https://scholar.google.com/scholar_url?url=https://ebooks.iospress.nl/volumearticle/77336&hl=en&sa=X&d=3279761696664176215&ei=eN2UabqaLoS4ieoPory9wAQ&scisig=AFtJQiyMU7IbUl5Z5ljiX9T_zUGi&oi=scholaralrt&hist=ylyK0_8AAAAJ:4974034551180671527:AFtJQixSV7r1rt4PSjnxKJ5_Ev3p&html=&pos=3&folt=cit", "author": ["Bach Le"], "ref": ["6 new citations to articles by Bach Le", "3 new citations to articles by Thanh Le-Cong"]}
{"title": "Smart Contracts and SME Resilience: Business Model Adaptation and International Considerations", "first_label": ["Smart Contracts"], "second_label": [], "data": "A Zirar, A Jabbar, HA Mahdiraji- Canadian Journal of Administrative Sciences/Revue, 2026\nSmart contracts (SCs), appended to a blockchain, protect digital environments and \ntheir resources, processes and structures, reducing mismatches between legal and \nactual rights and ownership. They enhance digital resilience by improving \ntransparency, traceability and trust in digital transactions. Utilizing SCs requires \nbusinesses to adapt their models, revenue streams and customer relationships. For \nsmall and mediumsized enterprises (SMEs), SCs present challenges, requiring\nCites: Smart contract development: Challenges and opportunities", "link": "https://scholar.google.com/scholar_url?url=https://onlinelibrary.wiley.com/doi/pdf/10.1002/cjas.70046&hl=en&sa=X&d=15038737687136994647&ei=eN2UabqaLoS4ieoPory9wAQ&scisig=AFtJQiwuiZRPm8KDOBGQRORg_Kr6&oi=scholaralrt&hist=ylyK0_8AAAAJ:4974034551180671527:AFtJQixSV7r1rt4PSjnxKJ5_Ev3p&html=&pos=4&folt=cit", "author": ["Bach Le"], "ref": ["6 new citations to articles by Bach Le"]}
{"title": "Specification Vibing for Automated Program Repair", "first_label": ["APR"], "second_label": ["Repair"], "data": "T Zhu, LC Cordeiro, MA Mustafa, Y Sun- arXiv preprint arXiv:2602.08263, 2026\nLarge language model (LLM)-driven automated program repair (APR) has advanced \nrapidly, but most methods remain code-centric: they directly rewrite source code and \nthereby risk hallucinated, behaviorally inconsistent fixes. This limitation suggests the \nneed for an alternative repair paradigm that relies on a representation more \naccessible to LLMs than raw code, enabling more accurate understanding, analysis, \nand alignment during repair. To address this gap, we propose VibeRepair, a\nCites: S3: Syntax- and Semantic-Guided Repair Synthesis via  \n \nThis message was sent by Google Scholar because you're following new citations to articles written by \nBach Le\n.\nList alerts\nCancel alert", "link": "https://scholar.google.com/scholar_url?url=https://arxiv.org/pdf/2602.08263&hl=en&sa=X&d=9846310474582051884&ei=eN2UabqaLoS4ieoPory9wAQ&scisig=AFtJQiyhJF89uRYMSnnfgbtYpb6M&oi=scholaralrt&hist=ylyK0_8AAAAJ:4974034551180671527:AFtJQixSV7r1rt4PSjnxKJ5_Ev3p&html=&pos=5&folt=cit", "author": ["Bach Le"], "ref": ["6 new citations to articles by Bach Le", "Quang-Cuong Bui - new related research", "Thanh Le-Cong - new related research", "Xin ZHOU - new related research", "10 new citations to articles by Abhik Roychoudhury"]}
{"title": "Adoption of Large Language Models in Scrum Management: Insights from Brazilian Practitioners", "first_label": ["LLM"], "second_label": [], "data": "M Perkusich, D Albuquerque, AA Arajo, M Paixo- arXiv preprint arXiv, 2026\nScrum is widely adopted in software project management due to its adaptability and \ncollaborative nature. The recent emergence of Large Language Models (LLMs) has \ncreated new opportunities to support knowledge-intensive Scrum practices. \nHowever, existing research has largely focused on technical activities such as \ncoding and testing, with limited evidence on the use of LLMs in management-related \nScrum activities. In this study, we investigate the use of LLMs in Scrum management\nCites: Assessing and Advancing Benchmarks for Evaluating Large", "link": "https://scholar.google.com/scholar_url?url=https://arxiv.org/pdf/2602.08192&hl=en&sa=X&d=1478012291868204432&ei=et2UaazZJ-mFieoP9paZcQ&scisig=AFtJQiwmb9E-ybn-P5_OxHsgK-0h&oi=scholaralrt&hist=ylyK0_8AAAAJ:15035864585353249078:AFtJQizgrvX4EwoIvgLYGvi8jdIk&html=&pos=0&folt=cit", "author": ["Xin ZHOU"], "ref": ["5 new citations to articles by Xin ZHOU"]}
{"title": "Hidden Licensing Risks in the LLMware Ecosystem", "first_label": ["LLM"], "second_label": [], "data": "B Wang, Y Chen, J Shi, M Li, Y Lyu, Y Wu, Y Lin- arXiv preprint arXiv, 2026\nLarge Language Models (LLMs) are increasingly integrated into software systems, \ngiving rise to a new class of systems referred to as LLMware. Beyond traditional \nsource-code components, LLMware embeds or interacts with LLMs that depend on \nother models and datasets, forming complex supply chains across open-source \nsoftware (OSS), models, and datasets. However, licensing issues emerging from \nthese intertwined dependencies remain largely unexplored. Leveraging GitHub and\nCites: Assessing and Advancing Benchmarks for Evaluating Large", "link": "https://scholar.google.com/scholar_url?url=https://arxiv.org/pdf/2602.10758&hl=en&sa=X&d=13563347792545962436&ei=et2UaazZJ-mFieoP9paZcQ&scisig=AFtJQiwWocRym3bScSWcYf4y0nHZ&oi=scholaralrt&hist=ylyK0_8AAAAJ:15035864585353249078:AFtJQizgrvX4EwoIvgLYGvi8jdIk&html=&pos=1&folt=cit", "author": ["Xin ZHOU"], "ref": ["5 new citations to articles by Xin ZHOU"]}
{"title": "Software defect detection using large language models: a literature", "first_label": ["LLM", "Software Defect"], "second_label": ["Detection"], "data": "Y CHEN, Y SHEN, T WANG, S OU, R WANG, Y LI - 2025\nAs software systems grow in complexity, the importance of efficient defect detection \nescalates, becoming vital to maintain software quality. In recent years, artificial \nintelligence technology has boomed. In particular, with the proposal of Large \nLanguage Models (LLMs), researchers have found the huge potential of LLMs to \nenhance the performance of software defect detection. This review aims to elucidate \nthe relationship between LLMs and software defect detection. We categorize and\nCites: Large language model for vulnerability detection and repair", "link": "https://scholar.google.com/scholar_url?url=https://journal.hep.com.cn/fcs/EN/PDF/10.1007/s11704-025-40672-2&hl=en&sa=X&d=18340392957315661179&ei=et2UaazZJ-mFieoP9paZcQ&scisig=AFtJQizCex6Amlj3EBaFYnR_FMpl&oi=scholaralrt&hist=ylyK0_8AAAAJ:15035864585353249078:AFtJQizgrvX4EwoIvgLYGvi8jdIk&html=&pos=2&folt=cit", "author": ["Xin ZHOU"], "ref": ["5 new citations to articles by Xin ZHOU", "1 new citation to articles by Shengyi Pan"]}
{"title": "SecCodePRM: A Process Reward Model for Code Security", "first_label": ["Code"], "second_label": [], "data": "W Yu, R Mangal, Y Luo, K Hu, J He, CS Pasareanu- arXiv preprint arXiv, 2026\nLarge Language Models are rapidly becoming core components of modern software \ndevelopment workflows, yet ensuring code security remains challenging. Existing \nvulnerability detection pipelines either rely on static analyzers or use LLM/GNN-\nbased detectors trained with coarse program-level supervision. Both families often \nrequire complete context, provide sparse end-of-completion feedback, and can \ndegrade as code length grows, making them ill-suited for real-time, prefix-level\nCites: Large language model for vulnerability detection: Emerging results  \n \nThis message was sent by Google Scholar because you're following new citations to articles written by \nXin ZHOU\n.\nList alerts\nCancel alert", "link": "https://scholar.google.com/scholar_url?url=https://arxiv.org/pdf/2602.10418&hl=en&sa=X&d=9078234747776775259&ei=et2UaazZJ-mFieoP9paZcQ&scisig=AFtJQiyj0ANDA8nv_6AlKkoTTkYa&oi=scholaralrt&hist=ylyK0_8AAAAJ:15035864585353249078:AFtJQizgrvX4EwoIvgLYGvi8jdIk&html=&pos=4&folt=cit", "author": ["Xin ZHOU"], "ref": ["5 new citations to articles by Xin ZHOU"]}
{"title": "An iterative confidence-driven discrepancy-aware federated weakly supervised model for spine segmentation in 3D medical images", "first_label": [], "second_label": [], "data": "P Wang, J Fan, X Pan, W Chu- Ain Shams Engineering Journal, 2026\nSpinal disorders can cause neurological dysfunction and disability, with diagnosis \nrelying on medical image segmentation. Traditional deep learning requires costly \npixel-level annotations. Weakly supervised semantic segmentation with image-level \nlabels reduces this cost, but CNNs struggle with long-range dependencies, leading \nto under-activated class activation maps (CAMs). Vision Transformers (ViTs) partly \naddress this but cause over-activation. Data privacy constraints hinder large-scale\nCites: Surveying neuro-symbolic approaches for reliable artificial", "link": "https://scholar.google.com/scholar_url?url=https://www.sciencedirect.com/science/article/pii/S2090447926000420&hl=en&sa=X&d=11394198107905439751&ei=eN2Uab3eH-mFieoP9paZcQ&scisig=AFtJQiw5trjifCRz0Q4NXj69pWM2&oi=scholaralrt&hist=ylyK0_8AAAAJ:4851239734318863641:AFtJQiz5W5aJ7kb2ms-a12QvBoGR&html=&pos=0&folt=cit", "author": ["Hong Jin Kang"], "ref": ["4 new citations to articles by Hong Jin Kang"]}
{"title": "GreenAI: A Comparative Analysis of Environmental Efficiency in LLM-Generated Code", "first_label": ["LLM", "Code"], "second_label": [], "data": "T Tunzina, M Mashira, MM Islam- IEEE Access, 2026\nThe increasing usage of large language models for code generation raises concerns \nregarding their computational costs and ecological impact. This study evaluates the \nenvironmental efficiency of several cutting-edge large language models, including \nChatGPT, Claude, Copilot, DeepSeek, Gemini, Mistral, and Qwen, across algorithm \nand data structure tasks in Python, C++, and Java, selected from HackerRank to \nensure practical relevance. A multi-metric, sustainability-focused evaluation\nCites: Greening large language models of code", "link": "https://scholar.google.com/scholar_url?url=https://ieeexplore.ieee.org/iel8/6287639/6514899/11366639.pdf&hl=en&sa=X&d=14885524204352707633&ei=eN2Uab3eH-mFieoP9paZcQ&scisig=AFtJQiwv3TbYdxT53H9wvwvrqe89&oi=scholaralrt&hist=ylyK0_8AAAAJ:4851239734318863641:AFtJQiz5W5aJ7kb2ms-a12QvBoGR&html=&pos=1&folt=cit", "author": ["Hong Jin Kang"], "ref": ["4 new citations to articles by Hong Jin Kang"]}
{"title": "Transferable Backdoor Attacks for Code Models via Sharpness-Aware Adversarial Perturbation", "first_label": ["Code"], "second_label": [], "data": "S Chang, H Huang, Y Zhang, Y Huang, F Xiao- arXiv preprint arXiv, 2026\nCode models are increasingly adopted in software development but remain \nvulnerable to backdoor attacks via poisoned training data. Existing backdoor attacks \non code models face a fundamental trade-off between transferability and \nstealthiness. Static trigger-based attacks insert fixed dead code patterns that transfer \nwell across models and datasets but are easily detected by code-specific defenses. \nIn contrast, dynamic trigger-based attacks adaptively generate context-aware triggers\nCites: Stealthy backdoor attack for code models", "link": "https://scholar.google.com/scholar_url?url=https://arxiv.org/pdf/2602.11213&hl=en&sa=X&d=5757756154925627734&ei=eN2Uab3eH-mFieoP9paZcQ&scisig=AFtJQiwM4icetYMb7svbpxPCCTl0&oi=scholaralrt&hist=ylyK0_8AAAAJ:4851239734318863641:AFtJQiz5W5aJ7kb2ms-a12QvBoGR&html=&pos=2&folt=cit", "author": ["Hong Jin Kang"], "ref": ["4 new citations to articles by Hong Jin Kang"]}
{"title": "Toward Linking Declined Proposals and Source Code: An Exploratory Study on the Go Repository", "first_label": ["Code"], "second_label": [], "data": "S Nakashima, M Kondo, M Alfadel, A Ahmad, T Nakae- arXiv preprint arXiv, 2026\nTraceability links are key information sources for software developers, connecting \nsoftware artifacts (eg, linking requirements to the corresponding source code). In \nopen-source software (OSS) projects, such links play an important role, particularly \nbetween the contributions (eg, GitHub issues) and the corresponding source code. \nThrough these links, developers can trace the discussions in contributions and \nuncover design rationales, constraints, and security concerns. Previous studies have\nCites: Hermes: Using commit-issue linking to detect vulnerability-fixing  \n \nThis message was sent by Google Scholar because you're following new citations to articles written by \nHong Jin Kang\n.\nList alerts\nCancel alert", "link": "https://scholar.google.com/scholar_url?url=https://arxiv.org/pdf/2602.09467&hl=en&sa=X&d=15877373883978370771&ei=eN2Uab3eH-mFieoP9paZcQ&scisig=AFtJQiy8rM9M-y-Y3WPbirMWlYHg&oi=scholaralrt&hist=ylyK0_8AAAAJ:4851239734318863641:AFtJQiz5W5aJ7kb2ms-a12QvBoGR&html=&pos=3&folt=cit", "author": ["Hong Jin Kang"], "ref": ["4 new citations to articles by Hong Jin Kang"]}
{"title": "Evaluating AGENTS. md: Are Repository-Level Context Files Helpful for Coding Agents?", "first_label": ["Repository-Level"], "second_label": ["Agent"], "data": "T Gloaguen, N Mndler, M Mller, V Raychev- arXiv preprint arXiv, 2026\nA widespread practice in software development is to tailor coding agents to \nrepositories using context files, such as AGENTS. md, by either manually or \nautomatically generating them. Although this practice is strongly encouraged by", "link": "https://scholar.google.com/scholar_url?url=https://arxiv.org/pdf/2602.11988&hl=en&sa=X&d=3880803784096039015&ei=et2Uaa6REKqtieoPn4_pgQE&scisig=AFtJQix4-sJj-_aqDOi4Acv3NN62&oi=scholaralrt&hist=ylyK0_8AAAAJ:12723761785867032729:AFtJQiwlQ81H-aGckuzBfBFA83Tf&html=&pos=0&folt=rel", "author": ["Abhik Roychoudhury"], "ref": ["Abhik Roychoudhury - new related research"]}
{"title": "Following Dragons: Code Review-Guided Fuzzing", "first_label": ["Fuzzing", "Code Review", "Code"], "second_label": [], "data": "VH Luu, A Pasdar, W Charoenwet, T Murray, S Cohney- arXiv preprint arXiv, 2026\nModern fuzzers scale to large, real-world software but often fail to exercise the \nprogram states developers consider most fragile or security-critical. Such states are \ntypically deep in the execution space, gated by preconditions, or overshadowed by", "link": "https://scholar.google.com/scholar_url?url=https://arxiv.org/pdf/2602.10487&hl=en&sa=X&d=11235933302767379353&ei=et2Uaa6REKqtieoPn4_pgQE&scisig=AFtJQixj2BjZ6T16jacNY9eYBuAY&oi=scholaralrt&hist=ylyK0_8AAAAJ:12723761785867032729:AFtJQiwlQ81H-aGckuzBfBFA83Tf&html=&pos=1&folt=rel", "author": ["Abhik Roychoudhury"], "ref": ["Abhik Roychoudhury - new related research", "Hong Jin Kang - new related research", "10 new citations to articles by Abhik Roychoudhury"]}
{"title": "From Completion to Editing: Unlocking Context-Aware Code Infilling via Search-and-Replace Instruction Tuning", "first_label": ["Code"], "second_label": ["Generation", "Search"], "data": "J Zhang, Z Cui, J Yang, L Zhang, Y Jing, Z Ma, T Bai- arXiv preprint arXiv, 2026\nThe dominant Fill-in-the-Middle (FIM) paradigm for code completion is constrained \nby its rigid inability to correct contextual errors and reliance on unaligned, insecure \nBase models. While Chat LLMs offer safety and Agentic workflows provide flexibility", "link": "https://scholar.google.com/scholar_url?url=https://arxiv.org/pdf/2601.13384&hl=en&sa=X&d=888503465513802748&ei=et2Uaa6REKqtieoPn4_pgQE&scisig=AFtJQizYRC1ctaQnbAXvAicnfTb2&oi=scholaralrt&hist=ylyK0_8AAAAJ:12723761785867032729:AFtJQiwlQ81H-aGckuzBfBFA83Tf&html=&pos=2&folt=rel", "author": ["Abhik Roychoudhury"], "ref": ["Abhik Roychoudhury - new related research"]}
{"title": "IoTtracer: greybox fuzzing for Linux-based IoT devices with low-cost coverage tracing", "first_label": ["Fuzzing"], "second_label": [], "data": "C Wang, J Peng, H Qiu, J Zhu- The Computer Journal, 2026\nFuzzing, especially coverage-guided greybox (CG) fuzzing, has been demonstrated \nto be effective in discovering software security vulnerabilities. Code coverage \nachieved through instrumentation plays a vital role in this. However, closed-source", "link": "https://scholar.google.com/scholar_url?url=https://academic.oup.com/comjnl/advance-article-abstract/doi/10.1093/comjnl/bxaf147/8437980&hl=en&sa=X&d=18033898972224357377&ei=et2Uaa6REKqtieoPn4_pgQE&scisig=AFtJQiyPJy-TOLtlxduNMKmprUU5&oi=scholaralrt&hist=ylyK0_8AAAAJ:12723761785867032729:AFtJQiwlQ81H-aGckuzBfBFA83Tf&html=&pos=3&folt=rel", "author": ["Abhik Roychoudhury"], "ref": ["Abhik Roychoudhury - new related research"]}
{"title": "DyMA-Fuzz: Dynamic Direct Memory Access Abstraction for Re-hosted Monolithic Firmware Fuzzing", "first_label": ["Fuzzing"], "second_label": [], "data": "G Farrelly, M Chesser, S Camtepe, DC Ranasinghe- arXiv preprint arXiv:2602.08750, 2026\nThe rise of smart devices in critical domains--including automotive, medical, \nindustrial--demands robust firmware testing. Fuzzing firmware in re-hosted \nenvironments is a promising method for automated testing at scale, but remains", "link": "https://scholar.google.com/scholar_url?url=https://arxiv.org/pdf/2602.08750&hl=en&sa=X&d=16810662292277911051&ei=et2Uaa6REKqtieoPn4_pgQE&scisig=AFtJQizC__OgafftaZ_URIodg0Np&oi=scholaralrt&hist=ylyK0_8AAAAJ:12723761785867032729:AFtJQiwlQ81H-aGckuzBfBFA83Tf&html=&pos=4&folt=rel", "author": ["Abhik Roychoudhury"], "ref": ["Abhik Roychoudhury - new related research"]}
{"title": "Evaluating and Achieving Controllable Code Completion in Code LLM", "first_label": ["LLM", "Code"], "second_label": ["Generation"], "data": "J Zhang, Z Cui, L Zhang, J Yang, J Yang, Q Liu- arXiv preprint arXiv, 2026\nCode completion has become a central task, gaining significant attention with the \nrise of large language model (LLM)-based tools in software engineering. Although \nrecent advances have greatly improved LLMs' code completion abilities, evaluation", "link": "https://scholar.google.com/scholar_url?url=https://arxiv.org/pdf/2601.15879&hl=en&sa=X&d=7626674770956427670&ei=et2Uaa6REKqtieoPn4_pgQE&scisig=AFtJQizGgJ2Ae04ybH5LZ-LHuJLH&oi=scholaralrt&hist=ylyK0_8AAAAJ:12723761785867032729:AFtJQiwlQ81H-aGckuzBfBFA83Tf&html=&pos=5&folt=rel", "author": ["Abhik Roychoudhury"], "ref": ["Abhik Roychoudhury - new related research", "Thanh Le-Cong - new related research", "Bach Le - new related research"]}
{"title": "LLM-FSM: Scaling Large Language Models for Finite-State Reasoning in RTL Code Generation", "first_label": ["LLM", "Code"], "second_label": ["Generation", "Reasoning"], "data": "Y Wu, B Gokmen, Z Xie, P Li, C Trippel, P Raina- arXiv preprint arXiv, 2026\nFinite-state reasoning, the ability to understand and implement state-dependent \nbehavior, is central to hardware design. In this paper, we present LLM-FSM, a \nbenchmark that evaluates how well large language models (LLMs) can recover finite", "link": "https://scholar.google.com/scholar_url?url=https://arxiv.org/pdf/2602.07032&hl=en&sa=X&d=12050746489918843709&ei=et2Uaa6REKqtieoPn4_pgQE&scisig=AFtJQixjjvbj0JhZD4RFZg8jnpH9&oi=scholaralrt&hist=ylyK0_8AAAAJ:12723761785867032729:AFtJQiwlQ81H-aGckuzBfBFA83Tf&html=&pos=6&folt=rel", "author": ["Abhik Roychoudhury"], "ref": ["Abhik Roychoudhury - new related research", "Hong Jin Kang - new related research", "Xin ZHOU - new related research"]}
{"title": "Improving Code Generation via Small Language Model-as-a-judge", "first_label": ["LLM", "Code"], "second_label": ["Generation"], "data": "G Crupi, R Tufano, G Bavota- arXiv preprint arXiv:2602.11911, 2026\nLarge language models (LLMs) have shown remarkable capabilities in automated \ncode generation. While effective for mainstream languages, they may underperform \non less common or domain-specific languages, prompting companies to develop in\n \nThis message was sent by Google Scholar because you're following new articles related to research by \nAbhik Roychoudhury\n.\nList alerts\nCancel alert", "link": "https://scholar.google.com/scholar_url?url=https://arxiv.org/pdf/2602.11911&hl=en&sa=X&d=14232746377907410863&ei=et2Uaa6REKqtieoPn4_pgQE&scisig=AFtJQiypxwfsnDAmpKXFYYgtste_&oi=scholaralrt&hist=ylyK0_8AAAAJ:12723761785867032729:AFtJQiwlQ81H-aGckuzBfBFA83Tf&html=&pos=7&folt=rel", "author": ["Abhik Roychoudhury"], "ref": ["Abhik Roychoudhury - new related research", "Hong Jin Kang - new related research", "Xin ZHOU - new related research", "David Lo - new related research"]}
{"title": "A Novel Seed Scheduling Scheme Using Thompson Sampling for Coverage-guided Greybox Fuzzing", "first_label": ["Fuzzing"], "second_label": [], "data": "W Zhang, J Chen, S Cai, K Wang, Y Liu, H Ding- Journal of Systems and Software, 2026\nAbstract Coverage-guided Greybox Fuzzing (CGF) aims to maximize code area \nexploration within limited time, achieving higher code coverage. Current methods \ngenerally estimate seed potential through attributes like execution speed and size", "link": "https://scholar.google.com/scholar_url?url=https://www.sciencedirect.com/science/article/pii/S0164121226000282&hl=en&sa=X&d=3848108523093918317&ei=e92UaZGFAtWi6rQPx6qOwQE&scisig=AFtJQiz3F4H_Jg12DpLjxemcrT-h&oi=scholaralrt&hist=ylyK0_8AAAAJ:17903213248891513419:AFtJQiyNBATNeSYOCbLu--r2TCtp&html=&pos=0&folt=rel", "author": ["Hong Jin Kang"], "ref": ["Hong Jin Kang - new related research"]}
{"title": "Commercial Cyber-Physical System Development Tool Chain Bug Detecting via Diversity-Guided Fuzzing Test", "first_label": ["Fuzzing", "Bug", "Software Testing"], "second_label": ["Detection"], "data": "H Liu, S Guo, J Liu, Y Wang, H Cheng, X Li, H Jiang- ACM Transactions on Design, 2026\nSimulink is MathWorks' commercial cyber-physical systems development tool, which \nenables engineers to do rapid prototyping of their systems through simulation and \nembedded code generation. When a Simulink model meets requirements, engineers", "link": "https://scholar.google.com/scholar_url?url=https://dl.acm.org/doi/pdf/10.1145/3797030&hl=en&sa=X&d=8508752291522606484&ei=e92UaZGFAtWi6rQPx6qOwQE&scisig=AFtJQiyJj_bSW7T590dQj2Yr60-8&oi=scholaralrt&hist=ylyK0_8AAAAJ:17903213248891513419:AFtJQiyNBATNeSYOCbLu--r2TCtp&html=&pos=1&folt=rel", "author": ["Hong Jin Kang"], "ref": ["Hong Jin Kang - new related research"]}
{"title": "Leveraging Language Models to Discover Evidence-Based Actions for OSS Sustainability", "first_label": ["LLM"], "second_label": [], "data": "NI Khan, V Filkov- arXiv preprint arXiv:2602.11746, 2026\nWhen successful, Open Source Software (OSS) projects create enormous value, but \nmost never reach a sustainable state. Recent work has produced accurate models \nthat forecast OSS sustainability, yet these models rarely tell maintainers what to do", "link": "https://scholar.google.com/scholar_url?url=https://arxiv.org/pdf/2602.11746&hl=en&sa=X&d=8109733023802935337&ei=e92UaZGFAtWi6rQPx6qOwQE&scisig=AFtJQiz8T5I3B0DDbCPAlrgG7UYC&oi=scholaralrt&hist=ylyK0_8AAAAJ:17903213248891513419:AFtJQiyNBATNeSYOCbLu--r2TCtp&html=&pos=4&folt=rel", "author": ["Hong Jin Kang"], "ref": ["Hong Jin Kang - new related research", "Thanh Le-Cong - new related research", "Xin ZHOU - new related research", "Bach Le - new related research"]}
{"title": "Automated Test Suite Enhancement Using Large Language Models with Few-shot Prompting", "first_label": ["LLM", "Software Testing"], "second_label": [], "data": "A Chudic, G alkl- arXiv preprint arXiv:2602.12256, 2026\nUnit testing is essential for verifying the functional correctness of code modules (eg, \nclasses, methods), but manually writing unit tests is often labor-intensive and time-\nconsuming. Unit tests generated by tools that employ traditional approaches, such as", "link": "https://scholar.google.com/scholar_url?url=https://arxiv.org/pdf/2602.12256&hl=en&sa=X&d=17375712188534395803&ei=e92UaZGFAtWi6rQPx6qOwQE&scisig=AFtJQiydUss0cNBZmB_SNV_qIpwb&oi=scholaralrt&hist=ylyK0_8AAAAJ:17903213248891513419:AFtJQiyNBATNeSYOCbLu--r2TCtp&html=&pos=5&folt=rel", "author": ["Hong Jin Kang"], "ref": ["Hong Jin Kang - new related research", "Thanh Le-Cong - new related research", "Xin ZHOU - new related research", "Bach Le - new related research"]}
{"title": "CodeCircuit: Toward Inferring LLM-Generated Code Correctness via Attribution Graphs", "first_label": ["LLM", "Code"], "second_label": ["Graph"], "data": "Y He, Z Zhao, Z Kaiyu, B Dai, J Fu, Y Yang- arXiv preprint arXiv:2602.07080, 2026\nCurrent paradigms for code verification rely heavily on external mechanisms-such as \nexecution-based unit tests or auxiliary LLM judges-which are often labor-intensive or \nlimited by the judging model's own capabilities. This raises a fundamental, yet", "link": "https://scholar.google.com/scholar_url?url=https://arxiv.org/pdf/2602.07080&hl=en&sa=X&d=9123467252198573657&ei=e92UaZGFAtWi6rQPx6qOwQE&scisig=AFtJQiyMa7sdvS4LCe3OOeMt8_rS&oi=scholaralrt&hist=ylyK0_8AAAAJ:17903213248891513419:AFtJQiyNBATNeSYOCbLu--r2TCtp&html=&pos=7&folt=rel", "author": ["Hong Jin Kang"], "ref": ["Hong Jin Kang - new related research", "Xin ZHOU - new related research", "David Lo - new related research"]}
{"title": "Test vs Mutant: Adversarial LLM Agents for Robust Unit Test Generation", "first_label": ["LLM", "Software Testing"], "second_label": ["Generation", "Agent"], "data": "P Chang, Y Fang, S Chen, Y Shi, B Shen, X Gu- arXiv preprint arXiv:2602.08146, 2026\nSoftware testing is a critical, yet resource-intensive phase of the software \ndevelopment lifecycle. Over the years, various automated tools have been \ndeveloped to aid in this process. Search-based approaches typically achieve high", "link": "https://scholar.google.com/scholar_url?url=https://arxiv.org/pdf/2602.08146&hl=en&sa=X&d=5869962820923526447&ei=e92UaZGFAtWi6rQPx6qOwQE&scisig=AFtJQixhOyAMtCRhiHJk35dam-SM&oi=scholaralrt&hist=ylyK0_8AAAAJ:17903213248891513419:AFtJQiyNBATNeSYOCbLu--r2TCtp&html=&pos=8&folt=rel", "author": ["Hong Jin Kang"], "ref": ["Hong Jin Kang - new related research", "Quang-Cuong Bui - new related research", "Thanh Le-Cong - new related research", "Xin ZHOU - new related research", "Bach Le - new related research"]}
{"title": "Rethinking Code Complexity Through the Lens of Large Language Models", "first_label": ["LLM", "Code"], "second_label": [], "data": "C Xie, Y Shi, X Gu, B Shen- arXiv preprint arXiv:2602.07882, 2026\nCode complexity metrics such as cyclomatic complexity have long been used to \nassess software quality and maintainability. With the rapid advancement of large \nlanguage models (LLMs) on code understanding and generation tasks, an important\n \nThis message was sent by Google Scholar because you're following new articles related to research by \nHong Jin Kang\n.\nList alerts\nCancel alert", "link": "https://scholar.google.com/scholar_url?url=https://arxiv.org/pdf/2602.07882&hl=en&sa=X&d=1082861563822353328&ei=e92UaZGFAtWi6rQPx6qOwQE&scisig=AFtJQiy2lFl4D5q61ERhOnowrky9&oi=scholaralrt&hist=ylyK0_8AAAAJ:17903213248891513419:AFtJQiyNBATNeSYOCbLu--r2TCtp&html=&pos=9&folt=rel", "author": ["Hong Jin Kang"], "ref": ["Hong Jin Kang - new related research", "David Lo - new related research"]}
{"title": "Search-Based Quantum Program Testing via Commuting Pauli String", "first_label": ["Software Testing"], "second_label": ["Search"], "data": "A Muqeet, S Ali, P Arcaini- arXiv preprint arXiv:2602.11487, 2026\nQuantum software testing is important for reliable quantum software engineering. \nDespite recent advances, existing quantum software testing approaches rely on \nsimple test inputs and statistical oracles, costly program specifications, and limited", "link": "https://scholar.google.com/scholar_url?url=https://arxiv.org/pdf/2602.11487&hl=en&sa=X&d=9716098179098380763&ei=et2UadDfBOWU6rQP87PpyAM&scisig=AFtJQixdeZmhL0jNrfshylKrZG7j&oi=scholaralrt&hist=ylyK0_8AAAAJ:11088443020050739259:AFtJQiw4-5F9bAtpTLXfn9b00q5K&html=&pos=3&folt=rel", "author": ["Quang-Cuong Bui"], "ref": ["Quang-Cuong Bui - new related research"]}
{"title": "RustXec: A Vulnerability Reproduction Dataset for Assessing Security Risks in Open-Source Rust Applications", "first_label": ["Vulnerabilities"], "second_label": [], "data": "Z Ji, X Wang, W Lingxiang, G Li, F Yang, Y Zhang - 2026\nDespite Rust's memory safety guarantees, developers can still introduce security \nvulnerabilities due to limited security awareness and training. Assessing the security \nrisks of such vulnerabilities is challenging, especially when the resulting failures are \nnot directly observable in the application's runtime behavior. However, the Rust \necosystem currently lacks reproducible vulnerability datasets, and many vulnerability \nadvisories do not provide proof-of-vulnerability (PoV) examples to demonstrate the\nCites: Vul4j: A dataset of reproducible java vulnerabilities geared towards  \n \nThis message was sent by Google Scholar because you're following new citations to articles written by \nQuang-Cuong Bui\n.\nList alerts\nCancel alert", "link": "https://scholar.google.com/scholar_url?url=https://neuzhangy.github.io/assets/RustXec26-B38KjKAe.pdf&hl=en&sa=X&d=151729579352626642&ei=ed2Uae4T7KLqtA_u87fZAw&scisig=AFtJQixR2WhBhxtMOssyCaoX9clE&oi=scholaralrt&hist=ylyK0_8AAAAJ:5615766320347152220:AFtJQiyrXDu1QFn6TtzLI7Oh3odE&html=&pos=0&folt=cit", "author": ["Quang-Cuong Bui"], "ref": ["1 new citation to articles by Quang-Cuong Bui"]}
{"title": "Dynamic Cogeneration of Bug Reproduction Test in Agentic Program Repair", "first_label": ["APR", "Bug", "Software Testing"], "second_label": ["Repair", "Generation", "Agent"], "data": "R Cheng, M Tufano, J Cambronero, R Wei, S Shi, G Uy- arXiv preprint arXiv, 2026\nBug Reproduction Tests (BRTs) have been used in many agentic Automated \nProgram Repair (APR) systems, primarily for validating promising fixes and aiding fix \ngeneration. In practice, when developers submit a patch, they often implement the", "link": "https://scholar.google.com/scholar_url?url=https://arxiv.org/pdf/2601.19066&hl=en&sa=X&d=142415245982441802&ei=eN2UafrLENWi6rQPx6qOwQE&scisig=AFtJQizWQaergncjp9X0poMrj6wF&oi=scholaralrt&hist=ylyK0_8AAAAJ:4812769200119993430:AFtJQixMW5fth2vCkVauzao3YcYJ&html=&pos=1&folt=rel", "author": ["Thanh Le-Cong"], "ref": ["Thanh Le-Cong - new related research", "Bach Le - new related research"]}
{"title": "BMGANet: A deep learning model for source code vulnerability detection by integrating token-level and function-level features", "first_label": ["Vulnerabilities", "Code"], "second_label": ["Detection"], "data": "E Zhu, X Qu, X Liu, X Li- Computers and Electrical Engineering, 2026\nDeep learning is widely used in vulnerability detection due to its high accuracy. \nHowever, existing models often fail to capture both token-level and function-level \nfeatures. To address this limitation, a BERT-based Multi-Granularity Attention", "link": "https://scholar.google.com/scholar_url?url=https://www.sciencedirect.com/science/article/pii/S0045790626000716&hl=en&sa=X&d=1367020005875585941&ei=eN2UafrLENWi6rQPx6qOwQE&scisig=AFtJQiyZXqZh1JNyUBXFE2LOD5EC&oi=scholaralrt&hist=ylyK0_8AAAAJ:4812769200119993430:AFtJQixMW5fth2vCkVauzao3YcYJ&html=&pos=2&folt=rel", "author": ["Thanh Le-Cong"], "ref": ["Thanh Le-Cong - new related research", "Bach Le - new related research", "Hong Jin Kang - new related research"]}
{"title": "BatCoder: Self-Supervised Bidirectional Code-Documentation Learning via Back-Translation", "first_label": ["Code"], "second_label": ["Generation"], "data": "J Xu, Y Lu, Z Huang, C Lv, X Wang, S Li, Z Xu, Z Guo- arXiv preprint arXiv, 2026\nTraining LLMs for code-related tasks typically depends on high-quality code-\ndocumentation pairs, which are costly to curate and often scarce for niche \nprogramming languages. We introduce BatCoder, a self-supervised reinforcement", "link": "https://scholar.google.com/scholar_url?url=https://arxiv.org/pdf/2602.02554&hl=en&sa=X&d=14340067511129657517&ei=eN2UafrLENWi6rQPx6qOwQE&scisig=AFtJQiy0WyC8K7SXguwyIjxmn5G-&oi=scholaralrt&hist=ylyK0_8AAAAJ:4812769200119993430:AFtJQixMW5fth2vCkVauzao3YcYJ&html=&pos=3&folt=rel", "author": ["Thanh Le-Cong"], "ref": ["Thanh Le-Cong - new related research", "Bach Le - new related research"]}
{"title": "ArkEval: Benchmarking and Evaluating Automated CodeRepair for ArkTS", "first_label": ["Code"], "second_label": ["Repair"], "data": "B Xie, S Zhang, Z Peng, W Chen, C Ying, Y Luo- arXiv preprint arXiv:2602.08866, 2026\nLarge language models have transformed code generation, enabling unprecedented \nautomation in software development. As mobile ecosystems evolve, HarmonyOS has \nemerged as a critical platform requiring robust development tools. Software", "link": "https://scholar.google.com/scholar_url?url=https://arxiv.org/pdf/2602.08866&hl=en&sa=X&d=17385062989003568906&ei=eN2UafrLENWi6rQPx6qOwQE&scisig=AFtJQix1T2IJcCM7Rx191com-b3O&oi=scholaralrt&hist=ylyK0_8AAAAJ:4812769200119993430:AFtJQixMW5fth2vCkVauzao3YcYJ&html=&pos=4&folt=rel", "author": ["Thanh Le-Cong"], "ref": ["Thanh Le-Cong - new related research", "Xin ZHOU - new related research", "10 new citations to articles by Abhik Roychoudhury", "Bach Le - new related research"]}
{"title": "When fixes teach: Repair-aware contrastive learning for optimization-resilient binary vulnerability detection", "first_label": ["Vulnerabilities"], "second_label": ["Detection", "Repair"], "data": "Z Tian, J Zhao, M Fan, J Sun, Y Chen, L Chen- Journal of Systems Architecture, 2026\nDeep learning (DL)-based vulnerability detection in source code are prevalent, yet \ndetecting vulnerabilities in binary code using this paradigm remains underexplored. \nThe few works typically treat input instructions as individual entities, failing to extract", "link": "https://scholar.google.com/scholar_url?url=https://www.sciencedirect.com/science/article/pii/S1383762126000408&hl=en&sa=X&d=15666635784265167012&ei=eN2UafrLENWi6rQPx6qOwQE&scisig=AFtJQizk9hLOdLCHcyRLEyYGZCAH&oi=scholaralrt&hist=ylyK0_8AAAAJ:4812769200119993430:AFtJQixMW5fth2vCkVauzao3YcYJ&html=&pos=5&folt=rel", "author": ["Thanh Le-Cong"], "ref": ["Thanh Le-Cong - new related research", "David Lo - new related research"]}
{"title": "Aidev: studying ai coding agents on github", "first_label": [], "second_label": ["Agent"], "data": "H Li, H Zhang, AE Hassan- arXiv preprint arXiv:2602.09185, 2026\nAI coding agents are rapidly transforming software engineering by performing tasks \nsuch as feature development, debugging, and testing. Despite their growing impact, \nthe research community lacks a comprehensive dataset capturing how these agents", "link": "https://scholar.google.com/scholar_url?url=https://arxiv.org/pdf/2602.09185&hl=en&sa=X&d=14280162623255946151&ei=eN2UafrLENWi6rQPx6qOwQE&scisig=AFtJQiym2-SPu2_K7D7AYMriHckY&oi=scholaralrt&hist=ylyK0_8AAAAJ:4812769200119993430:AFtJQixMW5fth2vCkVauzao3YcYJ&html=&pos=6&folt=rel", "author": ["Thanh Le-Cong"], "ref": ["Thanh Le-Cong - new related research", "10 new citations to articles by Abhik Roychoudhury", "David Lo - new related research"]}
{"title": "Do Not Treat Code as Natural Language: Implications for Repository-Level Code Generation and Beyond", "first_label": ["Code", "Repository-Level"], "second_label": ["Generation"], "data": "M Le-Anh, H Nguyen, KA Tran, NL Hai, LN Van- arXiv preprint arXiv, 2026\nLarge language models for code (CodeLLMs) have demonstrated remarkable \nsuccess in standalone code completion and generation, sometimes even surpassing \nhuman performance, yet their effectiveness diminishes in repository-level settings", "link": "https://scholar.google.com/scholar_url?url=https://arxiv.org/pdf/2602.11671&hl=en&sa=X&d=14121336812641653306&ei=et2UacWVM_ev6rQPkavdsQw&scisig=AFtJQiwfshRC8Q_rqS41qynTXIu3&oi=scholaralrt&hist=ylyK0_8AAAAJ:16898579961534012346:AFtJQizkAYsk28XMgdz9emRv1Jhw&html=&pos=2&folt=rel", "author": ["Xin ZHOU"], "ref": ["Xin ZHOU - new related research", "Bach Le - new articles", "David Lo - new related research"]}
{"title": "Integrating Code Metrics into Automated Documentation Generation for Computational Notebooks", "first_label": ["Code"], "second_label": ["Generation"], "data": "MM Ghahfarokhi, H Jahantigh, A Asadi, A Heydarnoori- arXiv preprint arXiv, 2026\nEffective code documentation is essential for collaboration, comprehension, and long-\nterm software maintainability, yet developers often neglect it due to its repetitive \nnature. Automated documentation generation has evolved from heuristic and rule", "link": "https://scholar.google.com/scholar_url?url=https://arxiv.org/pdf/2602.08133&hl=en&sa=X&d=16644922158548686696&ei=et2UacWVM_ev6rQPkavdsQw&scisig=AFtJQix3G7D6BHffDY7CfxuP4AcT&oi=scholaralrt&hist=ylyK0_8AAAAJ:16898579961534012346:AFtJQizkAYsk28XMgdz9emRv1Jhw&html=&pos=6&folt=rel", "author": ["Xin ZHOU"], "ref": ["Xin ZHOU - new related research"]}
{"title": "Large Language Models for Low-Code Process Automation: Lowering the Barriers for Citizen Developers", "first_label": ["LLM", "Code"], "second_label": [], "data": "PA Franois, S Ciftci, C Janiesch, R Plattfaut - 2025\nLow-code development platforms afford fast and easy process automation. Their \nintuitive drag-and-drop interfaces enable employees without formal programming \nskills to participate in process au-tomation. However, these so-called citizen \ndevelopers often struggle to create high-quality automa-tion and face challenges in \nunderstanding, maintaining, or reusing existing low-code automation. These issues \ncan severely hamper the effectiveness of citizen developer projects or even prohibit\nCites: Automatic Programming: Large Language Models and Beyond", "link": "https://scholar.google.com/scholar_url?url=https://aisel.aisnet.org/acis2025/242/&hl=en&sa=X&d=4092908879543176895&ei=ed2UaaDCNP6GieoP9e_asA4&scisig=AFtJQiw3glY-NBdg6kkOz1bAiRTA&oi=scholaralrt&hist=ylyK0_8AAAAJ:10071049626428824134:AFtJQizt-yLRFgGPhW4jiXxK1QJN&html=&pos=1&folt=cit", "author": ["Abhik Roychoudhury"], "ref": ["10 new citations to articles by Abhik Roychoudhury"]}
{"title": "TrustPKBG: Trustworthy Protocol Knowledge Blueprints Generation via LLM for Low-Altitude UAV Networks", "first_label": ["LLM"], "second_label": ["Generation"], "data": "F Wu, Y Zhang, G Li, J Li, J Ma- IEEE Transactions on Cognitive Communications, 2026\nIn low-altitude networks, reliable and lightweight flight interconnection among UAVs \nmainly depends on protocols like Message Queuing Telemetry Transport (MQTT). \nHowever, existing protocol analysis methods often fail to adapt to unknown program \nfunctions caused by version updates due to a lack of protocol knowledge blueprints \n(PKB). Moreover, due to the lack of multiple rounds of verification in terms of \ngrammar semantics and execution logic representation, the correctness, validity and\nCites: Large language model guided protocol fuzzing", "link": "https://scholar.google.com/scholar_url?url=https://ieeexplore.ieee.org/abstract/document/11366924/&hl=en&sa=X&d=303143533566627851&ei=ed2UaaDCNP6GieoP9e_asA4&scisig=AFtJQiyl8eXHkafOJUZVtZsJUlu4&oi=scholaralrt&hist=ylyK0_8AAAAJ:10071049626428824134:AFtJQizt-yLRFgGPhW4jiXxK1QJN&html=&pos=3&folt=cit", "author": ["Abhik Roychoudhury"], "ref": ["10 new citations to articles by Abhik Roychoudhury"]}
{"title": "Artificial Intelligence in Open Source Software Engineering: A Foundation for Sustainability", "first_label": [], "second_label": [], "data": "SM Karim, W Lu, S Goggins- arXiv preprint arXiv:2602.07071, 2026\nOpen-source software (OSS) is foundational to modern digital infrastructure, yet this \ncontext for group work continues to struggle to ensure sufficient contributions in many \ncritical cases. This literature review explores how artificial intelligence (AI) is being \nleveraged to address critical challenges to OSS sustainability, including maintaining \ncontributor engagement, securing funding, ensuring code quality and security, \nfostering healthy community dynamics, and preventing project abandonment\nCites: Fixing security vulnerabilities with AI in OSS-Fuzz", "link": "https://scholar.google.com/scholar_url?url=https://arxiv.org/pdf/2602.07071&hl=en&sa=X&d=2546448789027163628&ei=ed2UaaDCNP6GieoP9e_asA4&scisig=AFtJQiyu4WiVRLccsKfpYiCgfKGl&oi=scholaralrt&hist=ylyK0_8AAAAJ:10071049626428824134:AFtJQizt-yLRFgGPhW4jiXxK1QJN&html=&pos=4&folt=cit", "author": ["Abhik Roychoudhury"], "ref": ["10 new citations to articles by Abhik Roychoudhury"]}
{"title": "Linear Temporal Logic & Specifying and Verifying Future Conditions", "first_label": [], "second_label": [], "data": "Y Song - 2026\nLinear Temporal Logic & Specifying and Verifying Future Conditions Page 1 Linear \n\r\nTemporal Logic & Specifying and Verifying Future Conditions Yahui Song Standard \n\r\nChartered Bank @ Singapore 05 Feb 2026 1 / 16 Page 2 Content Linear Temporal Logic \n\r\nTemporal Logic based Formal Methods Specifying and Verifying Future Conditions \n\r\nDetecting Use-after-free Detecting Null-pointer Dereference Specification Inference & \n\r\nInterprocedural Analysis (NPD, Memory Leak) Summary and Possibilities 2 / 16 Page\nCites: ProveNFix: Temporal Property guided Program Repair", "link": "https://scholar.google.com/scholar_url?url=https://songyahui.github.io/Yahui_SCB_Talk.pdf&hl=en&sa=X&d=5430027578668215345&ei=ed2UaaDCNP6GieoP9e_asA4&scisig=AFtJQiw8BFB6oiq1bG038zgvqSR5&oi=scholaralrt&hist=ylyK0_8AAAAJ:10071049626428824134:AFtJQizt-yLRFgGPhW4jiXxK1QJN&html=&pos=5&folt=cit", "author": ["Abhik Roychoudhury"], "ref": ["10 new citations to articles by Abhik Roychoudhury"]}
{"title": "Fipa: Fine-Grained Information-Flow-Driven Program Partitioning", "first_label": [], "second_label": [], "data": "X Rao, C Sun, D Zeng- Computers & Security, 2026\nProgram partitioning is a key security technique for reducing the attack surface and \nenforcing strong isolation. In many application scenarios, the partitioning method \nenforces information-flow security policy to prevent the leakage of sensitive data from \nthe sensitive partition. However, existing information-flow-driven approaches are \nqualitative and coarse-grained, overestimating sensitivity, and inflating the code of \nthe sensitive partition, which includes the TCB code in confidentiality protection or\nCites: Automated partitioning of android applications for trusted execution", "link": "https://scholar.google.com/scholar_url?url=https://www.sciencedirect.com/science/article/pii/S0167404826000398&hl=en&sa=X&d=1394361307855019921&ei=ed2UaaDCNP6GieoP9e_asA4&scisig=AFtJQixq2_KAh9y6zO44s--3Cdrj&oi=scholaralrt&hist=ylyK0_8AAAAJ:10071049626428824134:AFtJQizt-yLRFgGPhW4jiXxK1QJN&html=&pos=8&folt=cit", "author": ["Abhik Roychoudhury"], "ref": ["10 new citations to articles by Abhik Roychoudhury"]}
{"title": "Detecting API compatibility issues of android applications based on screen transition graphs", "first_label": [], "second_label": ["Detection", "Graph"], "data": "G Lin, Z Cui, X Chen, J Chen, Y Zhang- Empirical Software Engineering, 2026\nExisting methods for detecting API compatibility issues are mainly static analysis \nmethods. They tend to produce a large number of false positives and rely on manual \nverification, which is often inefficient. Android API compatibility issues cannot be \neffectively detected by automated testing tools since they are rarely specifically \ndesigned for these issues. Android API compatibility issues cannot be effectively \ndetected by automated testing tools since they are rarely specifically designed for\nCites: Time-travel Testing of Android Apps  \n \nThis message was sent by Google Scholar because you're following new citations to articles written by \nAbhik Roychoudhury\n.\nList alerts\nCancel alert", "link": "https://scholar.google.com/scholar_url?url=https://link.springer.com/article/10.1007/s10664-026-10817-3&hl=en&sa=X&d=8924776262833550146&ei=ed2UaaDCNP6GieoP9e_asA4&scisig=AFtJQiwYLN7PstkEKB9a-eAXY29v&oi=scholaralrt&hist=ylyK0_8AAAAJ:10071049626428824134:AFtJQizt-yLRFgGPhW4jiXxK1QJN&html=&pos=9&folt=cit", "author": ["Abhik Roychoudhury"], "ref": ["10 new citations to articles by Abhik Roychoudhury"]}
{"title": "SolAgent: A Specialized Multi-Agent Framework for Solidity Code Generation", "first_label": ["Code"], "second_label": ["Generation", "Agent"], "data": "W Chen, Z Peng, X Yin, C Ni, C Ying, B Xie, Y Luo- arXiv preprint arXiv:2601.23009, 2026\nSmart contracts are the backbone of the decentralized web, yet ensuring their \nfunctional correctness and security remains a critical challenge. While Large \nLanguage Models (LLMs) have shown promise in code generation, they often", "link": "https://scholar.google.com/scholar_url?url=https://arxiv.org/pdf/2601.23009&hl=en&sa=X&d=8858858553341530497&ei=ed2Uacz8DeWU6rQP87PpyAM&scisig=AFtJQix77wyzddvtNzUhW7ryGmtm&oi=scholaralrt&hist=ylyK0_8AAAAJ:5865787842749446205:AFtJQixqZ_1Evf2rQF6BxtODMMeG&html=&pos=4&folt=rel", "author": ["David Lo"], "ref": ["David Lo - new related research"]}
{"title": "SWE-Pruner: Self-Adaptive Context Pruning for Coding Agents", "first_label": [], "second_label": ["Agent"], "data": "Y Wang, Y Shi, M Yang, R Zhang, S He, H Lian- arXiv preprint arXiv, 2026\nLLM agents have demonstrated remarkable capabilities in software development, \nbut their performance is hampered by long interaction contexts, which incur high API \ncosts and latency. While various context compression approaches such as", "link": "https://scholar.google.com/scholar_url?url=https://arxiv.org/pdf/2601.16746&hl=en&sa=X&d=12458291911973591673&ei=ed2Uacz8DeWU6rQP87PpyAM&scisig=AFtJQixlezxBaAyDT0EzXMlEzDgk&oi=scholaralrt&hist=ylyK0_8AAAAJ:5865787842749446205:AFtJQixqZ_1Evf2rQF6BxtODMMeG&html=&pos=6&folt=rel", "author": ["David Lo"], "ref": ["David Lo - new related research"]}
{"title": "Secure Code Generation via Online Reinforcement Learning with Vulnerability Reward Model", "first_label": ["Vulnerabilities", "Code"], "second_label": ["Generation"], "data": "T Wu, M Du, Y Liu, C Yang, TY Zhuo, J Zhang, SK Ng- arXiv preprint arXiv, 2026\nLarge language models (LLMs) are increasingly used in software development, yet \ntheir tendency to generate insecure code remains a major barrier to real-world \ndeployment. Existing secure code alignment methods often suffer from a functionality", "link": "https://scholar.google.com/scholar_url?url=https://arxiv.org/pdf/2602.07422&hl=en&sa=X&d=12898392362677120913&ei=ed2Uacz8DeWU6rQP87PpyAM&scisig=AFtJQizfhNoV_ANTo555A7rP_b8c&oi=scholaralrt&hist=ylyK0_8AAAAJ:5865787842749446205:AFtJQixqZ_1Evf2rQF6BxtODMMeG&html=&pos=7&folt=rel", "author": ["David Lo"], "ref": ["David Lo - new related research"]}
{"title": "VulnResolver: A Hybrid Agent Framework for LLM-Based Automated Vulnerability Issue Resolution", "first_label": ["Vulnerabilities", "LLM"], "second_label": ["Agent"], "data": "M Zhang, X Wang, J Zhang, X Meng, J Zhang, C Hu- arXiv preprint arXiv:2601.13933, 2026\nAs software systems grow in complexity, security vulnerabilities have become \nincreasingly prevalent, posing serious risks and economic costs. Although \nautomated detection tools such as fuzzers have advanced considerably, effective\n \nThis message was sent by Google Scholar because you're following new articles related to research by \nBach Le\n.\nList alerts\nCancel alert", "link": "https://scholar.google.com/scholar_url?url=https://arxiv.org/pdf/2601.13933&hl=en&sa=X&d=8029152925504295835&ei=eN2UaYOJAemFieoP9paZcQ&scisig=AFtJQixE4gxrf7qUmFWlbhbesivn&oi=scholaralrt&hist=ylyK0_8AAAAJ:4328508672846969495:AFtJQiwGkInjySrDZ0ydjfwVMTwh&html=&pos=7&folt=rel", "author": ["Bach Le"], "ref": ["Bach Le - new related research"]}
{"title": "Plato's Form: Toward Backdoor Defense-as-a-Service for LLMs with Prototype Representations", "first_label": ["LLM"], "second_label": [], "data": "C Chen, Y Sun, J Gao, Y Jia, X Gong, Q Wang, KY Lam- arXiv preprint arXiv, 2026\nLarge language models (LLMs) are increasingly deployed in security-sensitive \napplications, yet remain vulnerable to backdoor attacks. However, existing backdoor \ndefenses are difficult to operationalize for Backdoor Defense-as-a-Service (BDaaS), \nas they require unrealistic side information (eg, downstream clean data, known \ntriggers/targets, or task domain specifics), and lack reusable, scalable purification \nacross diverse backdoored models. In this paper, we present PROTOPURIFY, a\nCites: Large language models for computer-aided design: A survey", "link": "https://scholar.google.com/scholar_url?url=https://arxiv.org/pdf/2602.06887&hl=en&sa=X&d=5020343252275057408&ei=WieTae6iF5GrieoPqY6x-Qo&scisig=AFtJQix6kmOVKxYCJmW7hEeozkY9&oi=scholaralrt&hist=ylyK0_8AAAAJ:4974034551180671527:AFtJQixSV7r1rt4PSjnxKJ5_Ev3p&html=&pos=0&folt=cit", "author": ["Bach Le"], "ref": ["3 new citations to articles by Bach Le"]}
{"title": "Evaluating LLMs for Source Code Generation and Summarization Using Machine Learning Classification and Ranking", "first_label": ["LLM", "Code"], "second_label": ["Generation"], "data": "H Mahfoodh, M Hammad, BAY Alqaralleh, AI Zreikat- Computers, 2026\nThe recent use of large language models (LLMs) in code generation and code \nsummarization tasks has been widely adopted by the software engineering \ncommunity. New LLMs are emerging regularly with improved functionalities, \nefficiency, and expanding data that allow models to learn more effectively. The lack \nof guidelines for selecting the right LLMs for coding tasks makes the selection a \nsubjective choice by developers rather than a choice built on code complexity, code\nCites: Refining chatgpt-generated code: Characterizing and mitigating", "link": "https://scholar.google.com/scholar_url?url=https://www.mdpi.com/2073-431X/15/2/119&hl=en&sa=X&d=13499206692228798048&ei=WieTae6iF5GrieoPqY6x-Qo&scisig=AFtJQizwsspowU1575iMUo5tjxxY&oi=scholaralrt&hist=ylyK0_8AAAAJ:4974034551180671527:AFtJQixSV7r1rt4PSjnxKJ5_Ev3p&html=&pos=1&folt=cit", "author": ["Bach Le"], "ref": ["3 new citations to articles by Bach Le", "10 new citations to articles by Abhik Roychoudhury", "1 new citation to articles by Thanh Le-Cong"]}
{"title": "Blockchain: Use of Smart Contracts in Finance", "first_label": ["Smart Contracts", "Blockchain"], "second_label": [], "data": "AR Thakur, C Tiwari, K Vats, G Sharma- Machine Learning and Blockchain, 2026\nThrough its decentralized architecture, blockchain technology has become a \ntransforming paradigm in the banking sector, revolutionizing established procedures. \nThis study analyzes the dynamic convergence of blockchain and finance, with an \nemphasis on smart contracts' essential role in altering financial transactions. It adds \nto the expanding knowledge of the practical uses and possibilities of this technology \nin the banking industry by investigating the uses, problems, and prospects of smart\nCites: Smart contract development: Challenges and opportunities  \n \nThis message was sent by Google Scholar because you're following new citations to articles written by \nBach Le\n.\nList alerts\nCancel alert", "link": "https://scholar.google.com/scholar_url?url=https://books.google.com/books%3Fhl%3Den%26lr%3Dlang_en%26id%3DgYPAEQAAQBAJ%26oi%3Dfnd%26pg%3DPA82%26ots%3DQCt615zzvm%26sig%3DpfJGJeF2uyaboYpYSPZOMo6xpsI&hl=en&sa=X&d=14140662968952145895&ei=WieTae6iF5GrieoPqY6x-Qo&scisig=AFtJQixcyvJ6cAgj5WppvBquHAUr&oi=scholaralrt&hist=ylyK0_8AAAAJ:4974034551180671527:AFtJQixSV7r1rt4PSjnxKJ5_Ev3p&html=&pos=2&folt=cit", "author": ["Bach Le"], "ref": ["3 new citations to articles by Bach Le"]}
{"title": "Beyond Function-Level Analysis: Context-Aware Reasoning for Inter-Procedural Vulnerability Detection", "first_label": ["Vulnerabilities"], "second_label": ["Detection", "Reasoning"], "data": "Y Li, T Zhang, J Shi, C Yang, J He, X Zhou, J Jiang- arXiv preprint arXiv, 2026\nRecent progress in ML and LLMs has improved vulnerability detection, and recent \ndatasets have reduced label noise and unrelated code changes. However, most \nexisting approaches still operate at the function level, where models are asked to \npredict whether a single function is vulnerable without inter-procedural context. In \npractice, vulnerability presence and root cause often depend on contextual \ninformation. Naively appending such context is not a reliable solution: real-world\nCites: Out of Distribution, Out of Luck: How Well Can LLMs Trained on", "link": "https://scholar.google.com/scholar_url?url=https://arxiv.org/pdf/2602.06751&hl=en&sa=X&d=9386240040200851524&ei=WyeTaeeQM6ztieoPmJCr6A0&scisig=AFtJQiwJGTejGVwrlH-8GsUfBXoG&oi=scholaralrt&hist=ylyK0_8AAAAJ:15035864585353249078:AFtJQizgrvX4EwoIvgLYGvi8jdIk&html=&pos=0&folt=cit", "author": ["Xin ZHOU"], "ref": ["4 new citations to articles by Xin ZHOU", "Thanh Le-Cong - new related research", "Bach Le - new related research", "Quang-Cuong Bui - new related research", "4 new citations to articles by Hong Jin Kang"]}
{"title": "Healthcare in the Age of LLMs: Perspectives on Radiology", "first_label": ["LLM"], "second_label": [], "data": "R Ghosh, S Asaadi, SK Karn, U Ullaskrishnan, O Farri- Artificial Intelligence and Large\nWith the rapid development of large language models (LLMs) in real-world \nscenarios, their potential impact on healthcare has attracted attention from academic \nresearchers, healthcare professionals, and industries. As radiology plays a crucial \nrole in providing quality healthcare and achieving the best possible patient \noutcomes, recent research has explored the applications of LLMs in this field. This \nchapter provides details of the recent research on LLMs and their potentials in\nCites: Large language model for vulnerability detection and repair", "link": "https://scholar.google.com/scholar_url?url=https://api.taylorfrancis.com/content/chapters/edit/download%3FidentifierName%3Ddoi%26identifierValue%3D10.1201/9781003492252-5%26type%3Dchapterpdf&hl=en&sa=X&d=529882995166421541&ei=WyeTaeeQM6ztieoPmJCr6A0&scisig=AFtJQiwhNAEt6o3-qXyUi93nnHnE&oi=scholaralrt&hist=ylyK0_8AAAAJ:15035864585353249078:AFtJQizgrvX4EwoIvgLYGvi8jdIk&html=&pos=1&folt=cit", "author": ["Xin ZHOU"], "ref": ["4 new citations to articles by Xin ZHOU"]}
{"title": "Fix Pattern-Aware Vulnerability Patch Generation via In-Context Learning", "first_label": ["Vulnerabilities"], "second_label": ["Generation"], "data": "M Shao, Y Ding, C Gao, J Wang, G Zhu- ACM Transactions on Software Engineering, 2026\nWith the rapid advancement of deep learning technologies, numerous large \nlanguage models (LLMs) have been developed, achieving remarkable performance \nacross various tasks. Nevertheless, in the field of vulnerability patch generation, \nprevious studies still face notable limitations:(1) Insufficient context. LLM-based \napproaches often rely on a single vulnerable function as prompt input for generating \npatches, which prevents the model from utilizing adequate contextual information\nCites: Out of Sight, Out of Mind: Better Automatic Vulnerability Repair by", "link": "https://scholar.google.com/scholar_url?url=https://dl.acm.org/doi/pdf/10.1145/3796512&hl=en&sa=X&d=5144184502671110081&ei=WyeTaeeQM6ztieoPmJCr6A0&scisig=AFtJQix6mxmA-RQdNz8sCXt__-xh&oi=scholaralrt&hist=ylyK0_8AAAAJ:15035864585353249078:AFtJQizgrvX4EwoIvgLYGvi8jdIk&html=&pos=2&folt=cit", "author": ["Xin ZHOU"], "ref": ["4 new citations to articles by Xin ZHOU", "David Lo - new related research", "Thanh Le-Cong - new related research", "Bach Le - new related research", "10 new citations to articles by Abhik Roychoudhury", "Quang-Cuong Bui - new related research", "Hong Jin Kang - new related research"]}
{"title": "Fixing Security Vulnerabilities with Agentic AI in OSS-Fuzz", "first_label": ["Vulnerabilities", "Fuzzing"], "second_label": ["Agent"], "data": "Y Zhang, J Wang, D Berzin, M Mirchev - 2026\nCritical open source software systems undergo significant validation in the form of \nlengthy fuzz campaigns. The fuzz campaigns typically conduct a biased random \nsearch over the domain of program inputs, to find inputs which crash the software \nsystem. Such fuzzing is useful to enhance the security of software systems in general \nsince even closed source software may use open-source components. Hence testing \nopen source software is of paramount importance. Currently OSS-Fuzz is the most\nCites: Out of Sight, Out of Mind: Better Automatic Vulnerability Repair by  \n \nThis message was sent by Google Scholar because you're following new citations to articles written by \nXin ZHOU\n.\nList alerts\nCancel alert", "link": "https://scholar.google.com/scholar_url?url=https://yuntongzhang.github.io/assets/pdf/icse26-seip.pdf&hl=en&sa=X&d=4792501545126369020&ei=WyeTaeeQM6ztieoPmJCr6A0&scisig=AFtJQixS4G4YCUmO3uVf_dteYhb9&oi=scholaralrt&hist=ylyK0_8AAAAJ:15035864585353249078:AFtJQizgrvX4EwoIvgLYGvi8jdIk&html=&pos=3&folt=cit", "author": ["Xin ZHOU"], "ref": ["4 new citations to articles by Xin ZHOU", "Bach Le - new related research", "Quang-Cuong Bui - new related research"]}
{"title": "Can test cases generated by large language models facilitate automated program repair?", "first_label": ["APR", "LLM", "Software Testing"], "second_label": ["Repair"], "data": "C Zhang, H Wang, C Xu, J Liu, K Liu, Z Liu- Empirical Software Engineering, 2026\nAutomated program repair (APR) is proposed to reduce manual debugging efforts by \nautomatically fixing buggy programs. Traditional APR techniques rely heavily on test \ncases, categorized into trigger-based and trigger-free approaches. While trigger", "link": "https://scholar.google.com/scholar_url?url=https://link.springer.com/article/10.1007/s10664-026-10802-w&hl=en&sa=X&d=4207338434968221293&ei=WieTae-NKNWi6rQPx6qOwQE&scisig=AFtJQizvbwSABIjAc_VAixoaG-x3&oi=scholaralrt&hist=ylyK0_8AAAAJ:5865787842749446205:AFtJQixqZ_1Evf2rQF6BxtODMMeG&html=&pos=0&folt=rel", "author": ["David Lo"], "ref": ["David Lo - new related research", "Thanh Le-Cong - new related research", "Bach Le - new related research", "Abhik Roychoudhury - new related research", "Xin ZHOU - new related research", "Quang-Cuong Bui - new related research"]}
{"title": "SWE-Bench Mobile: Can Large Language Model Agents Develop Industry-Level Mobile Applications?", "first_label": ["LLM"], "second_label": ["Agent"], "data": "M Tian, Z Wang, B Yang, Z Tang, K Zhu, H Dong, H Li- arXiv preprint arXiv, 2026\nCan large language model agents develop industry-level mobile applications? We \nintroduce\\textbf {SWE-Bench Mobile}, a benchmark for evaluating coding agents on \nrealistic software engineering tasks derived from a production iOS codebase. Unlike", "link": "https://scholar.google.com/scholar_url?url=https://arxiv.org/pdf/2602.09540&hl=en&sa=X&d=14081300322581465661&ei=WieTae-NKNWi6rQPx6qOwQE&scisig=AFtJQiyUh8A80RRIhqztMdU1lmjN&oi=scholaralrt&hist=ylyK0_8AAAAJ:5865787842749446205:AFtJQixqZ_1Evf2rQF6BxtODMMeG&html=&pos=2&folt=rel", "author": ["David Lo"], "ref": ["David Lo - new related research", "10 new citations to articles by Abhik Roychoudhury", "Xin ZHOU - new related research"]}
{"title": "From LLMs to Agents in Programming: The Impact of Providing an LLM with a Compiler", "first_label": ["LLM"], "second_label": ["Agent"], "data": "V Kjellberg, M Staron, F Fotrousi- arXiv preprint arXiv:2601.12146, 2026\nLarge Language Models have demonstrated a remarkable capability in natural \nlanguage and program generation and software development. However, the source \ncode generated by the LLMs does not always meet quality requirements and may fail", "link": "https://scholar.google.com/scholar_url?url=https://arxiv.org/pdf/2601.12146&hl=en&sa=X&d=11329828215171022159&ei=WieTae-NKNWi6rQPx6qOwQE&scisig=AFtJQiypYK-nJumHbrrIclP2Ho-j&oi=scholaralrt&hist=ylyK0_8AAAAJ:5865787842749446205:AFtJQixqZ_1Evf2rQF6BxtODMMeG&html=&pos=3&folt=rel", "author": ["David Lo"], "ref": ["David Lo - new related research"]}
{"title": "SVRepair: Structured Visual Reasoning for Automated Program Repair", "first_label": ["APR"], "second_label": ["Repair", "Reasoning"], "data": "X Tang, J Wang, L Luo, J Xu, S Zhou, D Chen, W Jiang- arXiv preprint arXiv, 2026\nLarge language models (LLMs) have recently shown strong potential for Automated \nProgram Repair (APR), yet most existing approaches remain unimodal and fail to \nleverage the rich diagnostic signals contained in visual artifacts such as screenshots", "link": "https://scholar.google.com/scholar_url?url=https://arxiv.org/pdf/2602.06090&hl=en&sa=X&d=9534851605678911344&ei=WieTae-NKNWi6rQPx6qOwQE&scisig=AFtJQizezMATcAPs2IBXC7k_tPld&oi=scholaralrt&hist=ylyK0_8AAAAJ:5865787842749446205:AFtJQixqZ_1Evf2rQF6BxtODMMeG&html=&pos=4&folt=rel", "author": ["David Lo"], "ref": ["David Lo - new related research", "Thanh Le-Cong - new related research", "Bach Le - new related research", "Xin ZHOU - new related research", "Quang-Cuong Bui - new related research"]}
{"title": "CosFormer: A Code Semantic-Aware Transformer for Vulnerability Detection", "first_label": ["Vulnerabilities", "Code"], "second_label": ["Detection"], "data": "Q Wei, Z Zhang, Q Yi, Z Ji, H Liang- IEEE Transactions on Software Engineering, 2026\nDeep learning-based vulnerability detection has made significant strides, surpassing \ntraditional static and dynamic analysis methods. However, existing approaches, \nincluding Graph Neural Networks (GNNs) and Transformer-based models, still", "link": "https://scholar.google.com/scholar_url?url=https://ieeexplore.ieee.org/abstract/document/11369426/&hl=en&sa=X&d=13888109705689379279&ei=WieTae-NKNWi6rQPx6qOwQE&scisig=AFtJQizmheSN2KXoigeOUKJC5kbz&oi=scholaralrt&hist=ylyK0_8AAAAJ:5865787842749446205:AFtJQixqZ_1Evf2rQF6BxtODMMeG&html=&pos=5&folt=rel", "author": ["David Lo"], "ref": ["David Lo - new related research", "Thanh Le-Cong - new related research", "10 new citations to articles by Abhik Roychoudhury", "Xin ZHOU - new related research", "Hong Jin Kang - new related research"]}
{"title": "Robust vulnerability detection with limited data via training-efficient adversarial reprogramming", "first_label": ["Vulnerabilities"], "second_label": ["Detection"], "data": "Z Tian, C Zhang, Y Hui, J Sun, Y Chen, L Chen- Automated Software Engineering, 2026\nThe substantial increase in software vulnerabilities poses a significant threat to \nsystem security, prompting a surge of interest in applying deep learning (DL) to \nvulnerability detection. However, current DL-based detectors heavily rely on large", "link": "https://scholar.google.com/scholar_url?url=https://link.springer.com/article/10.1007/s10515-026-00590-4&hl=en&sa=X&d=13072220572394107434&ei=WieTae-NKNWi6rQPx6qOwQE&scisig=AFtJQiyR-70P9rAixdNWHD5n4_ra&oi=scholaralrt&hist=ylyK0_8AAAAJ:5865787842749446205:AFtJQixqZ_1Evf2rQF6BxtODMMeG&html=&pos=6&folt=rel", "author": ["David Lo"], "ref": ["David Lo - new related research", "Thanh Le-Cong - new related research"]}
{"title": "Code vs Serialized AST Inputs for LLM-Based Code Summarization: An Empirical Study", "first_label": ["LLM", "Code"], "second_label": [], "data": "S Dong, H Zhao, P Harvey- arXiv preprint arXiv:2602.06671, 2026\nSummarizing source code into natural language descriptions (code summarization) \nhelps developers better understand program functionality and reduce the burden of \nsoftware maintenance. Abstract Syntax Trees (ASTs), as opposed to source code", "link": "https://scholar.google.com/scholar_url?url=https://arxiv.org/pdf/2602.06671&hl=en&sa=X&d=6267645134411048721&ei=WieTae-NKNWi6rQPx6qOwQE&scisig=AFtJQizhKXptXXYfpaX1N9pvLTil&oi=scholaralrt&hist=ylyK0_8AAAAJ:5865787842749446205:AFtJQixqZ_1Evf2rQF6BxtODMMeG&html=&pos=7&folt=rel", "author": ["David Lo"], "ref": ["David Lo - new related research", "Xin ZHOU - new related research"]}
{"title": "LogGen: Integrating Traditional Model and LLM with Code Analysis for Precise Log Generation", "first_label": ["LLM", "Code"], "second_label": ["Generation"], "data": "M Li, G Tan, P Chen, C Zhang- Journal of Systems and Software, 2026\nLogging is a crucial method for the runtime monitoring and measurement of program \nstates. However, in large-scale projects, variations in developer experience lead to \nsignificant differences in the key information within log statements, making it", "link": "https://scholar.google.com/scholar_url?url=https://www.sciencedirect.com/science/article/pii/S0164121226000506&hl=en&sa=X&d=8993015369947446517&ei=WieTae-NKNWi6rQPx6qOwQE&scisig=AFtJQixUmgjseFgzx194LJylO4-L&oi=scholaralrt&hist=ylyK0_8AAAAJ:5865787842749446205:AFtJQixqZ_1Evf2rQF6BxtODMMeG&html=&pos=8&folt=rel", "author": ["David Lo"], "ref": ["David Lo - new related research"]}
{"title": "CEVD: Cluster-Based Ensemble Learning for Cross-Project Vulnerability Detection", "first_label": ["Vulnerabilities"], "second_label": ["Detection"], "data": "Y Cao, Y Dong, J Liu- Future Internet, 2026\nDeep learning has become an important approach for automated software \nvulnerability detection. However, due to domain shift, existing models often suffer \nfrom significant performance degradation when applied to unseen projects. To\n \nThis message was sent by Google Scholar because you're following new articles related to research by \nDavid Lo\n.\nList alerts\nCancel alert", "link": "https://scholar.google.com/scholar_url?url=https://www.mdpi.com/1999-5903/18/2/85&hl=en&sa=X&d=11361810280116373882&ei=WieTae-NKNWi6rQPx6qOwQE&scisig=AFtJQixteXkMeIuNakGpEmh4ESUL&oi=scholaralrt&hist=ylyK0_8AAAAJ:5865787842749446205:AFtJQixqZ_1Evf2rQF6BxtODMMeG&html=&pos=9&folt=rel", "author": ["David Lo"], "ref": ["David Lo - new related research", "Thanh Le-Cong - new related research", "Xin ZHOU - new related research", "Quang-Cuong Bui - new related research"]}
{"title": "VulDeNoise: Outlier Detection to Reduce Label Noises for Effective Vulnerability Detection", "first_label": ["Vulnerabilities"], "second_label": ["Detection"], "data": "Y Hu, S Wang, Y Ji, Y Wu, D Zou- ACM Transactions on Software Engineering and, 2026\nWhile automated vulnerability detection approaches, especially those using Graph \nNeural Networks (GNNs), have shown remarkable promise, their effectiveness is \noften constrained by significant label noise in prevalent vulnerability datasets. To", "link": "https://scholar.google.com/scholar_url?url=https://dl.acm.org/doi/pdf/10.1145/3787972&hl=en&sa=X&d=5854979812176180712&ei=WSeTaYe7MoS4ieoPory9wAQ&scisig=AFtJQixNO2FdGlz6jUWCrnUjYWnZ&oi=scholaralrt&hist=ylyK0_8AAAAJ:4812769200119993430:AFtJQixMW5fth2vCkVauzao3YcYJ&html=&pos=7&folt=rel", "author": ["Thanh Le-Cong"], "ref": ["Thanh Le-Cong - new related research", "Quang-Cuong Bui - new related research", "Hong Jin Kang - new related research"]}
{"title": "CodeOCR: On the Effectiveness of Vision Language Models in Code Understanding", "first_label": ["LLM", "Code"], "second_label": [], "data": "Y Shi, C Xie, Z Sun, Y Chen, C Zhang, L Yun, C Wan- arXiv preprint arXiv, 2026\nLarge Language Models (LLMs) have achieved remarkable success in source code \nunderstanding, yet as software systems grow in scale, computational efficiency has \nbecome a critical bottleneck. Currently, these models rely on a text-based paradigm\n \nThis message was sent by Google Scholar because you're following new articles related to research by \nThanh Le-Cong\n.\nList alerts\nCancel alert", "link": "https://scholar.google.com/scholar_url?url=https://arxiv.org/pdf/2602.01785&hl=en&sa=X&d=8950840893641363657&ei=WSeTaYe7MoS4ieoPory9wAQ&scisig=AFtJQiwPlJiZYwqRlCm67aNU_6dg&oi=scholaralrt&hist=ylyK0_8AAAAJ:4812769200119993430:AFtJQixMW5fth2vCkVauzao3YcYJ&html=&pos=9&folt=rel", "author": ["Thanh Le-Cong"], "ref": ["Thanh Le-Cong - new related research", "Abhik Roychoudhury - new related research", "Xin ZHOU - new related research", "Hong Jin Kang - new related research"]}
{"title": "Semantic Consensus Decoding: Backdoor Defense for Verilog Code Generation", "first_label": ["Code"], "second_label": ["Generation"], "data": "G Yang, X Hu, X Chen, X Xia- arXiv preprint arXiv:2602.04195, 2026\nLarge language models (LLMs) for Verilog code generation are increasingly adopted \nin hardware design, yet remain vulnerable to backdoor attacks where adversaries \ninject malicious triggers during training to induce vulnerable hardware designs", "link": "https://scholar.google.com/scholar_url?url=https://arxiv.org/pdf/2602.04195&hl=en&sa=X&d=13381213390212302915&ei=WSeTaby1IM7P6rQPj56zgAU&scisig=AFtJQixGC92FNBSeggknWE5vzyxu&oi=scholaralrt&hist=ylyK0_8AAAAJ:4328508672846969495:AFtJQiwGkInjySrDZ0ydjfwVMTwh&html=&pos=3&folt=rel", "author": ["Bach Le"], "ref": ["Bach Le - new related research"]}
{"title": "Mutants Will Tell: Statistical Mutation-based Multiple Fault Localization for Deep Learning Programs", "first_label": ["Fault Localization"], "second_label": ["Localization"], "data": "H Xie, Z Deng, Y Lei, M Li, M Yan, D Lo- IEEE Transactions on Software Engineering, 2026\nAs deep learning (DL) systems are increasingly deployed in safety-critical domains, \neg, intelligent planning and autonomous driving, localizing faults that occur in such \nsystems becomes indispensable. Inevitably, DL systems also suffer from faults like", "link": "https://scholar.google.com/scholar_url?url=https://ieeexplore.ieee.org/abstract/document/11359137/&hl=en&sa=X&d=2063265024169399023&ei=WSeTaby1IM7P6rQPj56zgAU&scisig=AFtJQiyTITxKrhGviy05phEkxk4W&oi=scholaralrt&hist=ylyK0_8AAAAJ:4328508672846969495:AFtJQiwGkInjySrDZ0ydjfwVMTwh&html=&pos=4&folt=rel", "author": ["Bach Le"], "ref": ["Bach Le - new related research"]}
{"title": "TraceCoder: A Trace-Driven Multi-Agent Framework for Automated Debugging of LLM-Generated Code", "first_label": ["LLM", "Code", "Bug"], "second_label": ["Agent"], "data": "J Huang, W Ye, W Sun, J Zhang, M Zhang, Y Liu- arXiv preprint arXiv:2602.06875, 2026\nLarge Language Models (LLMs) often generate code with subtle but critical bugs, \nespecially for complex tasks. Existing automated repair methods typically rely on \nsuperficial pass/fail signals, offering limited visibility into program behavior and", "link": "https://scholar.google.com/scholar_url?url=https://arxiv.org/pdf/2602.06875&hl=en&sa=X&d=8290921255397330872&ei=WSeTaby1IM7P6rQPj56zgAU&scisig=AFtJQixF2rirNrkrLZ71KNAwyNAO&oi=scholaralrt&hist=ylyK0_8AAAAJ:4328508672846969495:AFtJQiwGkInjySrDZ0ydjfwVMTwh&html=&pos=5&folt=rel", "author": ["Bach Le"], "ref": ["Bach Le - new related research", "10 new citations to articles by Abhik Roychoudhury", "Xin ZHOU - new related research"]}
{"title": "Applying Genetic Improvement Techniques for Automated Program Repair of Transpiled Code", "first_label": ["APR", "Code"], "second_label": ["Repair"], "data": "P Jadhwani, C Hanna, WB Langdon, J Petke - 2026\nAbstract We use Genetic Improvement (GI)-based Automated Program Repair (APR) \ntechniques for syntax correction on transpiled code produced by both large language \nmodels (LLMs) and rule-based translators. A three-stage pipeline was developed\n \nThis message was sent by Google Scholar because you're following new articles related to research by \nBach Le\n.\nList alerts\nCancel alert", "link": "https://scholar.google.com/scholar_url?url=https://solar.cs.ucl.ac.uk/pdf/jadhwani_2026_GI.pdf&hl=en&sa=X&d=13783144409736868752&ei=WSeTaby1IM7P6rQPj56zgAU&scisig=AFtJQiy1MrTVjmbDSC1umDq8g1U0&oi=scholaralrt&hist=ylyK0_8AAAAJ:4328508672846969495:AFtJQiwGkInjySrDZ0ydjfwVMTwh&html=&pos=9&folt=rel", "author": ["Bach Le"], "ref": ["Bach Le - new related research"]}
{"title": "AgentStepper: Interactive Debugging of Software Development Agents", "first_label": ["Bug"], "second_label": ["Agent"], "data": "R Hutter, M Pradel- arXiv preprint arXiv:2602.06593, 2026\nSoftware development agents powered by large language models (LLMs) have \nshown great promise in automating tasks like environment setup, issue solving, and \nprogram repair. Unfortunately, understanding and debugging such agents remain \nchallenging due to their complex and dynamic nature. Developers must reason \nabout trajectories of LLM queries, tool calls, and code modifications, but current \ntechniques reveal little of this intermediate process in a comprehensible format. The\nCites: Agentic AI Software Engineers: Programming with Trust", "link": "https://scholar.google.com/scholar_url?url=https://arxiv.org/pdf/2602.06593&hl=en&sa=X&d=2723541956034309745&ei=WieTaaTpNp2zieoPncTR-Q4&scisig=AFtJQizuz4yj2wYZYbkELvEh-TtA&oi=scholaralrt&hist=ylyK0_8AAAAJ:10071049626428824134:AFtJQizt-yLRFgGPhW4jiXxK1QJN&html=&pos=0&folt=cit", "author": ["Abhik Roychoudhury"], "ref": ["10 new citations to articles by Abhik Roychoudhury"]}
{"title": "Rethinking the Value of Agent-Generated Tests for LLM-Based Software Engineering Agents", "first_label": ["LLM", "Software Testing"], "second_label": ["Agent"], "data": "Z Chen, Z Sun, Y Shi, C Peng, X Gu, D Lo, L Jiang- arXiv preprint arXiv:2602.07900, 2026\nLarge Language Model (LLM) code agents increasingly resolve repository-level \nissues by iteratively editing code, invoking tools, and validating candidate patches. In \nthese workflows, agents often write tests on the fly, a paradigm adopted by many \nhigh-ranking agents on the SWE-bench leaderboard. However, we observe that GPT-\n5.2, which writes almost no new tests, can even achieve performance comparable to \ntop-ranking agents. This raises the critical question: whether such tests meaningfully\nCites: SpecRover: Code Intent Extraction via LLMs", "link": "https://scholar.google.com/scholar_url?url=https://arxiv.org/pdf/2602.07900&hl=en&sa=X&d=13794421312290011201&ei=WieTaaTpNp2zieoPncTR-Q4&scisig=AFtJQiyAjjaeENj8CVxFbHTZYcCE&oi=scholaralrt&hist=ylyK0_8AAAAJ:10071049626428824134:AFtJQizt-yLRFgGPhW4jiXxK1QJN&html=&pos=1&folt=cit", "author": ["Abhik Roychoudhury"], "ref": ["10 new citations to articles by Abhik Roychoudhury"]}
{"title": "Scalable hierarchical protocol format inference via feature-heuristic message delimiter", "first_label": [], "second_label": [], "data": "B Hu, W Zhang, Y Zhao, Z Luo, K Liang, R Shi, Y Jiang- Empirical Software, 2026\nProtocol reverse engineering plays a critical role for Vulnerability Discovery and \nSecurity Analysis. Protocol reverse engineering tools based on network traffic \nanalyze captured communication data to infer protocol formats and semantics. \nHowever, these methods globally cluster messages and analyze each cluster \nseparately, which causes the loss of valuable field information. To address this \nproblem, we present, a protocol reverse engineering tool that leverages the\nCites: BLEEM: Packet Sequence Oriented Fuzzing for Protocol", "link": "https://scholar.google.com/scholar_url?url=https://link.springer.com/article/10.1007/s10664-026-10814-6&hl=en&sa=X&d=6644717564824622314&ei=WieTaaTpNp2zieoPncTR-Q4&scisig=AFtJQiwp0o6QbldX_TECKUHs9jwU&oi=scholaralrt&hist=ylyK0_8AAAAJ:10071049626428824134:AFtJQizt-yLRFgGPhW4jiXxK1QJN&html=&pos=3&folt=cit", "author": ["Abhik Roychoudhury"], "ref": ["10 new citations to articles by Abhik Roychoudhury"]}
{"title": "Artisan: Agentic Artifact Evaluation", "first_label": [], "second_label": ["Agent"], "data": "D Baek, M Pradel- arXiv preprint arXiv:2602.10046, 2026\nArtifact evaluation has become standard practice in the software engineering \ncommunity to ensure the reproducibility of research results. However, the current \nmanual process is labor-intensive, and hence, done only as a one-time assessment \nfor a subset of all papers. To support the artifact evaluation effort, we present Artisan, \nan automated LLM agent for reproducing research results given a paper and its \nartifact. The approach is enabled by two key contributions: First, we frame the\nCites: ProveNFix: Temporal Property guided Program Repair", "link": "https://scholar.google.com/scholar_url?url=https://arxiv.org/pdf/2602.10046&hl=en&sa=X&d=15705663301433800569&ei=WieTaaTpNp2zieoPncTR-Q4&scisig=AFtJQixXlY-5Yxh-7djXgJ5t-TWk&oi=scholaralrt&hist=ylyK0_8AAAAJ:10071049626428824134:AFtJQizt-yLRFgGPhW4jiXxK1QJN&html=&pos=6&folt=cit", "author": ["Abhik Roychoudhury"], "ref": ["10 new citations to articles by Abhik Roychoudhury"]}
{"title": "RTSGen: RFC and Traffic-Guided Seed Generation via LLM for Network Protocol Fuzzing", "first_label": ["LLM", "Fuzzing"], "second_label": ["Generation"], "data": "Y Zhang, K Zhu, J Zhao, Y Lu, J Peng- 2025 10th International Conference on Cyber, 2025\nNetwork protocol fuzzing efficacy is critically limited by seed quality. Existing methods \nface a dilemma: seeds from real traffic lack diversity, restricting state-space \nexploration, while Request for Comments (RFC)-guided synthetic seeds often suffer \nfrom low validity, causing parser rejection. We propose RTSGen, a novel framework \nthat synergistically fuses distilled RFC knowledge (structured constraints, methods, \nheaders) and traffic-derived patterns (empirical templates, variations) into a\nCites: Large language model guided protocol fuzzing", "link": "https://scholar.google.com/scholar_url?url=https://ieeexplore.ieee.org/abstract/document/11369025/&hl=en&sa=X&d=11813350722333613723&ei=WieTaaTpNp2zieoPncTR-Q4&scisig=AFtJQiyg5_eH4YuYliOffuriMkcw&oi=scholaralrt&hist=ylyK0_8AAAAJ:10071049626428824134:AFtJQizt-yLRFgGPhW4jiXxK1QJN&html=&pos=7&folt=cit", "author": ["Abhik Roychoudhury"], "ref": ["10 new citations to articles by Abhik Roychoudhury"]}
{"title": "Testing like Mad Libs: Fuzzing SMT Solvers with Historical Unusual Inputs Empowered by LLMs", "first_label": ["LLM", "Fuzzing", "Software Testing"], "second_label": [], "data": "M Sun, Y Yang, H Jia, J Wu, Q Li, Z Xie, M Wen, Y Zhou- ACM Transactions on, 2026\nEnsuring the correctness of Satisfiability Modulo Theory (SMT) solvers is of \nparamount importance, as it serves as the cornerstone of a broad spectrum of critical \nsoftware engineering practices. Consequently, various methodologies have been", "link": "https://scholar.google.com/scholar_url?url=https://dl.acm.org/doi/pdf/10.1145/3796526&hl=en&sa=X&d=10272753077585114453&ei=WyeTab-hF7ev6rQPv-TlgAU&scisig=AFtJQizylRxvEu5CtIElx8ScNU2S&oi=scholaralrt&hist=ylyK0_8AAAAJ:12723761785867032729:AFtJQiwlQ81H-aGckuzBfBFA83Tf&html=&pos=1&folt=rel", "author": ["Abhik Roychoudhury"], "ref": ["Abhik Roychoudhury - new related research", "Hong Jin Kang - new related research"]}
{"title": "Themis: Detecting Distributed Concurrency Bugs through RPC-Driven Race-Directed Test Generation and Fuzzing", "first_label": ["Fuzzing", "Bug", "Software Testing"], "second_label": ["Detection", "Generation"], "data": "H Cao, J He, T Dai, G Jin\nThemis: Detecting Distributed Concurrency Bugs through RPC-Driven Race-Directed \n\r\nTest Generation and Fuzzing | USENIX Back to USENIX Sign In Conferences \n\r\nRegister Now Attend Registration Information Registration Discounts Grant\n \nThis message was sent by Google Scholar because you're following new articles related to research by \nAbhik Roychoudhury\n.\nList alerts\nCancel alert", "link": "https://scholar.google.com/scholar_url?url=https://www.usenix.org/conference/nsdi26/presentation/cao&hl=en&sa=X&d=2941690224183892979&ei=WyeTab-hF7ev6rQPv-TlgAU&scisig=AFtJQiw_ZJpHJe1Q5tmi8eoWVZPz&oi=scholaralrt&hist=ylyK0_8AAAAJ:12723761785867032729:AFtJQiwlQ81H-aGckuzBfBFA83Tf&html=&pos=3&folt=rel", "author": ["Abhik Roychoudhury"], "ref": ["Abhik Roychoudhury - new related research", "Quang-Cuong Bui - new related research"]}
{"title": "Not All Code Is Equal: A Data-Centric Study of Code Complexity and LLM Reasoning", "first_label": ["LLM", "Code"], "second_label": ["Reasoning"], "data": "L Twist, S Yang, H Yan, J Gong, D Wang- arXiv preprint arXiv, 2026\nLarge Language Models (LLMs) increasingly exhibit strong reasoning abilities, often \nattributed to their capacity to generate chain-of-thought-style intermediate reasoning. \nRecent work suggests that exposure to code can further enhance these skills, but", "link": "https://scholar.google.com/scholar_url?url=https://arxiv.org/pdf/2601.21894&hl=en&sa=X&d=9127293985686143224&ei=XCeTaca-BNWi6rQPx6qOwQE&scisig=AFtJQiyd3HogYa5NH0fByvK7OiDF&oi=scholaralrt&hist=ylyK0_8AAAAJ:16898579961534012346:AFtJQizkAYsk28XMgdz9emRv1Jhw&html=&pos=7&folt=rel", "author": ["Xin ZHOU"], "ref": ["Xin ZHOU - new related research"]}
{"title": "TaintP2X: Detecting Taint-Style Prompt-to-Anything Injection Vulnerabilities in LLM-Integrated Applications", "first_label": ["Vulnerabilities", "LLM"], "second_label": ["Detection"], "data": "J He, S Wang, Y Zhao, X Hou, Z Liu, Q Zou, H Wang - 2026\nABSTRACT Large Language Models (LLMs) have revolutionized numerous \ndomains, enabling the development of LLM-integrated applications that \nautonomously plan and act through tool calling. While these applications\n \nThis message was sent by Google Scholar because you're following new articles related to research by \nXin ZHOU\n.\nList alerts\nCancel alert", "link": "https://scholar.google.com/scholar_url?url=https://shenaow.github.io/files/icse26taintp2x.pdf&hl=en&sa=X&d=6052335169794167826&ei=XCeTaca-BNWi6rQPx6qOwQE&scisig=AFtJQiw1ulFw6ZUFkLPjJCC8klQw&oi=scholaralrt&hist=ylyK0_8AAAAJ:16898579961534012346:AFtJQizkAYsk28XMgdz9emRv1Jhw&html=&pos=9&folt=rel", "author": ["Xin ZHOU"], "ref": ["Xin ZHOU - new related research"]}
{"title": "Autoregressive, Yet Revisable: In Decoding Revision for Secure Code Generation", "first_label": ["Code"], "second_label": ["Generation"], "data": "C Yang, Z Wei, H Deng, J Jiang, Z Sun, T Zhang, T Wu- arXiv preprint arXiv, 2026\nLarge Language Model (LLM) based code generation is predominantly formulated \nas a strictly monotonic process, appending tokens linearly to an immutable prefix. \nThis formulation contrasts to the cognitive process of programming, which is", "link": "https://scholar.google.com/scholar_url?url=https://arxiv.org/pdf/2602.01187&hl=en&sa=X&d=10631684213321071982&ei=WyeTadLhCOyi6rQP7vO32QM&scisig=AFtJQiyOADkHnGRkr10eJP7-z61z&oi=scholaralrt&hist=ylyK0_8AAAAJ:11088443020050739259:AFtJQiw4-5F9bAtpTLXfn9b00q5K&html=&pos=4&folt=rel", "author": ["Quang-Cuong Bui"], "ref": ["Quang-Cuong Bui - new related research"]}
{"title": "YASA: Scalable Multi-Language Taint Analysis on the Unified AST at Ant Group", "first_label": [], "second_label": [], "data": "Y Wang, S Wang, J Zhao, S Shi, T Li, Y Cheng, L Bian- arXiv preprint arXiv, 2026\nModern enterprises increasingly adopt diverse technology stacks with various \nprogramming languages, posing significant challenges for static application security \ntesting (SAST). Existing taint analysis tools are predominantly designed for single", "link": "https://scholar.google.com/scholar_url?url=https://arxiv.org/pdf/2601.17390&hl=en&sa=X&d=9043079926653874239&ei=WyeTadLhCOyi6rQP7vO32QM&scisig=AFtJQizSgyGx_KIlHOJ08LlMkHg9&oi=scholaralrt&hist=ylyK0_8AAAAJ:11088443020050739259:AFtJQiw4-5F9bAtpTLXfn9b00q5K&html=&pos=8&folt=rel", "author": ["Quang-Cuong Bui"], "ref": ["Quang-Cuong Bui - new related research"]}
{"title": "Sifting the Noise: A Comparative Study of LLM Agents in Vulnerability False Positive Filtering", "first_label": ["Vulnerabilities", "LLM"], "second_label": ["Agent"], "data": "Y Xiong, T Zhang- arXiv preprint arXiv:2601.22952, 2026\nStatic Application Security Testing (SAST) tools are essential for identifying software \nvulnerabilities, but they often produce a high volume of false positives (FPs), \nimposing a substantial manual triage burden on developers. Recent advances in", "link": "https://scholar.google.com/scholar_url?url=https://arxiv.org/pdf/2601.22952&hl=en&sa=X&d=15908405358255744538&ei=XCeTaYfgEO7QieoP9dTwkAI&scisig=AFtJQix3iBkzefv1pBOhuxy-Z29w&oi=scholaralrt&hist=ylyK0_8AAAAJ:17903213248891513419:AFtJQiyNBATNeSYOCbLu--r2TCtp&html=&pos=3&folt=rel", "author": ["Hong Jin Kang"], "ref": ["Hong Jin Kang - new related research"]}
{"title": "MaxSAT Fuzzing and Delta Debugging", "first_label": ["Fuzzing", "Bug"], "second_label": [], "data": "T Paxian, A Biere- Journal of Artificial Intelligence Research, 2026\nThis article presents the first systematic study to evaluate a suite of automated \nfuzzing techniques for Maximum Satisfiability (MaxSAT) solvers. It combines large-\nscale stress testing with a novel MaxSAT-specific delta debugging method to assess", "link": "https://scholar.google.com/scholar_url?url=https://www.jair.org/index.php/jair/article/download/19716/27264&hl=en&sa=X&d=3960144042187260907&ei=XCeTaYfgEO7QieoP9dTwkAI&scisig=AFtJQiyAfMXEG6bxIe3Ci1OX5s49&oi=scholaralrt&hist=ylyK0_8AAAAJ:17903213248891513419:AFtJQiyNBATNeSYOCbLu--r2TCtp&html=&pos=7&folt=rel", "author": ["Hong Jin Kang"], "ref": ["Hong Jin Kang - new related research"]}
{"title": "Knowledge distillation-driven commit-aware multimodal learning for software vulnerability detection", "first_label": ["Vulnerabilities"], "second_label": ["Detection"], "data": "R Mahouachi- Automated Software Engineering, 2026\nSoftware vulnerabilities are a major concern in cybersecurity, as even small flaws \ncan expose systems to serious risks. Most automated detection methods focus on a \nsingle sourceusually codelimiting their ability to capture the diverse ways", "link": "https://scholar.google.com/scholar_url?url=https://link.springer.com/article/10.1007/s10515-026-00595-z&hl=en&sa=X&d=15646205250339731931&ei=XCeTaYfgEO7QieoP9dTwkAI&scisig=AFtJQiyPQuVQfX_FTVqA7yXpLzBc&oi=scholaralrt&hist=ylyK0_8AAAAJ:17903213248891513419:AFtJQiyNBATNeSYOCbLu--r2TCtp&html=&pos=8&folt=rel", "author": ["Hong Jin Kang"], "ref": ["Hong Jin Kang - new related research"]}
{"title": "When Agents Fail: A Comprehensive Study of Bugs in LLM Agents with Automated Labeling", "first_label": ["LLM", "Bug"], "second_label": ["Agent"], "data": "N Islam, RS Ayon, DG Thomas, S Ahmed, M Wardat- arXiv preprint arXiv:2601.15232, 2026\nLarge Language Models (LLMs) have revolutionized intelligent application \ndevelopment. While standalone LLMs cannot perform any actions, LLM agents \naddress the limitation by integrating tools. However, debugging LLM agents is\n \nThis message was sent by Google Scholar because you're following new articles related to research by \nHong Jin Kang\n.\nList alerts\nCancel alert", "link": "https://scholar.google.com/scholar_url?url=https://arxiv.org/pdf/2601.15232&hl=en&sa=X&d=3478988133296608347&ei=XCeTaYfgEO7QieoP9dTwkAI&scisig=AFtJQix7K3sYMfTNmSYv9iyNpL_7&oi=scholaralrt&hist=ylyK0_8AAAAJ:17903213248891513419:AFtJQiyNBATNeSYOCbLu--r2TCtp&html=&pos=9&folt=rel", "author": ["Hong Jin Kang"], "ref": ["Hong Jin Kang - new related research"]}
{"title": "Evaluating and Enhancing the Vulnerability Reasoning Capabilities of Large Language Models", "first_label": ["Vulnerabilities", "LLM"], "second_label": ["Reasoning"], "data": "L Lu, Y Zhao, H Rao, K Zhang, H Wang- arXiv preprint arXiv:2602.06687, 2026\nLarge Language Models (LLMs) have demonstrated remarkable proficiency in \nvulnerability detection. However, a critical reliability gap persists: models frequently \nyield correct detection verdicts based on hallucinated logic or superficial patterns that \ndeviate from the actual root cause. This misalignment remains largely obscured \nbecause contemporary benchmarks predominantly prioritize coarse-grained \nclassification metrics, lacking the granular ground truth required to evaluate the\nCites: CleanVul: Automatic Function-Level Vulnerability Detection in", "link": "https://scholar.google.com/scholar_url?url=https://arxiv.org/pdf/2602.06687&hl=en&sa=X&d=8439481731002779974&ei=WieTacLSBumFieoP9paZcQ&scisig=AFtJQiwO0Dvn7Z2hbEwn3bv89rMm&oi=scholaralrt&hist=ylyK0_8AAAAJ:4851239734318863641:AFtJQiz5W5aJ7kb2ms-a12QvBoGR&html=&pos=1&folt=cit", "author": ["Hong Jin Kang"], "ref": ["4 new citations to articles by Hong Jin Kang"]}
{"title": "Neuroscale: scalable and constraint-aware neuro-symbolic optimization for edge-centric IoT systems: W. Abbass et al.", "first_label": [], "second_label": [], "data": "W Abbass, N Abbas, U Majeed- The Journal of Supercomputing, 2026\nThe rapid growth of Internet of Things (IoT) ecosystems has transformed distributed \ntask scheduling into a large-scale, real-time optimization problem that demands \nparallel and distributed processing across heterogeneous edge infrastructures. \nTraditional deep reinforcement learning (DRL) methods offer adaptability but lack \nformal mechanisms for enforcing hard constraints, while symbolic reasoning ensures \npolicy compliance and interpretability but does not scale to high-concurrency\nCites: Surveying neuro-symbolic approaches for reliable artificial", "link": "https://scholar.google.com/scholar_url?url=https://link.springer.com/article/10.1007/s11227-026-08262-6&hl=en&sa=X&d=15993057835745537534&ei=WieTacLSBumFieoP9paZcQ&scisig=AFtJQizxDQMGgYcdugj2gDkFDnen&oi=scholaralrt&hist=ylyK0_8AAAAJ:4851239734318863641:AFtJQiz5W5aJ7kb2ms-a12QvBoGR&html=&pos=2&folt=cit", "author": ["Hong Jin Kang"], "ref": ["4 new citations to articles by Hong Jin Kang"]}
