{"title": "Beyond Functional Correctness: Exploring Hallucinations in LLM-Generated Code", "first_label": ["LLM", "Code"], "second_label": [], "data": "F Liu, Y Liu, L Shi, Z Yang, L Zhang, X Lian, Z Li, Y Ma- IEEE Transactions on, 2026\nThe rise of Large Language Models (LLMs) has significantly advanced various \napplications on software engineering tasks, particularly in code generation. Despite \nthe promising performance, LLMs are prone to generate hallucinations, which means\n \nThis message was sent by Google Scholar because you're following new articles related to research by \nThanh Le-Cong\n.\nList alerts\nCancel alert", "link": "https://scholar.google.com/scholar_url?url=https://ieeexplore.ieee.org/abstract/document/11361549/&hl=en&sa=X&d=5742920928897379689&ei=AX57afG6M9aOieoPvbTB2Ao&scisig=AHkA5jRURP-mApB5SvpHATikE7N7&oi=scholaralrt&hist=ylyK0_8AAAAJ:4812769200119993430:AHkA5jS71y5YH911v9BWg5_Xgovk&html=&pos=0&folt=rel", "author": ["Thanh Le-Cong"], "ref": ["Thanh Le-Cong - new related research", "6 new citations to articles by Bach Le", "Xin ZHOU - new related research", "Hong Jin Kang - new related research", "David Lo - new related research", "4 new citations to articles by Thanh Le-Cong"]}
{"title": "Revisiting the Role of Natural Language Code Comments in Code Translation", "first_label": ["Code"], "second_label": ["Generation"], "data": "M Gupta, A Meena, AR Choudhury, V Arya, S Bedathur- arXiv preprint arXiv, 2026\nThe advent of large language models (LLMs) has ushered in a new era in automated \ncode translation across programming languages. Since most code-specific LLMs are \npretrained on well-commented code from large repositories like GitHub, it is \nreasonable to hypothesize that natural language code comments could aid in \nimproving translation quality. Despite their potential relevance, comments are largely \nabsent from existing code translation benchmarks, rendering their impact on\nCites: Unlocking LLM Repair Capabilities in Low-Resource Programming", "link": "https://scholar.google.com/scholar_url?url=https://arxiv.org/pdf/2601.16661&hl=en&sa=X&d=11069730183523124651&ei=An57aY-hBeu7ieoP6qqIwQQ&scisig=AHkA5jS0ET9J5svBDlRo1uzlU_EG&oi=scholaralrt&hist=ylyK0_8AAAAJ:4974034551180671527:AHkA5jSJKysCIe7aKJHkjio0etwZ&html=&pos=0&folt=cit", "author": ["Bach Le"], "ref": ["6 new citations to articles by Bach Le"]}
{"title": "The Effect of Employee Competence and Work Motivation on the Quality of Financial Reporting", "first_label": [], "second_label": [], "data": "M Irawati, AS Arief, M Yunus- Journal La Bisecoman, 2026\nThis study aims to determine whether employee competence and work motivation \nhave an influence on the quality of financial reporting at the Office of the Airport \nAuthority Region V Makassar. The data in this research were obtained through the \ndistribution of questionnaires as the primary instrument. The sampling technique \nused was the saturated sample method, where all members of the population were \nused as the research sample. Prior to its use, the research instrument was tested for\nCites: Refining chatgpt-generated code: Characterizing and mitigating", "link": "https://scholar.google.com/scholar_url?url=https://www.newinera.com/index.php/JournalLaBisecoman/article/download/2559/2284&hl=en&sa=X&d=15643844386861895813&ei=An57aY-hBeu7ieoP6qqIwQQ&scisig=AHkA5jR_eW6PUav3EF5jqK-JjLkd&oi=scholaralrt&hist=ylyK0_8AAAAJ:4974034551180671527:AHkA5jSJKysCIe7aKJHkjio0etwZ&html=&pos=1&folt=cit", "author": ["Bach Le"], "ref": ["6 new citations to articles by Bach Le", "4 new citations to articles by Thanh Le-Cong"]}
{"title": "Survey on Learning-based Dynamic Fault Localization: From Traditional Machine Learning to Large Language Models", "first_label": ["LLM", "Fault Localization"], "second_label": ["Localization"], "data": "C Liu, Y Lei, H Xie, J Wang, Y Yu, D Lo- ACM Computing Surveys\nLearning-based dynamic fault localization techniques play a crucial role in the field \nof software engineering. These techniques dynamically execute test cases to \nmeticulously extract useful knowledge from the execution information in the program, \nwith the aim of identifying fault locations by leveraging machine learning, deep \nlearning, and large language models. Currently, there is already a flourishing body of \nresearch that is intensely focused on learning-based dynamic fault localization\nCites: Thanh Le-Cong, Ratnadira Widyasari, Chakkrit Tantithamthavorn", "link": "https://scholar.google.com/scholar_url?url=https://dl.acm.org/doi/pdf/10.1145/3787202&hl=en&sa=X&d=3610641333845247826&ei=An57aY-hBeu7ieoP6qqIwQQ&scisig=AHkA5jS9ZUYy3cB-NmPOTnI5Rz0F&oi=scholaralrt&hist=ylyK0_8AAAAJ:4974034551180671527:AHkA5jSJKysCIe7aKJHkjio0etwZ&html=&pos=2&folt=cit", "author": ["Bach Le"], "ref": ["6 new citations to articles by Bach Le", "4 new citations to articles by Thanh Le-Cong", "1 new citation to articles by Xin ZHOU"]}
{"title": "Combining Tests and Proofs for Better Software Verification", "first_label": ["Verification", "Software Testing"], "second_label": [], "data": "L Huang, B Meyer, M Oriol- arXiv preprint arXiv:2601.16239, 2026\nTest or prove? These two approaches to software verification have long been \npresented as opposites. One is dynamic, the other static: a test executes the \nprogram, a proof only analyzes the program text. A different perspective is emerging, \nin which testing and proving are complementary rather than competing techniques \nfor producing software of verified quality. Work performed over the past few years \nand reviewed here develops this complementarity by taking advantage of Design by\nCites: More reliable test suites for dynamic APR by using counterexamples", "link": "https://scholar.google.com/scholar_url?url=https://arxiv.org/pdf/2601.16239&hl=en&sa=X&d=16521184339062724484&ei=An57aY-hBeu7ieoP6qqIwQQ&scisig=AHkA5jSA7H2FdDoygDY-7i4C6Q6q&oi=scholaralrt&hist=ylyK0_8AAAAJ:4974034551180671527:AHkA5jSJKysCIe7aKJHkjio0etwZ&html=&pos=4&folt=cit", "author": ["Bach Le"], "ref": ["6 new citations to articles by Bach Le"]}
{"title": "AI builds, We Analyze: An Empirical Study of AI-Generated Build Code Quality", "first_label": ["Code"], "second_label": [], "data": "A Ghammam, M Almukhtar- arXiv preprint arXiv:2601.16839, 2026\nThe rapid adoption of AI coding agents for software development has raised \nimportant questions about the quality and maintainability of the code they produce. \nWhile prior studies have examined AI-generated source code, the impact of AI \ncoding agents on build systems-a critical yet understudied component of the software \nlifecycle-remains largely unexplored. This data mining challenge focuses on AIDev, \nthe first large-scale, openly available dataset capturing agent-authored pull requests\nCites: Thanh Le-Cong, Ratnadira Widyasari, Chakkrit Tantithamthavorn  \n \nThis message was sent by Google Scholar because you're following new citations to articles written by \nBach Le\n.\nList alerts\nCancel alert", "link": "https://scholar.google.com/scholar_url?url=https://arxiv.org/pdf/2601.16839&hl=en&sa=X&d=11967973676725498114&ei=An57aY-hBeu7ieoP6qqIwQQ&scisig=AHkA5jRNo59mb5Du3zEHOiUv27BU&oi=scholaralrt&hist=ylyK0_8AAAAJ:4974034551180671527:AHkA5jSJKysCIe7aKJHkjio0etwZ&html=&pos=5&folt=cit", "author": ["Bach Le"], "ref": ["6 new citations to articles by Bach Le", "4 new citations to articles by Thanh Le-Cong"]}
{"title": "Endless Terminals: Scaling RL Environments for Terminal Agents", "first_label": [], "second_label": ["Agent"], "data": "K Gandhi, S Garg, ND Goodman, D Papailiopoulos- arXiv preprint arXiv:2601.16443, 2026\nEnvironments are the bottleneck for self-improving agents. Current terminal \nbenchmarks were built for evaluation, not training; reinforcement learning requires a \nscalable pipeline, not just a dataset. We introduce Endless Terminals, a fully", "link": "https://scholar.google.com/scholar_url?url=https://arxiv.org/pdf/2601.16443&hl=en&sa=X&d=18413063700636362685&ei=An57afqJL5i8ieoP-d-HsQ4&scisig=AHkA5jSfeR4ds_BUW2dnhRQAg5tx&oi=scholaralrt&hist=ylyK0_8AAAAJ:12723761785867032729:AHkA5jSbMrs1rwdzDT4Fnpwpokkm&html=&pos=0&folt=rel", "author": ["Abhik Roychoudhury"], "ref": ["Abhik Roychoudhury - new related research"]}
{"title": "Testing Certificate Authorities: An Empirical Study and Stateful Fuzzing Approach", "first_label": ["Fuzzing", "Software Testing"], "second_label": [], "data": "A Gunasekaran, M Chase, Z Ma, RB Bobba, M Motwani\nCertificate Authorities (CAs) form a critical component of the web PKI, implementing \nstandardized, stateful workflows for account management, domain validation, \ncertificate issuance, and revocation. Many modern CAs rely on the ACME (Automatic\n \nThis message was sent by Google Scholar because you're following new articles related to research by \nAbhik Roychoudhury\n.\nList alerts\nCancel alert", "link": "https://scholar.google.com/scholar_url?url=https://mmotwani.com/publications/publication_sources/Gunasekaran26.pdf&hl=en&sa=X&d=17474197403096883184&ei=An57afqJL5i8ieoP-d-HsQ4&scisig=AHkA5jTzqQS0FGnvtk6sE-mBxM_5&oi=scholaralrt&hist=ylyK0_8AAAAJ:12723761785867032729:AHkA5jSbMrs1rwdzDT4Fnpwpokkm&html=&pos=1&folt=rel", "author": ["Abhik Roychoudhury"], "ref": ["Abhik Roychoudhury - new related research", "9 new citations to articles by Abhik Roychoudhury"]}
{"title": "Cutting the Gordian Knot: Detecting Malicious PyPI Packages via a Knowledge-Mining Framework", "first_label": [], "second_label": ["Detection"], "data": "W Guo, C Liu, M Kang, Y Zhang, J Wu, Z Xu- arXiv preprint arXiv, 2026\nThe Python Package Index (PyPI) has become a target for malicious actors, yet \nexisting detection tools generate false positive rates of 15-30%, incorrectly flagging \none-third of legitimate packages as malicious. This problem arises because current \ntools rely on simple syntactic rules rather than semantic understanding, failing to \ndistinguish between identical API calls serving legitimate versus malicious purposes. \nTo address this challenge, we propose PyGuard, a knowledge-driven framework that\nCites: Detecting Python Malware in the Software Supply Chain with", "link": "https://scholar.google.com/scholar_url?url=https://arxiv.org/pdf/2601.16463&hl=en&sa=X&d=15083849863687852901&ei=An57afDSIeu7ieoP6qqIwQQ&scisig=AHkA5jS3TxqD0675V0qEbZxmsXJd&oi=scholaralrt&hist=ylyK0_8AAAAJ:10071049626428824134:AHkA5jQRfWoRNvJIMJ7ZeL1tZJbF&html=&pos=0&folt=cit", "author": ["Abhik Roychoudhury"], "ref": ["9 new citations to articles by Abhik Roychoudhury"]}
{"title": "Toward Agentic Software Project Management: A Vision and Roadmap", "first_label": [], "second_label": ["Agent"], "data": "LI Assalaarachchi, Z Masood, R Hoda, J Grundy- arXiv preprint arXiv:2601.16392, 2026\nWith the advent of agentic AI, Software Engineering is transforming to a new era \ndubbed Software Engineering 3.0. Software project management (SPM) must also \nevolve with such transformations to boost successful project completion, while \nkeeping humans at the heart of it. Building on our preliminary ideas of\" agentic SPM\", \nand supporting literature, we present our vision of an\" Agentic Project Manager (PM)\" \nas a multi-agent system for SPM 3.0. They will work like a\" junior project manager\", or\nCites: Agentic AI Software Engineers: Programming with Trust", "link": "https://scholar.google.com/scholar_url?url=https://arxiv.org/pdf/2601.16392&hl=en&sa=X&d=16978349427813250826&ei=An57afDSIeu7ieoP6qqIwQQ&scisig=AHkA5jT6fcYM0IFef44m_CwRJiUt&oi=scholaralrt&hist=ylyK0_8AAAAJ:10071049626428824134:AHkA5jQRfWoRNvJIMJ7ZeL1tZJbF&html=&pos=1&folt=cit", "author": ["Abhik Roychoudhury"], "ref": ["9 new citations to articles by Abhik Roychoudhury"]}
{"title": "iRUC: Reducing Inter-Microservice Data Communication in Data-Intensive Systems via Unified Computation", "first_label": [], "second_label": [], "data": "P Wang, R Liu, K Huang, X Du- IEEE Transactions on Software Engineering, 2026\nIn data-intensive microservice-based systems, frequent and large-scale inter-service \ncommunication poses a critical performance bottleneck, degrading throughput and \nescalating latency. Existing solutions exhibit notable limitations: microservice \nmerging sacrifices loose coupling and system evolvability; resource-aware \nscheduling enhances communication efficiency but fails to reduce data volume; \ndynamic deployment reduces network distances while introducing compute-resource\nCites: AutoCodeRover: Autonomous program improvement", "link": "https://scholar.google.com/scholar_url?url=https://ieeexplore.ieee.org/abstract/document/11360750/&hl=en&sa=X&d=10051727932843446727&ei=An57afDSIeu7ieoP6qqIwQQ&scisig=AHkA5jRNd53VFKXuKTb00Ew7WqJK&oi=scholaralrt&hist=ylyK0_8AAAAJ:10071049626428824134:AHkA5jQRfWoRNvJIMJ7ZeL1tZJbF&html=&pos=3&folt=cit", "author": ["Abhik Roychoudhury"], "ref": ["9 new citations to articles by Abhik Roychoudhury"]}
{"title": "CombiSan: Unifying Software Sanitizers for Comprehensive Fuzzing", "first_label": ["Fuzzing"], "second_label": [], "data": "M Marini, F Gorter, DC D'Elia, C Giuffrida\nModern C/C++ bug detection efforts heavily rely on fuzzing with software sanitizers. \nHowever, the most popular sanitizers have limited interoperability. As a result, \ndevelopers often enable each sanitizer in isolation, if at all, requiring multiple runs. \nThis sequential execution undermines performance and tests code in a non-uniform \nmanner. In this paper, we present COMBISAN, a fuzzing-optimized sanitizer that \nsimultaneously detects all the addressability, uninitialized memory, and other\nCites: Efficient Greybox Fuzzing to Detect Memory Errors", "link": "https://scholar.google.com/scholar_url?url=https://download.vusec.net/papers/combisan_sec26.pdf&hl=en&sa=X&d=13761163381232975683&ei=An57afDSIeu7ieoP6qqIwQQ&scisig=AHkA5jQ-sMyViVUm89TUjhDqnbah&oi=scholaralrt&hist=ylyK0_8AAAAJ:10071049626428824134:AHkA5jQRfWoRNvJIMJ7ZeL1tZJbF&html=&pos=4&folt=cit", "author": ["Abhik Roychoudhury"], "ref": ["9 new citations to articles by Abhik Roychoudhury"]}
{"title": "\" How did you fix it?\"-Developer's feelings and practices when debugging with large language models: An analysis of reddit discussions", "first_label": ["LLM", "Bug"], "second_label": [], "data": "Y Hao - 2025\nWhile there has been extensive research on software developers' debugging \nprocesses, as the use of large language models (LLMs) enters the field of software \nengineering, their impact on developers has not been fully explored. The aim of this \nthesis is to investigate how developers use LLMs for debugging, including what \nkinds of inputs developers provide to LLMs, the sentiments they express when \ndiscussing LLM-assisted debugging, how they perceive the usefulness of LLM tools\nCites: Automatic program repair", "link": "https://scholar.google.com/scholar_url?url=https://aaltodoc.aalto.fi/bitstreams/5d591fc4-7105-4721-96fe-cdca159a8aba/download&hl=en&sa=X&d=17578543109654747635&ei=An57afDSIeu7ieoP6qqIwQQ&scisig=AHkA5jTmjYV1bCXDhtox72uZnFSC&oi=scholaralrt&hist=ylyK0_8AAAAJ:10071049626428824134:AHkA5jQRfWoRNvJIMJ7ZeL1tZJbF&html=&pos=5&folt=cit", "author": ["Abhik Roychoudhury"], "ref": ["9 new citations to articles by Abhik Roychoudhury"]}
{"title": "Rust Meets Linux: Lessons from an Evolving Experiment", "first_label": [], "second_label": [], "data": "H Li, L Guo, Y Yang, S Wang, M Xu- ACM Transactions on Computer Systems\nLinux, developed over the past three decades, has become the cornerstone of \nmodern computing, serving as the foundation for a wide array of applications ranging \nfrom large-scale supercomputers to resource-constrained embedded devices. \nHowever, this infrastructure has long been plagued by memory and concurrency \nbugs, primarily due to the permissive nature of memory operations in the C \nlanguage. The Rust-for-Linux (RFL) project offers a promising solution to address\nCites: A memory model sensitive checker for C#", "link": "https://scholar.google.com/scholar_url?url=https://dl.acm.org/doi/pdf/10.1145/3789260&hl=en&sa=X&d=3664236488330271427&ei=An57afDSIeu7ieoP6qqIwQQ&scisig=AHkA5jTXITvGYZRwv_corqsgCWCR&oi=scholaralrt&hist=ylyK0_8AAAAJ:10071049626428824134:AHkA5jQRfWoRNvJIMJ7ZeL1tZJbF&html=&pos=6&folt=cit", "author": ["Abhik Roychoudhury"], "ref": ["9 new citations to articles by Abhik Roychoudhury"]}
{"title": "Variability-Aware Detection and Repair of Compilation Errors Using Foundation Models in Configurable Systems", "first_label": [], "second_label": ["Detection", "Repair"], "data": "R Gheyi, L Albuquerque, M Ribeiro, E Almeida- arXiv preprint arXiv, 2026\nModern software systems often rely on conditional compilation to support optional \nfeatures and multiple deployment scenarios. In configurable systems, compilation \nerrors may arise only under specific combinations of features, remaining hidden \nduring development and testing. Such variability-induced errors are difficult to detect \nin practice, as traditional compilers analyze only a single configuration at a time, \nwhile existing variability-aware tools typically require complex setup and incur high\nCites: Automated Program Repair", "link": "https://scholar.google.com/scholar_url?url=https://arxiv.org/pdf/2601.16755&hl=en&sa=X&d=10206251773213498971&ei=An57afDSIeu7ieoP6qqIwQQ&scisig=AHkA5jSW9fJU03D5oiQzHif3hn9U&oi=scholaralrt&hist=ylyK0_8AAAAJ:10071049626428824134:AHkA5jQRfWoRNvJIMJ7ZeL1tZJbF&html=&pos=7&folt=cit", "author": ["Abhik Roychoudhury"], "ref": ["9 new citations to articles by Abhik Roychoudhury"]}
{"title": "BRIDGING Human Expertise and Generative AI in Software Quality: A Study on Code Smell Detection in Software Engineering Education", "first_label": ["Code"], "second_label": ["Detection"], "data": "N Pombo, C Cunha- 2025 IEEE International Conference on Teaching, 2025\nLarge language models (LLMs) transform software engineering by providing AI-\nassisted coding, debugging, and software quality analysis. Integrated into tools such \nas ChatGPT and GitHub Copilot, these models assist in code generation, refactoring, \nand issue detection, improving developer productivity. However, AI still presents \nchallenges such as confabulations, limited contextual understanding, and \ninconsistencies in code recommendations. This study examines the role of LLMs in\nCites: Automated Program Repair  \n \nThis message was sent by Google Scholar because you're following new citations to articles written by \nAbhik Roychoudhury\n.\nList alerts\nCancel alert", "link": "https://scholar.google.com/scholar_url?url=https://ieeexplore.ieee.org/abstract/document/11346609/&hl=en&sa=X&d=18281437616817610793&ei=An57afDSIeu7ieoP6qqIwQQ&scisig=AHkA5jSroR7Jr0Osw9m6sTt46mVy&oi=scholaralrt&hist=ylyK0_8AAAAJ:10071049626428824134:AHkA5jQRfWoRNvJIMJ7ZeL1tZJbF&html=&pos=8&folt=cit", "author": ["Abhik Roychoudhury"], "ref": ["9 new citations to articles by Abhik Roychoudhury"]}
{"title": "DarijaDB: Unlocking Text-to-SQL for Arabic Dialects", "first_label": [], "second_label": [], "data": "S Chafik, S Ezzini, I Berrada- ACM Transactions on Asian and Low-Resource, 2026\nRecent advances in text-to-SQL models, which translate natural language questions \n(NLQs) into executable SQL queries, have made interacting with relational \ndatabases more accessible, even for those with limited technical ability. This task has", "link": "https://scholar.google.com/scholar_url?url=https://dl.acm.org/doi/pdf/10.1145/3787497&hl=en&sa=X&d=3586127652027059043&ei=An57afvKE5Kj6rQP2pO00Qw&scisig=AHkA5jSvHgtmpTyxRd6uW4Aozs8-&oi=scholaralrt&hist=ylyK0_8AAAAJ:5865787842749446205:AHkA5jRdC8MKBKkDX_XYP68jZAAq&html=&pos=1&folt=rel", "author": ["David Lo"], "ref": ["David Lo - new related research"]}
{"title": "Bridging Expert Reasoning and LLM Detection: A Knowledge-Driven Framework for Malicious Packages", "first_label": ["LLM"], "second_label": ["Detection", "Reasoning"], "data": "W Guo, S Song, J Guo, Z Xu, C Liu, H Ou, M Ge, Y Liu- arXiv preprint arXiv, 2026\nOpen-source ecosystems such as NPM and PyPI are increasingly targeted by supply \nchain attacks, yet existing detection methods either depend on fragile handcrafted \nrules or data-driven features that fail to capture evolving attack semantics. We", "link": "https://scholar.google.com/scholar_url?url=https://arxiv.org/pdf/2601.16458&hl=en&sa=X&d=8501539794233390244&ei=An57afvKE5Kj6rQP2pO00Qw&scisig=AHkA5jQAGcDlObV69cvtY7aDv3dX&oi=scholaralrt&hist=ylyK0_8AAAAJ:5865787842749446205:AHkA5jRdC8MKBKkDX_XYP68jZAAq&html=&pos=2&folt=rel", "author": ["David Lo"], "ref": ["David Lo - new related research"]}
{"title": "Comfrey: Mitigating Integration Failures in LLM-enabled Software at Run-Time", "first_label": ["LLM"], "second_label": [], "data": "Y Shao, Y Huang, J Zou, Y Shi, L Yang, L Ma, T Su - 2026\nDue to the unrestricted outputs of LLMs and strict requirements of software \ncomponents, integration failures are widespread in software that incorporates LLM \nagents and retrieval-augmented generation (RAG). Even seemingly correct\n \nThis message was sent by Google Scholar because you're following new articles related to research by \nDavid Lo\n.\nList alerts\nCancel alert", "link": "https://scholar.google.com/scholar_url?url=https://chengcheng-wan.github.io/paper/26-ICSE-Comfrey.pdf&hl=en&sa=X&d=6694213804603656096&ei=An57afvKE5Kj6rQP2pO00Qw&scisig=AHkA5jShNlAWtaZzNFOzpoODoBD3&oi=scholaralrt&hist=ylyK0_8AAAAJ:5865787842749446205:AHkA5jRdC8MKBKkDX_XYP68jZAAq&html=&pos=3&folt=rel", "author": ["David Lo"], "ref": ["David Lo - new related research"]}
{"title": "Integrating Attention Mechanism with Code Structural Affinity and Execution Context Correlation for Automated Bug Repair.", "first_label": ["Code", "Bug"], "second_label": ["Repair"], "data": "J Ji, G Yang- Computers, Materials & Continua, 2026\nAbstract Automated Program Repair (APR) techniques have shown significant \npotential in mitigating the cost and complexity associated with debugging by \nautomatically generating corrective patches for software defects. Despite", "link": "https://scholar.google.com/scholar_url?url=https://search.ebscohost.com/login.aspx%3Fdirect%3Dtrue%26profile%3Dehost%26scope%3Dsite%26authtype%3Dcrawler%26jrnl%3D15462218%26AN%3D190966190%26h%3D%252Ff0jyxEr5yo7Te0OtAXY35cNPM1GuphlhBIDG2WulADJ%252BiwiPM9A92%252BFviB4wbVhhn5U7E3HSrkNabvPqpXU2Q%253D%253D%26crl%3Dc&hl=en&sa=X&d=8389963293695928641&ei=s955aZLtOp2J6rQP7NPO2AY&scisig=AHkA5jTIiD6vQfPzo7dWknOqyMwp&oi=scholaralrt&hist=ylyK0_8AAAAJ:17903213248891513419:AHkA5jQzY4yxbL7oubxUcSYtq2gm&html=&pos=0&folt=rel", "author": ["Hong Jin Kang"], "ref": ["Hong Jin Kang - new related research", "Xin ZHOU - new related research"]}
{"title": "Uncovering Failures in Cyber-Physical System State Transitions: A Fuzzing-Based Approach Applied to sUAS", "first_label": ["Fuzzing"], "second_label": [], "data": "T Chambers, AMR Bernal, M Vierhauser- arXiv preprint arXiv, 2026\nThe increasing deployment of small Uncrewed Aerial Systems (sUAS) in diverse and \noften safety-critical environments demands rigorous validation of onboard decision \nlogic under various conditions. In this paper, we present SaFUZZ, a state-aware\n \nThis message was sent by Google Scholar because you're following new articles related to research by \nHong Jin Kang\n.\nList alerts\nCancel alert", "link": "https://scholar.google.com/scholar_url?url=https://arxiv.org/pdf/2601.05449&hl=en&sa=X&d=4230135510011075571&ei=s955aZLtOp2J6rQP7NPO2AY&scisig=AHkA5jREo4u-VgZ5DUQVYfO6Acbf&oi=scholaralrt&hist=ylyK0_8AAAAJ:17903213248891513419:AHkA5jQzY4yxbL7oubxUcSYtq2gm&html=&pos=1&folt=rel", "author": ["Hong Jin Kang"], "ref": ["Hong Jin Kang - new related research"]}
{"title": "Automating fuzz driver generation for deep learning libraries with large language models", "first_label": ["LLM", "Fuzzing"], "second_label": ["Generation"], "data": "T Zheng, F Meng, P Yi, Y Wu- Cybersecurity, 2026\nThe widespread adoption of deep learning (DL) libraries has raised concerns about \ntheir reliability and security. While prior works leveraged large language models \n(LLMs) to generate test programs for DL library APIs, the hardcoded program", "link": "https://scholar.google.com/scholar_url?url=https://link.springer.com/article/10.1186/s42400-025-00532-9&hl=en&sa=X&d=9592968335886159691&ei=st55aYXcJvDB6rQPlOuskQM&scisig=AHkA5jTBgJlTo4hwRa8NQvQomqHM&oi=scholaralrt&hist=ylyK0_8AAAAJ:5865787842749446205:AHkA5jRdC8MKBKkDX_XYP68jZAAq&html=&pos=0&folt=rel", "author": ["David Lo"], "ref": ["David Lo - new related research"]}
{"title": "Just-In-Time Quality Assurance with Assistance of Automated Defect Prediction and Code Testing", "first_label": ["Code", "Software Testing", "Software Defect"], "second_label": [], "data": "D Tian, L Song, X Su- ACM Transactions on Software Engineering and, 2026\nSoftware testing and defect prediction are widely recognized quality assurance \nactivities that can contribute to the effectiveness and efficiency of Just-In-Time \nSoftware Quality Assurance (JIT-SQA) by automating processes and reducing\n \nThis message was sent by Google Scholar because you're following new articles related to research by \nDavid Lo\n.\nList alerts\nCancel alert", "link": "https://scholar.google.com/scholar_url?url=https://dl.acm.org/doi/pdf/10.1145/3779653&hl=en&sa=X&d=1812669077310241055&ei=st55aYXcJvDB6rQPlOuskQM&scisig=AHkA5jQ7G1BzXFh5_Nauq41j9xWf&oi=scholaralrt&hist=ylyK0_8AAAAJ:5865787842749446205:AHkA5jRdC8MKBKkDX_XYP68jZAAq&html=&pos=1&folt=rel", "author": ["David Lo"], "ref": ["David Lo - new related research"]}
{"title": "Agentic AI for Software Development: Autonomous Agents in Requirements Engineering, Testing, and Deployment", "first_label": ["Software Testing"], "second_label": ["Agent"], "data": "R Konda- International Journal of Emerging Research in, 2025\nThe maturation of agentic AI (autonomous large language model (LLM) agents with \nplanning, tool-use, and memory) is a sea change in software engineering. In contrast \nto the earlier, AI-guided tools that just presented static suggestions or local \ncompletions, AGI AI possesses the capability of goal-directed multi-step reasoning \nacross the entire SDLC. This is most obviously seen in three of the mission-critical \napplications: requirements engineering, testing, and deployment. Each of these\nCites: Coverage-based greybox fuzzing as markov chain  \n \nThis message was sent by Google Scholar because you're following new citations to articles written by \nAbhik Roychoudhury\n.\nList alerts\nCancel alert", "link": "https://scholar.google.com/scholar_url?url=https://ijeret.org/index.php/ijeret/article/view/415&hl=en&sa=X&d=12252217494048157651&ei=st55abTIPKbD6rQPrdag-Qg&scisig=AHkA5jSbWqirCtTPuTDtdRN-NThX&oi=scholaralrt&hist=ylyK0_8AAAAJ:10071049626428824134:AHkA5jQRfWoRNvJIMJ7ZeL1tZJbF&html=&pos=0&folt=cit", "author": ["Abhik Roychoudhury"], "ref": ["1 new citation to articles by Abhik Roychoudhury"]}
